[
    {
        "doc_title": "The Portuguese Third Version of the Copenhagen Psychosocial Questionnaire: Preliminary Validation Studies of the Middle Version among Municipal and Healthcare Workers",
        "doc_scopus_id": "85122987391",
        "doc_doi": "10.3390/ijerph19031167",
        "doc_eid": "2-s2.0-85122987391",
        "doc_date": "2022-02-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Pollution",
                "area_abbreviation": "ENVI",
                "area_code": "2310"
            },
            {
                "area_name": "Public Health, Environmental and Occupational Health",
                "area_abbreviation": "MEDI",
                "area_code": "2739"
            },
            {
                "area_name": "Health, Toxicology and Mutagenesis",
                "area_abbreviation": "ENVI",
                "area_code": "2307"
            }
        ],
        "doc_keywords": [
            "Cross-Sectional Studies",
            "Health Personnel",
            "Humans",
            "Portugal",
            "Psychometrics",
            "Reproducibility of Results",
            "Surveys and Questionnaires"
        ],
        "doc_abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.A third version of the Copenhagen Psychosocial Questionnaire (COPSOQ III) was devel-oped internationally aiming to respond to new trends in working conditions, theoretical concepts, and international experience. This article aims to present the preliminary validation studies for the Portuguese middle version of COPSOQ III. This is an exploratory cross-sectional study view-ing the cross-cultural adaption of COPSOQ III to Portugal, ensuring the contents and face validity and performing field-testing in order to reduce the number of items and to obtain insight into the data structure, through classic test theory and item response theory approaches. The qualitative study encompassed 29 participants and the quantitative one 659 participants from municipalities and healthcare settings. Content analysis suggested that minor re-wording could improve the face validity of items, while a reduced version, with 85 items, shows psychometric stability, achieving good internal consistency in all subscales. The COPSOQ III Portuguese middle version proved to be a valid preliminary version for future validation studies with various populations, able to be used in correlational studies with other dimensions.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Dynamic parliamentary management platform with workflow engine integration",
        "doc_scopus_id": "85100499159",
        "doc_doi": "10.1145/3401895.3402079",
        "doc_eid": "2-s2.0-85100499159",
        "doc_date": "2020-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Computer Vision and Pattern Recognition",
                "area_abbreviation": "COMP",
                "area_code": "1707"
            },
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            }
        ],
        "doc_keywords": [
            "Building dynamics",
            "Business logic",
            "Continuous improvements",
            "Less developed countries",
            "Management platforms",
            "Reducing costs",
            "Work-flows",
            "Workflow engines"
        ],
        "doc_abstract": "© 2020 Owner/Author.Due to the continuous improvement of technology, nearly all the companies and entrepreneurs explore its benefits, to increase their income and enhance their businesses, reducing costs and work time [1]. Thus, technology is also starting to take root in less developed countries, helping with their growth in several areas. This project strives to enhance those countries' legislation, by presenting tools that improve all the inherent mechanics, by following specific requirements that must integrate such systems. The platform combines many elements that work towards several needs, depending on the internal business logic and their parliamentary workflows. Since the solution aims to serve different parliaments, the focus of the implemented project will be on building dynamic components that can adapt to different scenarios.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "BioDepura: Bivalve depuration methodologies adapted to the physiological needs",
        "doc_scopus_id": "85100471084",
        "doc_doi": "10.1145/3401895.3401918",
        "doc_eid": "2-s2.0-85100471084",
        "doc_date": "2020-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Computer Vision and Pattern Recognition",
                "area_abbreviation": "COMP",
                "area_code": "1707"
            },
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            }
        ],
        "doc_keywords": [
            "Bivalve molluscs",
            "Depuration",
            "Mobile applications",
            "Monitoring and controlling",
            "Monitoring water quality",
            "Sensors and actuators",
            "Water quality data",
            "Water quality monitoring"
        ],
        "doc_abstract": "© 2020 Owner/Author.Currently, in aquaculture, farmers of bivalve molluscs face issues in monitoring water quality and how to improve it efficiently, aiming to maximize the quantity and quality of these animals. The technology has evolved and continues to grow exponentially. Nowadays, any sector uses it to optimize resources to maximize production. Aquaculture can't be different, so it's necessary to create a system that allows monitoring and controlling water quality. This system will help establish the ideal depuration conditions. The paper presents a real-time water quality monitoring and controlling system for the depuration of bivalve molluscs. This system is composed of a set of sensors and actuators, to obtain water quality data and to control it, and web and mobile applications, so that farmers can visualize in real-time the data acquired by the sensors and control the water quality remotely. Furthermore, these applications could set rules to optimize the depuration process and define an ideal water quality to control it automatically. The developed system allows farmers of bivalve to permanently monitoring over the aquarium, without their presence on site.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "System to Support Multidimensional Assessment of Human Functioning",
        "doc_scopus_id": "85077495173",
        "doc_doi": "10.1007/978-3-030-37737-3_36",
        "doc_eid": "2-s2.0-85077495173",
        "doc_date": "2020-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Assessment instruments",
            "Functioning assessment",
            "Human functioning",
            "Model-view-controller architectures",
            "Older adults",
            "Qualitative evaluations",
            "Quantitative and qualitative methods",
            "Quantitative evaluation"
        ],
        "doc_abstract": "© 2020, Springer Nature Switzerland AG.Considering the importance of the assessment of human function, the present paper reports a research study that aimed to develop an information system to support a comprehensive set of clinical instruments. Following the requirements analysis, the system was implementing according the Model-View-Controller architecture. The system allows the selection of the most appropriate assessment instruments for a given patient the registration of the assessments carried out, as well as the access to consolidated information for correct decision-making, and was evaluated using quantitative and qualitative methods. The quantitative evaluation consisted in a usability assessment using the Post-Study System Usability Questionnaire, while the qualitative evaluation consisted in a focus group to determine the perceived utility of the developed system to support the care of older adults. The results show the potential of the system to support the care of older adults.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Web platform to support multidimensional assessment of human functioning",
        "doc_scopus_id": "85070057496",
        "doc_doi": "10.23919/CISTI.2019.8760987",
        "doc_eid": "2-s2.0-85070057496",
        "doc_date": "2019-06-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Assessment tool",
            "Clinical tools",
            "Human functioning",
            "Multi dimensions"
        ],
        "doc_abstract": "© 2019 AISTI.The present article reports a study that aimed to develop a web platform to support a comprehensive set of clinical tools for the assessment of human functioning. The platform allows the selection of the most appropriate assessment tools for a given patient, the registration of the assessments carried out, as well as the access to consolidated information for correct decisionmaking.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Mapping of processes for the integration of civil registry systems in São Tomé and Príncipe",
        "doc_scopus_id": "85078546618",
        "doc_doi": null,
        "doc_eid": "2-s2.0-85078546618",
        "doc_date": "2018-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            },
            {
                "area_name": "Management Information Systems",
                "area_abbreviation": "BUSI",
                "area_code": "1404"
            },
            {
                "area_name": "Management of Technology and Innovation",
                "area_abbreviation": "BUSI",
                "area_code": "1405"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Automated process",
            "Computer-based system",
            "Integral part",
            "SIGA"
        ],
        "doc_abstract": "© 2018 Associacao Portuguesa de Sistemas de Informacao. All rights reserved.The Civil Register throughout the Vital Statistics provides key information for analysis and planning of multisector policies based on age and geographic distribution of populations. Based on computer systems and automated processes are an integral part of supporting the consolidation of these systems in developing countries in order to reach more acceptable levels of coverage (Notzon, 2014) (WBC & WHO, 2015) and that guarantee citizens the right to a legal identity and citizenship (Ayebale, 2015). This article presents the perspective followed in the implementation of a computer-based system for the Civil Registry and Vital Statistics in São Tomé and Príncipe, which that aims to simplify and streamline existing processes, reduce bureaucracy and improve the provision of services to citizens, contributing a new role and support the assumption that robust Civil Registry and Vital Statistics provide direct benefits to individuals and greater accountability of governments.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Natural transmission of information extraction results to end-users – a proof-of-concept using data-to-text",
        "doc_scopus_id": "85032615325",
        "doc_doi": "10.4230/OASIcs.SLATE.2017.20",
        "doc_eid": "2-s2.0-85032615325",
        "doc_date": "2017-10-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Geography, Planning and Development",
                "area_abbreviation": "SOCI",
                "area_code": "3305"
            },
            {
                "area_name": "Modeling and Simulation",
                "area_abbreviation": "MATH",
                "area_code": "2611"
            }
        ],
        "doc_keywords": [
            "Automatic translation",
            "Data-to-Text",
            "Natural language generation",
            "Opinions",
            "Portuguese",
            "Tourism"
        ],
        "doc_abstract": "© José Casimiro Pereira, António J. S. Teixeira, Mário Rodrigues, Pedro Miguel, and Joaquim Sousa PintoInformation Extraction from natural texts has a great potential in areas such as Tourism and can be of great assistance in transforming customers’ comments in valuable information for Tourism operators, governments and customers. After extraction, information needs to be e ciently transmitted to end-users in a natural way. Systems should not, in general, send extracted information directly to end-users, such as hotel managers, as it can be di cult to read. Naturally, humans transmit and encode information using natural languages, such as Portuguese. The problem arising from the need of e cient and natural transmission of the information to end-user is how to encode it. The use of natural language generation (NLG) is a possible solution, for producing sentences, and, with them, texts. In this paper we address this, with a data-to-text system, a derivation of formal NLG systems that use data as input. The proposed system uses an aligned corpus, which was defined, collected and processed, in about approximately 3 weeks of work. To build the language model were used three di erent in-domain and out-of-domain corpora. The e ects of this approach were evaluated, and results are presented. Automatic metrics, BLEU and Meteor, were used to evaluate the di erent systems, comparing their values with similar systems. Results show that expanding the corpus has a major positive e ect in BLEU and Meteor scores and use of additional corpora (in-domain and out-of-domain) in training language model does not result in significantly di erent performance. The scores obtained, combined with their comparison with other systems performance and informal evaluation by humans of the sentences produced, give additional support for the capabilities of the translation based approach for fast development of data-to-text for new domains.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Sky Computing: exploring the aggregated Cloud resources",
        "doc_scopus_id": "85008659743",
        "doc_doi": "10.1007/s10586-017-0727-5",
        "doc_eid": "2-s2.0-85008659743",
        "doc_date": "2017-03-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            }
        ],
        "doc_keywords": [
            "Distributed architecture",
            "Efficiency loss",
            "Heterogeneous resources",
            "High performance computing",
            "Hybrid clouds",
            "Intensive computing",
            "Resource optimization",
            "State of the art"
        ],
        "doc_abstract": "© 2017, Springer Science+Business Media New York.The Cloud wide spawn and maturing has brought the attention of High-Performance Computing consumers, willing to move to its potential. The use of those resources to make intensive computing proficiently is a requirement to achieve the final goal of supporting intensive computing applications. The big challenge here is managing the combined resources of available Clouds, public or private and interoperating between them without an excessive efficiency loss. On the other hand, the resource optimization can also be undertaken by maximizing the existing resources, even if not intended for Cloud purposes or not having state-of-the-art hardware. This paper proposes an architecture, shows how to implement it and experiments on how to integrate heterogeneous resources on a hybrid Cloud infrastructure.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Risks, trust and results: The project's methodology underneath Cape Verde's Justice Information System",
        "doc_scopus_id": "84971336972",
        "doc_doi": "10.1109/ICEDEG.2016.7461695",
        "doc_eid": "2-s2.0-84971336972",
        "doc_date": "2016-04-27",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            },
            {
                "area_name": "Urban Studies",
                "area_abbreviation": "SOCI",
                "area_code": "3322"
            },
            {
                "area_name": "Sociology and Political Science",
                "area_abbreviation": "SOCI",
                "area_code": "3312"
            }
        ],
        "doc_keywords": [
            "Africa",
            "Cape Verde",
            "Development countries",
            "E justices",
            "Justice",
            "PALOP"
        ],
        "doc_abstract": "© 2016 Information Systems Research Group, University of Fribourg.This paper presents the latest developments on the Cape Verde's Justice Information System. It addresses the methodology, the research and the development work taken to achieve the current system's maturity.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Support architecture to desmaterialization of banking operations",
        "doc_scopus_id": "84943328623",
        "doc_doi": "10.1109/CISTI.2015.7170456",
        "doc_eid": "2-s2.0-84943328623",
        "doc_date": "2015-07-28",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Education",
                "area_abbreviation": "SOCI",
                "area_code": "3304"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Banking operations",
            "Dematerialization",
            "desmaterialization",
            "hybrid",
            "Master's degree",
            "mobile",
            "Technological challenges",
            "Technological innovation"
        ],
        "doc_abstract": "© 2015 AISTI.The technological challenges have led the bank sector to actively bet on technological innovation strategy including the provision of applications for mobile devices. However, the development of mobile tools has had a greater expression for customers than for commercial managers of banks. This article aims to present an architecture that supports the dematerialization of transactions at the counters of bank branches. The main goal is to foster the relationship between banks and their customers, giving flexibility to managers to conduct banking transactions from any mobile device, anywhere. This architecture is a results of a dissertation carried out under a master's degree in Information Systems.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Continuous integration using cloud computing",
        "doc_scopus_id": "84943327959",
        "doc_doi": "10.1109/CISTI.2015.7170451",
        "doc_eid": "2-s2.0-84943327959",
        "doc_date": "2015-07-28",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Education",
                "area_abbreviation": "SOCI",
                "area_code": "3304"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Battery of tests",
            "build",
            "Continuous integrations",
            "deployment",
            "Distributed environments"
        ],
        "doc_abstract": "© 2015 AISTI.Nowadays systems can evolve quickly, and to this growth is associated, for example, the addiction of new features, or even the change of system perspective, required by the stakeholders. Consequently, these cause an increase in the number of developed tests. Run a large battery of tests sequentially can take hours. However, tests can run faster in a distributed environment with rapid availability of pre-configured systems, such as Cloud Computing. This paper pretends to demonstrate some scenarios on the implementation of the practice Continuous Integration (CI) in Information Systems, with software tests performed on Cloud Computing. The main goal is explore the most of capacities that CI practice gives, for automating the build and testing in a Information System.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Transparency in the national assemblies of Portuguese speaking African countries: Adapting the bungeni parliamentary system - The case study of Sao Tome and Principe",
        "doc_scopus_id": "84943327625",
        "doc_doi": "10.1109/CISTI.2015.7170486",
        "doc_eid": "2-s2.0-84943327625",
        "doc_date": "2015-07-28",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Education",
                "area_abbreviation": "SOCI",
                "area_code": "3304"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "badap",
            "bungeni",
            "E-government services",
            "governance",
            "Sao Tome and Principe"
        ],
        "doc_abstract": "© 2015 AISTI.The Internet exists in our reality as the fastest way to provide information, whether institutional orfrom the so-called social networks. Thus the E-Government services began to emerge globally in the last decade and are now taken for granted in modern society. However, this is not the reality in all countries. The work described in this article aims to bring attention and attempts to fill a technological need in the Lusophone African countries. This need is due to a low investment on the implementation of E-government services. On this assumption, the article intents to demonstrate the case study of an application in a E-Government Parliamentary scenario inside the National Assembly of Sao Tome and Principe. The implementation of such a service allows for a increased efficiency in documental management on the Assembly and also provides a degree of transparency in parliamentary activities, which would once be impossible to convey.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Towards a hybrid NLG system for Data2Text in Portuguese",
        "doc_scopus_id": "84943279860",
        "doc_doi": "10.1109/CISTI.2015.7170419",
        "doc_eid": "2-s2.0-84943279860",
        "doc_date": "2015-07-28",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Education",
                "area_abbreviation": "SOCI",
                "area_code": "3304"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Automatic translation",
            "Data2Text",
            "False positive",
            "Linguistic features",
            "Natural language generation",
            "Portuguese",
            "Quality evaluation",
            "Template-based"
        ],
        "doc_abstract": "© 2015 AISTI.In many new interactions with machines, such as dialogue or output using voice, there is the need to convert information internal to a system into sentences, using Data2Text systems. Trying to avoid the limitations of template-based and classical NLG methods, systems based on automatic translation have been proposed in recent years. Despite providing sentences with the important variability needed for a better interaction, this doesn't come without a cost. Contrary to template-based, these systems produce sentences with heterogeneous quality. In this paper we proposed to combine a translation based NLG system with a classifier module capable of providing information on the Intelligibility or Quality of the sentences. Sentences marked as unacceptable are replaced by template-based generated ones. This classifier module is the main focus of the paper and combines extraction of linguistic features with a classifier trained in a manually annotated corpus. Results suggest that our approach is valid as best results obtained have false positives below 8% and this metric can be even lower in practical applications, decreasing to around 3%, as the generation module produces low quality sentences at a rate lower than 30%.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "The living usability lab architecture: Support for the development and evaluation of new ambient assisted living services for the elderly",
        "doc_scopus_id": "85053942221",
        "doc_doi": "10.1201/b18520",
        "doc_eid": "2-s2.0-85053942221",
        "doc_date": "2015-01-01",
        "doc_type": "Book Chapter",
        "doc_areas": [
            {
                "area_name": "Medicine (all)",
                "area_abbreviation": "MEDI",
                "area_code": "2700"
            },
            {
                "area_name": "Health Professions (all)",
                "area_abbreviation": "HEAL",
                "area_code": "3600"
            },
            {
                "area_name": "Biochemistry, Genetics and Molecular Biology (all)",
                "area_abbreviation": "BIOC",
                "area_code": "1300"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© 2015 by Taylor & Francis Group, LLC.The introduction of technology in the domestic environment is a reality. For the elderly, a significant percentage of the population, technology can have a positive impact on their quality of life. However, this can only be true if technologies for domestic environments are made accessible and usable by those staying at home. The Living Usability Lab (LUL) project aims to create conditions for the development and evaluation of innovative services for the elderly. Two of the main characteristics of the project are its attention to usability and design for all, and the exploration of next-generation networks. This chapter presents the conceptual architecture adopted for the living lab and the support architecture for development of new, complex ambient assisted living (AAL) services. The genesis of the living lab ecosystem is the aim to create an environment where developers and care professionals are able to create innovative AAL applications and services with ease and with access to a whole set of test groundings. To support our proposal, a new service for telerehabilitation-developed by the project-is used as a scenario within the proposed architectures.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Sky computing: Exploring the aggregated cloud resources - Part II",
        "doc_scopus_id": "84906692167",
        "doc_doi": "10.1109/CISTI.2014.6876862",
        "doc_eid": "2-s2.0-84906692167",
        "doc_date": "2014-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Distributed architecture",
            "Efficiency loss",
            "High-performance computing",
            "Intensive computing",
            "Proposed architectures",
            "Resource optimization"
        ],
        "doc_abstract": "The Cloud wide spawn and maturing has brought the attention of High-Performance Computing consumers, willing to move to its potential. The use of those resources to make intensive computing proficiently is a requirement to achieve the final goal of supporting HPC applications. The big challenge here is managing the combined resources of available Clouds, public or private and interoperating between them without an excessive efficiency loss. This work reflects the continuation of the authors' work, describing the results of the proposed architecture on the first part. © 2014 AISTI.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "The building blocks of a PaaS",
        "doc_scopus_id": "84895924083",
        "doc_doi": "10.1007/s10922-012-9260-2",
        "doc_eid": "2-s2.0-84895924083",
        "doc_date": "2014-01-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Strategy and Management",
                "area_abbreviation": "BUSI",
                "area_code": "1408"
            }
        ],
        "doc_keywords": [
            "Building blockes",
            "Development environment",
            "Management applications",
            "Performance testing",
            "Proof of concept",
            "Service provider",
            "Software developer",
            "WEB application"
        ],
        "doc_abstract": "Traditional cloud computing providers enable developers to program and deploy applications in the cloud by using platform as a service (PaaS) providers. Despite the benefits of such an approach, this service model usually comes with a high level of the lock in effect into the service provider. The lock in effect occurs when a software developer needs to change its cloud provider. When this happens, it usually means a major application rewrite, specific for the new PaaS. This paper details the initial results of a project whose goal is to build a PaaS where vendor lock in does not occur. With this PaaS, developers wishing to deploy their applications into the cloud may continue to program using their usual development environments. There are no necessary changes required to make the application PaaS compatible. As a proof of concept, we developed an open source PaaS management application as a regular web application and then deployed it on the cloud. © Springer Science+Business Media New York 2013.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Risk factors in e-justice information systems",
        "doc_scopus_id": "84879085497",
        "doc_doi": "10.1016/j.giq.2013.02.002",
        "doc_eid": "2-s2.0-84879085497",
        "doc_date": "2013-07-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Sociology and Political Science",
                "area_abbreviation": "SOCI",
                "area_code": "3312"
            },
            {
                "area_name": "Library and Information Sciences",
                "area_abbreviation": "SOCI",
                "area_code": "3309"
            },
            {
                "area_name": "Law",
                "area_abbreviation": "SOCI",
                "area_code": "3308"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "With the increase of the communication systems' bandwidth and with the dissemination of the information systems, the fields of information and communication technology application expanded in almost all directions. E-government in general and e-justice in particular are no exception and these areas suffered strong changes in the last decades. There is no democracy without a system of swift and transparent justice. Therefore, the introduction of information systems in the courts allows a decrease both in time and number of pending processes, boosting the efficiency of the services provided to citizens and to the society in general.This paper analyzes and discusses different worldwide e-justice experiences. Special emphasis is addressed on the risk factors on the design, development and implementation of such systems. Finally, we present our own experience in the development of an e-justice information system in Cape Verde, an African development country. The scope of our system ranges from the design team until the training of the justice agents. © 2013 The Authors.",
        "available": true,
        "clean_text": "serial JL 272070 291210 291706 291771 291820 291837 291861 31 90 Government Information Quarterly GOVERNMENTINFORMATIONQUARTERLY 2013-05-23 2013-05-23 2014-09-02T12:51:31 S0740-624X(13)00038-5 S0740624X13000385 10.1016/j.giq.2013.02.002 S300 S300.3 FULL-TEXT 2015-05-15T02:07:55.919475-04:00 0 0 20130701 20130731 2013 2013-05-23T00:00:00Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid fundingbodyid hubeid indexeddate issfirst issn issnnorm issuelist itemstage itemtransactionid itemweight oauserlicense openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder sponsoredaccesstype srctitle srctitlenorm srctype ssids alllist content oa subj subheadings tomb volfirst volissue volumelist yearnav figure table body affil articletitle auth authfirstini authfull authkeywords authlast highlightsabst primabst ref vitae 0740-624X 0740624X UNLIMITED NONE true 30 30 3 3 Volume 30, Issue 3 4 241 256 241 256 201307 July 2013 2013-07-01 2013-07-31 2013 article fla Copyright © 2013 The Authors. Published by Elsevier Inc. RISKFACTORSINEJUSTICEINFORMATIONSYSTEMS ROSA J 1 Introduction 2 Case studies 2.1 Singapore 2.1.1 The Justice system prior to ICT attempts 2.1.2 ICT evolution 2.1.3 Results and lessons learned 2.2 Brazil 2.2.1 The Justice system prior to ICT attempts 2.2.2 ICT evolution 2.2.3 Results and lessons learned 2.3 Belgium 2.3.1 The Justice system prior to ICT attempts 2.3.2 ICT evolution 2.3.3 Results and lessons learned 2.4 Portugal 2.4.1 The Justice system prior to ICT attempts 2.4.2 ICT evolution 2.4.3 Results and lessons learned 3 Comparative analysis between case studies 4 On the modeling of e-government systems 5 The Cape Verde experience 6 Risk factors 7 Conclusion and future work References ABRANTES M AFRICAIPARLIAMENTS AKOMANTOSO ANDRADE 2010 A PROCEEDINGS4THINTERNATIONALCONFERENCETHEORYPRACTICEELECTRONICGOVERNANCEICEGOV10PEQUIM ORGANIZATIONALSTRUCTUREICTSTRATEGIESINBRAZILIANJUSTICE BARRA 2006 M INFRAESTRUTURADECHAVESPUBLICASBRASILEIRAICPBRASILEAFORMACAOESTADOELECTRONICO INFRAESTRUTURADECHAVESPUBLICASBRASILEIRAICPBRASILEAFORMACAOESTADOELECTRONICO BUNGENI COELHO 2010 M SIXTHSYMPOSIUMEXHIBITIONICAOMRTDSBIOMETRICSSECURITYSTANDARDS ICPBRASILBRAZILIANPKI CONSELHONACIONALDEJUSTICA CONSELHOSUPERIORDAMAGISTRATURAJUDICIAL 2010 RELATORIOSOBREASITUACAODAJUSTICA DIRECCAOGERALDAPOLITICADEJUSTICA 2005 REFORMACONTENCIOSOADMINISTRATIVO BREVEGUIAPRATICOSITAF ECONOMISTINTELLIGENCEUNIT 2011 DEMOCRACYINDEX2011 FABRI 2007 1 28 M INFORMATIONCOMMUNICATIONTECHNOLOGYFORPUBLICPROSECUTORSOFFICE COMPARINGUSEINFORMATIONCOMMUNICATIONTECHNOLOGIESINEUROPEANPUBLICPROSECUTIONOFFICES GABINETEDEACOMPANHAMENTODAINFORMATIZACAONOSTRIBUNAISGAITASJP 2009 ASSOCIACAOSINDICALDOSJUIZESPORTUGUESES PRIMEIROSSEISMESESDEUTILIZACAOCITIUSINQUERITODEAVALIACAOAFUNCIONALIDADEEEFICIENCIARELATORIOPRELIMINAR GUPTA 2006 172 S FORTYFOURYEARSCOMPUTERPERSONNELRESEARCHACHIEVEMENTSCHALLENGESFUTURESIGMISCPR06 ENDUSERTRAININGMETHODSPROCEEDINGS2006ACMSIGMISCPRCONFERENCECOMPUTERPERSONNELRESEARCH HARIHARAN 2012 A ACHIEVINGGREATERTRANSPARENCYINLEGISLATURESTHROUGHUSEOPENDOCUMENTSTANDARDS LEGISLATIVEXMLCREATIONBUNGENIEDITOR INSTITUTODASTECNOLOGIASDEINFORMACAONAJUSTICA INSTITUTONACIONALDEESTATISTICADECABOVERDE 2011 APRESENTACAODOSRESULTADODEFINITIVOSRECENSEAMENTOGERALDAPOPULACAOEHABITACAORGPH2010 ITI JAEGER 2003 389 394 P KUK 2003 353 363 G LANGBROEK 2009 8 26 P MAGNUS 1999 R EJUSTICESINGAPORESTORY 2009 EJUSTICEINFORMATIONCOMMUNICATIONTECHNOLOGIESINCOURTSYSTEM MICROSOFT MINISTERIODAJUSTICA 2003 DIARIODAREPUBLICAISERIEBPORTARIANO14172003DE30DEDEZEMBRODE2003 MINISTERIODAJUSTICA 2008 DIARIODAREPUBLICA1ASERIENO118PORTARIANO4572008DE20DEJUNHODE2008 MINISTERIODAJUSTICA 2008 DIARIODAREPUBLICA1ASERIENO26PORTARIANO1142008DE6DEFEVEREIRODE2008 MINISTERIODAJUSTICA 2010 DIARIODAREPUBLICA1ASERIENO131PORTARIANO4712010DE8DEJULHODE2010 MINISTERIODAJUSTICA 2010 DIARIODAREPUBLICA1ASERIENO68PORTARIANO195A2010DE8DEABRILDE2010 NEVES 2009 54 56 C OASIS OECD 2003 EGOVERNMENTIMPERATIVE ORZESSEK 1997 M ATMMPEG2INTEGRATINGDIGITALVIDEOBROADBANDNETWORKS PRESIDENCIADOCONSELHODEMINISTROS 2006 DIARIODAREPUBLICAISERIEADECRETOLEINO116A2006DE16DEJUNHODE2006 PRESIDENCIADOCONSELHODEMINISTROS 2011 DIARIODAREPUBLICA1ASERIENO454DEMARCODE2011 RADIOTELEVISAOCABOVERDIANA RORISSA 2010 161 169 A SANTOS 2005 82 109 B SCHAAD 2005 A ACASESTUDYSEPARATIONDUTYPROPERTIESINCONTEXTAUSTRIANELAWPROCESS SIC 2011 JORNALDANOITEEDICAO131220111APARTE SILVA M SINGAPORENETWORKSERVICESPTELTD TEIXEIRA 2012 C ELEARNINGBOOK4 ASSISTEDJOBTRAINING TELECOMSPACE 2011 ASYNCHRONOUSTRANSFERMODETELECOMSPACETELECOMSPACE UNDESA UNITEDNATIONS 2008 EGOVERNMENTSURVEY2008 UNITEDNATIONS 2010 EGOVERNMENTSURVEY2010 UNITEDNATIONS 2012 EGOVERNMENTSURVEY2012 VELICOGNA 2007 129 147 M VELICOGNA 2011 163 187 M VUYST 2006 B ICEC06PROCEEDINGS8THINTERNATIONALCONFERENCEELECTRONICCOMMERCEFREDERICTONNEWBRUNSWICK PHENIXPROJECTACASESTUDYEJUSTICEINBELGIUM WEVER 2009 W 15THGCCEGOVERNMENTESERVICESFORUMDUBAI EJUSTICEPERSPECTIVESGCC ROSAX2013X241 ROSAX2013X241X256 ROSAX2013X241XJ ROSAX2013X241X256XJ Full 2013-07-16T20:32:22Z Author item S0740-624X(13)00038-5 S0740624X13000385 10.1016/j.giq.2013.02.002 272070 2014-09-02T17:16:56.854912-04:00 2013-07-01 2013-07-31 UNLIMITED NONE true 1226890 MAIN 16 63908 849 656 IMAGE-WEB-PDF 1 gr9 18559 167 536 gr8 43429 406 536 gr7 42659 457 389 gr6 25145 386 389 gr5 41462 407 536 gr4 42266 534 389 gr3 35120 423 389 gr2 19946 181 380 gr10 49279 438 491 gr1 34396 392 389 gr9 4926 68 219 gr8 11086 164 216 gr7 3533 163 139 gr6 3840 164 165 gr5 11013 164 216 gr4 2716 163 119 gr3 3382 164 151 gr2 9199 104 219 gr10 11184 164 184 gr1 4917 164 163 GOVINF 923 S0740-624X(13)00038-5 10.1016/j.giq.2013.02.002 The Authors Fig. 1 ATOMS architecture. Fig. 2 General implementation of Singapore's 2nd generation of information systems. Fig. 3 Singapore justice PKI. Fig. 4 Brazilian PKI. Fig. 5 Brazil's CA conceptual architecture. Fig. 6 SITAF distribution architecture. Fig. 7 Portuguese PKI. Fig. 8 Portugal's CA conceptual architecture. Fig. 9 SIPP's overall architecture. Fig. 10 Governmental network (circa 2008). Table 1 Developing comparative analysis. Country Information system Developing time Development Still working? Start End Singapore ATOMS 1993 1999 In house and outsource Yes Desktop app 1993 1999 In house and outsource No EFS 1999 – Outsource Yes ICJS 2002 – Outsource Yes Brazil State IS – 2010 In house and outsource No Country IS 2010 – In house Yes Belgium Phenix 2001 2007 Outsource No Portugal Habilus – – In house Yes SITAF – 2004 In house Yes CITIUS 2005 2008 In house Yes CITIUS Plus 2010 – In house No SITAF 2.0 2011 – In house No AGIC 2011 – In house No Table 2 Features comparative analysis. Country Information system Access type Architecture Offline work Still working? Singapore ATOMS Desktop Centralized No Yes Desktop app Desktop – – No EFS Web – – Yes ICJS Web – – Yes Brazil State IS Web Centralized – No Country IS Web Centralized – Yes Belgium Phenix Web – – No Portugal Habilus Desktop – No Yes SITAF Web Distributed No Yes CITIUS Web Distributed No Yes CITIUS Plus Web Centralized Yes No SITAF 2.0 Web – – No AGIC Web Centralized – No Risk factors in e-justice information systems João Rosa Cláudio Teixeira ⁎ Joaquim Sousa Pinto Department of Electronics, Telecommunications and Informatics, University of Aveiro, Aveiro, Portugal Department of Electronics, Telecommunications and Informatics University of Aveiro Aveiro Portugal ⁎ Corresponding author. Fax: +351 234 370 545. With the increase of the communication systems' bandwidth and with the dissemination of the information systems, the fields of information and communication technology application expanded in almost all directions. E-government in general and e-justice in particular are no exception and these areas suffered strong changes in the last decades. There is no democracy without a system of swift and transparent justice. Therefore, the introduction of information systems in the courts allows a decrease both in time and number of pending processes, boosting the efficiency of the services provided to citizens and to the society in general. This paper analyzes and discusses different worldwide e-justice experiences. Special emphasis is addressed on the risk factors on the design, development and implementation of such systems. Finally, we present our own experience in the development of an e-justice information system in Cape Verde, an African development country. The scope of our system ranges from the design team until the training of the justice agents. Keywords E-justice E-government Risk factors Information system Developing countries Cape Verde 1 Introduction In the last decade e-government systems became a central concern in the countries' policies. E-government is defined by OECD as “the use of information and communication technologies, and particularly the Internet, as a tool to achieve better government” (OECD, 2003). These information systems provide a tool to organizations and people to computerize procedures and everyday tasks, combining technology, organization know-how and people experience. E-government states that it can improve efficiency, decrease budget and increase trust between society and governments. With these major goals, governments can reform public services, improve quality and try to reduce corruption. The separation amongst the executive, legislative and judicial powers is the keystone in democratic countries. Citizens hope to have a fair, efficient and transparent justice system. To help reaching for better justice, e-justice information systems are designed to handle lawsuit related information, mimicking and possibly improving traditional paper based workflows, thus providing a useful tool to involved agents. According to the 2011 Economist Intelligence Unit report (Economist Intelligence Unit, 2011), Cape Verde is the first African country in the Democracy Index (ranked 26th), leading over countries like Portugal (ranked 27th), France (ranked 29th) or Brazil (ranked 45th) and just behind Spain (ranked 25th). Over the last decades they have improved their democratic structures, developing democracy, and their efforts are recognized by the international community. Cape Verde is an archipelago of 9 islands located in the Atlantic Ocean with a combined area of over 4000km2. According to the 2010 census, the country has 491,875 inhabitants, 50.5% female and 49.5% male (Instituto Nacional de Estatística de Cabo Verde, 2011). The population increased 11.6% compared to the 2000 census. In terms of justice, in 2008, 8415 court cases were filed and in 2009 there was a decrease of 5.56% on filed cases, totaling 7972 new cases (Conselho Superior da Magistratura Judicial, 2010). In terms of cases reaching a decision, there were 7762 in 2008, and 6996 in 2009, signaling a decrease of 10.95% on decided cases. When comparing filed vs. decided cases (pendency), there is a drag of 8% cases in 2008 and 12% cases in 2009, totaling about 10% of dragged cases in just 2 years. At this rate, the courts will be more and more clogged and justice will be served more and more slowly. The informatics tools presented in the justice system were virtually nil with only productivity tools installed and used in the clerk's computers at the courthouses. This makes the procedure slow and time consuming, because there is no standard procedure through the justice system and the assignment of human resources is not efficient. Therefore, in 2008 the Cape Verdean Ministry of Justice started the planning for the development of an information system, named SIPP (Sistema de Informação do Processo Penal/Criminal Proceedings Information System), to be used in the courts of law. SIPP is a joint initiative, sponsored by the Ministry of Justice of Cape Verde, the Superior Council of Magistracy and the Superior Council of Prosecutors and would be developed from scratch by the University of Aveiro and University of Cape Verde. The SIPP has been in testing phase since June 2010 and will be put in production during 2012. This paper assesses the risk factors of developing such system, based on previous experiences and on our own experience. This paper is organized as follows: this section introduces the problem addressed in this paper; Section 2 details on previous experiences worldwide regarding the adoption of electronic systems to court cases; Section 3 compares the cases studies presented and draws conclusions from these experiences; Section 4 presents the information systems and tools used for modeling e-government systems; Section 5 presents the Cape Verdean experience; Section 6 presents the risk factors involved in e-justice systems; and finally, Section 7 presents the conclusions and future work. 2 Case studies In this section we present what we assessed as relevant case studies in e-justice systems. The process of analysis and comparison of the case studies is based on the methodology defined by Velicogna et al. (Velicogna, Errera, & Derlange, 2011; Velicogna, 2007). According with the authors, their methodology is the most effective to study the innovative character of ICT (Information and Communication Technology) in the broad area of Justice. In the aforementioned methodology, authors make a comparative analysis of the case studies within different categories (Technology, Organization, and Complexity). Similar to this approach, Fabri (2007) uses his own topic characterization to evaluate the case studies. Despite being based on the Velicogna's approach, our analysis includes broader geographical, social, economic, and political information of the countries analyzed. This broader overview helps to contextualize the problems that each country tried to address at a given time. Within every case studied, we describe the Justice scenario from the first computerization attempts to the currently solutions (if any). As important as the system-per-system comparison, we bring a development perspective of each of the analyzed countries. Also, when information about the overall system infrastructure is available (from state of the art, local legislation and regulations, social communication, etc.), we include it on the evolution overview. Finally, considering that even the best computer systems require users to interact with, if available, we include the user's feedback, the development support groups' feedback and usage information about the analyzed systems. This approach presents readers an overview in terms of evolution of each country's Justice ICT efforts, and offers an evolution comparison (Justice wide), rather than a comparison over specific systems. The evolution and outcome of each country's Justice System offer invaluable lessons in terms of what to do, what to expect, and what not to do when starting a new project or an evolution of a project within the Justice System. The criteria to choose the relevant case studies were: (1) their innovative character; (2) the quality of available information (both technical and non-technical) about those systems; (3) the different social contexts and culture mindsets in which such systems were deployed; and (4) failed and successful examples. 2.1 Singapore 2.1.1 The Justice system prior to ICT attempts Singapore was the first country to design and implement an information system for the justice system. Back in 1991, Singapore's justice system faced the backlog problem, where a case took too long to produce a decision, and unsolved processes started to increase (Magnus, 1999). When the authorities diagnosed the justice system, they tried to find the causes for this problem and created a plan to decrease the time it took to produce a decision. This was accomplished by adopting solutions like night courts and cultural changes in methods and approaches when working in a case (Subordinate Courts). In 1993 the backlog problem was solved and the justice authorities wanted to increase the courts' performance, continuing with the new reforms. 2.1.2 ICT evolution To execute the new reforms, the justice authorities used the knowledge network created with their worldwide peers, facing the same problems, and adopted good practices, know-how and technology to create the first e-justice information system. This information system is based on multimedia kiosks, named ATOMS (Automated Traffic Offence Management System) (Magnus, 1999). With these multimedia kiosks they exposed some court services to citizens, like the payment of fines and the ability to plead guilty of offenses by the citizens, 24h a day, 7days a week, through this system. This is a centralized system, where all multimedia kiosks are linked to ATOMS database, which manages the offender's information (Fig. 1 ). This system was the pioneer in the e-justice systems, enabling citizens to pay their fines, or consulting cases in other locations, without addressing to the court. In 1996 Singapore authorities took a new approach in application development and infrastructure management. Until then, the application development and infrastructure management were ensured by IT (Information Technology) professionals linked to the public authorities. This approach led to a budget escalation. In 1996 however, the authorities decided to outsource both application development and infrastructure management, releasing resources to apply in other projects, other areas or new reforms. This approach was expected to reduce the overall budget, while boosting the country's economic growth. In 1999 web-based applications began replacing desktop applications. Not only had the application's interactivity changed, but also the standard web-based access to information enabled data and documents exchange between justice entities. This helped on improving efficiency, transparency and decreasing the time consumed, because it changed the way of addressing the Court. This second generation of information systems uses a typical 3-tier layer (Fig. 2 ) using Oracle databases, FileNet workflow systems and Powerbuilder or Oracle client software. To standardize electronic documents interchange, they have elected PDF (Portable Document Format). After this shift, one of the new web-based information systems, designed and developed to replace the legacy systems, was the EFS (Electronic Filing System), implemented in the end of 1999. This information system was developed for civil matters, allowing lawyers to file electronic documents and providing real-time information to all involved entities. In 2002 Singapore launched the ICJS (Integrated Criminal Justice System). This project intended to link all entities involved in the criminal justice process, using the country's justice network. With this approach, Singapore justice system gained an integrated system, and reached all the entities involved in court cases. At the same time they fitted the courtrooms with video-conferencing systems, thus enabling citizens to participate on trial sessions from any courthouse, protecting violent crime victims against their perpetrators. But with all these systems, the flow of data grew exponentially and the communication network started to overflow. With this technological constrain, the authorities started a new project to upgrade the communication network infrastructure, creating the BENI (Broadband Enterprise Network Infrastructure) based on ATM (Asynchronous Transfer Mode) technology (Orzessek & Sommer, 1997; TelecomSpace, 2011). BENI was finished in 1999, and held a high speed backbone of 622 Mbps, scalable up to 2.1 Gbps, supported by WAN (Wide Area Network) segments of 45 Mbps each, connecting the different locations where justice entities operated. This upgrade led to the update of the retail communication network infrastructure, with download capacities ranging from 6 to 8 Mbps and a penetration rate of 98%. After a decade, a new project is running, to upgrade the country's network to broadband network at 1 Gbps, adding value to the economy and society (Wever, 2009). In 2002 Singapore authorities estimated that 50% of the court services were already computerized. Nevertheless, it was still possible to address the courthouse using the traditional methods. Both methods (electronic and traditional) coexisted without impairing the efficiency in the courthouse or in the process. To improve the security in these information systems, they implemented a PKI (Public Key Infrastructure) (Singapore Network Services Pte Ltd, 2007), represented in Fig. 3 : With this feature all documents can be ciphered/deciphered and digitally signed, increasing the security of the systems against threats. Electronic documents can be authenticated and their integrity and issuers verified. To manage the PKI, the Supreme Court or the Subordinate Courts nominate a publicly available, commercial entity as the Root CA (Certification Authority) authorized to issue the certificates to law firms, lawyers and court users. 2.1.3 Results and lessons learned Currently, the described systems are in use, and subject to common software updates. Singapore's experience positively reinforced the general notion of gradual introduction of novel systems. They started by addressing a specific problem, with a tight goal oriented approach for handling traffic offenses. With the success of this first system, and considering that it required some core court services available for machine-to-machine communication, they embraced the new goal of managing court cases. Considering that the first computerization approaches were made in the 90's there was the need to shift from a mainframe like approach to web technologies, making system maintenance and access simpler. The new web applications, with support for videoconferencing and other technological advances produced an unanticipated result: network overflow. To overcome this constrain, they upgraded the communication network infrastructure, with benefits for everyone (both public and private services). In terms of the development and support models for the different applications in use, the first approach was based on an internal development team and later on outsourcing. To the best of our knowledge, there is no available information on problems regarding either solution, with budget constrains considered as the main reason for shifting from one approach to the other. 2.2 Brazil 2.2.1 The Justice system prior to ICT attempts Brazil is a federation of states (despite having a national policy for financial and fiscal matters). Each state is responsible for its justice system, taking different interpretations of the law, different procedures and organics. This leads to a high level of fragmentation between states, not only at procedures level, but also at administrative level. At the court level, central courts exist in each state capital, and small claims courts spread around the state. In terms of backlog and congestion rates, according to the Justice National Counsel (Conselho Nacional de Justiça), in 2003 there was a congestion rate of 81.4% in the first degree federal courts, 76.2% in the second degree federal courts and 77.2% in the specialized courts (Conselho Nacional de Justiça, 2013). From 2003 to 2007, the congestion rates kept on shortening (78%, 60.5% and 42.2%, respectively), mostly as a result of a bigger investment in manpower and new courthouses. From 2007 to 2011 (last known report), the congestion rates were kept relatively stable. 2.2.2 ICT evolution Brazil's justice information system passed through several stages of maturation (Andrade & Joia, 2010). Brazil's information system evolution is deeply connected with the Brazilian administrative system. The ICT evolution in Brazilian courts can be divided into three phases: individual initiatives, computerization and virtualization. Individual initiatives are carried by each court member, and relate to the identification and usage of productivity tools (like text processors or spreadsheet editors) that each member best identifies to carry out its functions. With this approach, each court member created his own procedural criteria and taxonomy for each task, which resulted in a higher fragmentation level in work inside of the same court division. To overcome the intrinsic fragmentation resulting from the individual initiatives, several information systems were created to coordinate the administrative work and justice process at state level. Some states bought their information systems, while others developed their own. This plethora of information systems raised data and documents interchange problems. The extreme example was that different versions of the same system, implemented in courts at the same state, were not able to communicate amongst each other. When this problem became a liability, they advanced to a virtualization phase, with the creation of a national virtual system that would be implemented locally, with the rules of the state. This approach tried to create a unifying information system for all states. This system could be customized inside each state, at the court level. Despite of the different maturation levels in the computerization phase between courts (even in the same state), virtualization took the lead. However the results were a disaster, since the degree of customization in the information system led to a steep learning curve of the overall system. The studies made at the time revealed losses of over 50 million US dollars, leading to the abandonment of this model in 2010 (Andrade & Joia, 2010). With this experience, a common strategy for the country was created, with a project until 2014 with the following requisites: • Provide to all courts adequate computer equipment; • Develop an information system that unifies the justice system. This information system must: • Be based in industry standards, preferably using open source technologies; • Be web-based; • Digitalize and automate the process distribution; • Create mechanisms to monitor case related penalties, with special attention to temporary arrests; • Make accessible process procedures, respecting the process privacy. After identifying the major goals and defining the overall strategy, the communications infrastructure was singled out as an important piece to support the new information systems. To cope with the demands of communications, they devised a plan to upgrade the communications infrastructure. In this plan, the connection between the courthouses should be of at least 2 Gbps, and in each state capital the network should link central courts and small claims courts. The network over the state should connect at least 20% of small claims courts. To secure data, Brazil took advantage of a preexisting national PKI (Barra, 2006; Coelho, 2010). This national PKI was created by federal law, in 2001, where the Civil House of the Presidency of the Brazilian Republic transformed the ITI (Instituto Nacional de Tecnologia da Informação/National Information Technology Institute) in the unique Root CA, creating the national PKI, with the infrastructure represented in Fig. 4 . The Steering Committee was created for the regulation of the whole PKI and auditing the Root CA. Federal government and civil society representatives formed this committee. Along with this, the COTEC (Comitê Técnico da Infraestrutura de Chaves Públicas Brasileira/Steering Committee and Executive Technical Commission) was created with representatives from federal government and consultants to this process. ITI was responsible for managing root certificates' life cycles and accreditation, auditing and issuance of subsequent CAs and their certificates. Below the Root CA, each organic unit from the civil states in Brazil was entitled a first level CA with the RA (Registration Authority), with an optional ICA (Intermediate CA) and RA (depending on internal organization), as presented in Fig. 5 . The ICAs and RAs can represent public or private sectors (ITI, 2011). When the e-justice information system needed a PKI in 2004, they choose the national PKI, but the National Bar Association, on behalf of the lawyers, produced a strong opposition against this approach, using technical issues arguments (Martínez & Abat, 2009). The real argument however, was political, since lawyers did not want to use a system subordinated to the executive power. Moreover, the National Bar Association had its own PKI. If they joined the national PKI, that investment would be wasted. In 2006 a federal law modified the Civil Procedure Code, recognizing the national PKI as the single PKI in the justice system. With these changes, the National Bar Association accepted its use and shared the lawyers' information with this executive initiative, apart some lawyers' intent to the impugnation of these law changes. 2.2.3 Results and lessons learned Brazilian Justice Information systems and applications are currently in a transition phase. Due to its intrinsic administrative organization, each Brazilian State was able to decide on how to implement its information system (internal development, copied from other state, or bought from software houses). However, since there were no directives to enforce the use of standards and systems communication, most adopted solutions failed to communicate with others (even on the same administrative State). To overcome this problem, Brazilian authorities started a new project for the development of a national information system. Despite the theoretical benefits that arise with the introduction of information systems, only when this national information system is in place will it be possible to assess its factual benefits. Until now, the congestion rate drop was supported by the increase of judges and clerks. The Brazilian experience reminded us that the correct planning of information interfaces and rules of communication is essential for projects of such magnitude to be successful. In the first attempts, Brazil failed to congregate its States' independence with the requirements of a national information system for the Justice. The new project tries to handle these specificities, by designing a communication standard to be used among all the systems. Another interesting fact on the new project is the identification of the supporting system infrastructures upgrade as a major goal. The telecommunications network will be subject to an upgrade, providing higher bandwidth. The Brazilian authorities expect that this upgrade will provide the incentive needed for the use of information systems as a working tool. As with Singapore, the Brazilian authorities decided to enforce document integrity and validation through the use of a PKI. Even if the PKI architectures in use may be debatable, the benefits of its use were clear for the authorities, given the assurance, by its use, in terms of security. 2.3 Belgium 2.3.1 The Justice system prior to ICT attempts Back in the 90's, the Belgium Justice system was struggling with extreme slowness and sluggishness. Litigation over intellectual property, for example, would take many years to trial, and companies found themselves unable to sell their products until the court's decision. The same thing was happening in criminal matters, like in 1996, where the Dutroux case required 9years to take a pedophile to trial. 2.3.2 ICT evolution In the last decades, the Belgium authorities have tried to introduce some changes and reforms in the Justice, such as the purchase of computer equipment for the courts, and even given a laptop computer to each judge (Velicogna, 2007). Due to the more active role of the civil society, and in the light of the events of the 90's, authorities were forced to rethink their reforms thoroughly. Until the year 2000, authorities made several attempts to computerize the justice process, all unsuccessful. These unsuccessful attempts were mainly due to lack of planning, like local attempts to develop information systems to support some court members, without the perspective of integration in a broader e-justice system. All these attempts resulted in many concurrent applications, resulting in a high level of fragmentation, information islands and rapidly obsolete information systems. An example of this problem was the existence, at a given time, of 13 different applications with more than 100 databases, despite the lack of data or document interexchange between them (Martínez & Abat, 2009). After authorities identified these problems and their causes, they started a restructuring project: the Phenix Project. The Phenix Project was designed to increase the ICT in public administration, increasing the public service and the democratic process (Vuyst & Fairchild, 2006). This e-justice system was designed to cover criminal and civil matters, developing a unifying platform to the entire justice system. This project led to the creation of a flexible framework, created from the common practices of the various agents and re-engineering where IT technicians identified as more convenient. During the developing phase of the information system, three major challenges were identified: 1. The information system had been designed to replace the traditional way to address to the courthouse, i.e., after the implementation, this would be the only way to address the courthouse; 2. The use of electronic documents was already enshrined in law, but the use of an information system to support the whole process was not. Due to the country government peculiarities, the changes are required in the national legislation, so that the information system could be used were identified as one of the main challenges; 3. The change in the justice agents' mindset, since the mode of interaction with the justice system would be changed. Another key point of the system, according to their IT technicians, was its development using open source technologies. After the start of the development, a major issue was detected: in case of a catastrophe, the information recovery procedure was still to be designed and considered as a challenge (Vuyst & Fairchild, 2006). The Phenix system was introduced in small instance courts, trying to standardize procedures, law interpretation, minimizing the occurrence of miscarriages of justice, thereby increasing the efficiency of the justice process and the efficient use of justice resources. Although this system was web-based, the internet network penetration rate in the country was only 50%, thus constituting an obstacle to the implementation of an information system with this nature. The authorities had high hopes in this project, and due to its simple and transparent procedures, they expected that it would make the justice system more accessible to society, leading to a greater understanding of justice decisions. They also expect to change the agents' mindset, moving from the physical paradigm, where everything was in paper—to the digital paradigm, where everything from the laws to consult and procedures to take was computer supported. Despite the efforts between all stakeholders (IT technicians and court members) and the budget afforded to the information system, in 2007 the Ministry of Justice stopped the Phenix Project, leaving to the next government the final decision about its continuation (Martínez & Abat, 2009). The main argument was that the development team could not solve the complex technical problems inherent to such project. 2.3.3 Results and lessons learned Currently, the Phenix project has come to a halt, by ministerial decision. This was indeed an ambitious project, since it was designed to support both criminal and civil matters. From our perspective, and considering the Singapore case study, the complexity and scale of the problems may have been the main reason for its failure. In Singapore, authorities began to address small problems, before moving to the bigger scale issues concerning criminal and civil matters. This way, they managed to accumulate experience and user feedback. A good project management and context adaptability could have avoided some of the encountered problems. 2.4 Portugal 2.4.1 The Justice system prior to ICT attempts Portugal endeavored many efforts along the last three decades to jump in the digital era (Santos, 2005). In the 80's decade, several governmental agents tried to introduce information technology in courthouses, but these efforts had no success (Silva, 2006). In the following decade, this scenario did not change, despite the massive buying of computers and other electronic equipment to courthouses, just as presented in previous case studies. With the increase of the internet penetration ratio, several public and private initiatives had created portals and legal databases, providing information to general public without any type of charges. 2.4.2 ICT evolution The e-mail was the first electronic service used to exchange data amongst agents. Based on this, an internal network was created between the courthouses, linking secretaries and enabling documents to be sent by authenticated e-mail. This experience was essential to support the development of the Habilus information system. Habilus was created with the objective of simplifying the secretaries' administrative work. The main justice documents were standardized, and databases with the processes and their intervenient data were designed to increase efficiency in the court. This information system was criticized by the stakeholders due to the wrong process taxonomy, the lack of elements and the mixing of legal terms. Despite this information system, process backlog became a problem in the Portuguese Justice system. To speed up the procedures, streamline the resources and increase the courts' efficiency, a new integrated information system was developed (Ministério da Justiça, 2003), starting with the administrative and fiscal courts. This information system, named SITAF (Sistema de Informação para os Tribunais Administrativos e Fiscais/Information System for the Administrative and Fiscal Courts), debuted on January 1, 2004. SITAF (Direcção-Geral da Política de Justiça, 2005; Instituto das Tecnologias de Informação na Justiça, 2004) was created to computerize the administrative and fiscal processes, with electronic filing and document delivering. It is a web-based application, with secure access and a distributed architecture as presented in Fig. 6 , available in 19 courthouses. SITAF's main features include: • A workflow engine to manage the process procedures; • Daily automatic process distribution; • Electronic document storage based on standard formats like RTF (Rich Text Format), TIFF (Tagged Image File Format) and PDF; • Multi-access to the process and its documents between agents. SITAF was the first major information system in Portugal developed specifically for the Justice. With this experience, the perspective about e-justice systems changed, and new projects were developed, in several phases (Ministério da Justiça, 2008a,b). Other actions were taken in parallel like renewing the desktop equipment and training the justice agents engaged in electronic proceedings. In 2008 a new application called CITIUS was developed to complement the Habilus. CITIUS was developed specifically to civil process acts but based on the SITAF's philosophy. It supports specifically declarative and executive acts and civil injunctions, and the main users are judges and, since 2009, also prosecutors. CITIUS has electronic filing and electronic delivery of the digital documents used in the processes' acts, but for specific acts it is mandatory the use of the traditional/physical procedure – going to court secretary and deliver the pleading paper – instead of sending the digital document throughout the information system. This small change caused several system complains. The system trials started first in a single courthouse for a period of half of a judicial year: after that period the system became universal. During the trials it was possible to send electronic documents by e-mail. After the universal introduction of the system no more documents could be sent by e-mail, because the digital platform handles and stores the documents more efficiently than the e-mail boxes. In 2009, prosecutors gained access to CITIUS and were obliged to use it (Ministério da Justiça, 2008a,b). Later in 2010, CITIUS information system was upgraded to CITIUS Plus, with some bug fixes and new features (Ministério da Justiça, 2010a,b). The major feature is the new ability to record the court's hearings offline when the system is down or unavailable. In March 2011, the Portuguese government reinforced the strategic plan for the Justice, approving a new plan that involves the replacement of currently existing systems, upgrading users' equipment, improving the network equipment and increasing the available network bandwidth (Presidência do Conselho de Ministros, 2011). SITAF was one of the selected systems to be upgraded (SITAF 2.0) due to the changes that occurred in the Administrative and Fiscal Laws. The old Habilus – due to some of the known issues – will be replaced with a brand new application that is expected to improve the work in criminal cases by prosecutors and administrative staff. The AGIP (Aplicação para a Gestão de Inquéritos-Crime/Application for Criminal Investigations Management) is being implemented and is designed to digitally support all procedures in criminal investigations, decreasing costs, as pointed by Maria José Morgado, Deputy General Prosecutor. She claims that it will be possible to replace the piles of hundreds of papers that usually compose the volumes in criminal procedures, simply by using this information system. The total cost with AGIP is projected to be around 1.4 million euros, but a rapid return of the investment is expected (SIC, 2011). The infrastructure changes were mainly focused on concentrating scattered resources and upgrading the communications network. With the new generation networks installed in Portugal, authorities created the RNCJ (Rede Nacional de Comunicações da Justiça/Justice National Communications Network). To improve process efficiency, a VPN (Virtual Private Network) is planned, ensuring secure communication in remote access to the judges and prosecutors. With the use of such VPN, users not physically in the courthouse can access the same features and functionalities as if they were working on the court, saving costs and time (in transports, at least), while maintaining the same level of integrity and security. With RNCJ improvement, the ITIJ (Instituto das Tecnologias de Informação na Justiça/Justice Information Technology Institute) will change the overall system architecture, moving from a distributed environment – one server for each courthouse, or around 350 servers – to a centralized environment where all the processing activities will be concentrated on the ITIJ DPC (Data Processing Center). This change will improve the overall system security and maintenance. With resource concentration it will be possible to use virtualization technologies and reduce the actual hardware infrastructure from nearly 900 servers in DPC to near 200, with the obvious decreasing of power consuming, space requirements, CO2 emissions, and most importantly, with expected savings of nearly 500,000 euros per year. All these information systems use the Portuguese PKI, created in 2006 by the Presidency of the Council of Ministers (Presidência do Conselho de Ministros, 2006). Fig. 7 outlines the Portuguese PKI. This national PKI has a SCEE (Sistema de Certificação Electrónica do Estado/Steering Committee to the Electronic Certification System of the State), with representatives from the government, the GNS (Gabinete Nacional de Segurança/National Security Office), the National Homeland Security Network, the FCCN (Fundação para a Computação Científica Nacional/Foundation for National Scientific Computing), IT (Instituto das Telecomunicações/Telecommunications Institute), among others. The SCEE has a country level CA, which is available both as a self-signed Root CA and as an ICA, certified by a publicly available, commercial Root CA, the ECEE (Entidade Certificadora Electrónica do Estado/Electronic Certification Entity of the State) that is responsible for managing the PKI, and other ICA's in PKI. The ANS (Autoridade Nacional de Segurança/National Security Authority) was empowered to audit and issue the certificates of accreditation to ICA entities present in the PKI. The SCEE works independently from other private and international PKIs, but guarantees that its certificates are recognized worldwide as valid, since the country level ICA is certified by an international certification authority. Portuguese PKI is conceptually similar to the Brazilian PKI previously presented: the country level CA can have several first level ICAs with the respective RA, and can support more than one CA level depth, as depicted in Fig. 8 . The main difference is that the Brazilian PKI is isolated, with its main CA being in fact available only as a Root CA, meaning that no certificates can be recognized without a proper user administration action of installing a new Root CA public certificate (which may not be possible due to wide level computer domain policies, for example). In the first year that CITIUS was operational (2009) more than 85% of the acts and proceedings were filed electronically, totaling more than 5 million acts and almost 2 million electronic notifications (Ministério da Justiça, 2010a,b). 51% of these processes were initiated using CITIUS (Neves, 2009). With these impressive numbers it should be safe to assume that this is a successful system. The reality shows that this fact is not so clear to all stakeholders. The system has suffered numerous critics and cheers. The strongest opposition came from the ASJP (Associação Sindical dos Juízes Portugueses/Association of Portuguese Judges) (Gabinete de Acompanhamento da Informatização nos Tribunais (GAIT/ASJP), 2009). ASJP issued a survey to which about 13% of its associates answered, and the main conclusions from the survey were as follows: • CITIUS interface is not accessible, i.e., it does not follow the heuristics for accessibility and usability; • The system is slow, and ASJP pointed out the main cause is the old equipment available; • The judges' inability to understand the current digital paradigm used for handling processes in the system hamper their productivity. In absolute contrast with the ASJP's critics, lawyers praised these reforms, pointing that CITIUS (Neves, 2009): • May provide a better service to their constituents; • Decreases costs of the proceedings; • Decreases costs to their constituents, since lawyers do not need to go to court to file or deliver documents, due to the electronic submission; • Increases transparency between all agents. 2.4.3 Results and lessons learned Portuguese Justice Information System's panorama is changing. From the support of e-mail as an official vehicle for case files, to the creation of an information system to manage the law cases, Portuguese authorities are trying to keep up with the times. Currently, CITIUS and SITAF are being upgraded, and a new system is being designed to replace Habilus. The supporting system's infrastructure is also being redesigned, moving from the scattered servers' solution to a centralized solution, accessible using a VPN. The VPN solution is expected to enable the Justice system's users more freedom and possibilities in terms of working location (office, home, traveling, …). As with Singapore, Portugal started with simpler experiences to solve smaller problems (e-mail integration and Habilus) and evolved to systems capable of handling entire cases (SITAF, CITIUS and AGIP). This evolution, accumulated experience and user's critics are seen as the breeding grounds for new features. 3 Comparative analysis between case studies This section presents a comparison between the previously presented information systems. Table 1 summarizes the relevant dates (when available) to the development time, the development team composition and whether the information system is still being in use today. Singapore and Portugal implemented a phased coverage of the different areas of Justice. Both countries started with civil process and moved on to criminal process. In terms of development and sustainability models, there was a mixture of in house, outsourcing and mixed (in-house and outsourcing) development. In Portugal, the chosen approach was the in-house development for the information systems, because the Portuguese state created an institute with the staff having the technical skills required for various tasks (software and communications). Belgium chose the opposite approach, outsourcing the Phenix e-justice information system. In Brazil and Singapore we found a mixed approach but for different reasons. In Brazil, the first approach gave each State the freedom to choose between in-house development or outsource development of the information system. However, considering the results of such freedom (most of the systems cannot communicate and exchange data with each other), the new e-justice information system is being developed in-house. In Singapore until 1996 the e-justice information system was developed in-house, but in most recent developments, the national authorities choose to outsource as a way to promote the country's economic growth. Most of the presented information systems are still being used. The exceptions worth mentioning are the Phenix project and Brazil's scattered systems (an approach that led to a wide variety of information systems), without data interexchange or communication between different information systems, decreasing the efficiency and increasing the costs. Table 2 summarizes the system's access type, architecture and its offline data processing ability. The developing technologies were not taken into consideration because that decision has no reflection on the architectural features. Analyzing the data from Table 2 jointly with the developing time from Table 1, it is clear the paradigm shifts from desktop applications to web applications. This may have occurred both due to the evolution of the communication network, providing faster and more reliable communications, and due to the emergent web-based technologies. This paradigm shift is only observed in countries that started developing e-justice information systems in the earlier 90's, like Singapore or Portugal. In countries that started later, like Belgium or Brazil, the initial decision was immediately the web-based approach. This tendency is aligned with Fabri's findings. In Fabri (2007), the author describes this tendency within the case studies that he analyzed. Focusing in Table 2 on the systems' architecture column it is possible to verify that Portugal's information systems were designed based on different architectures. SITAF, for instance, is a distributed system, deployed with an installation in each administrative and fiscal court. This approach leads to smaller data repositories, but higher data interexchange between repositories. CITIUS information system follows the same approach: a distributed architecture with an installation for each court. This type of architecture leads to a huge amount of scattered servers, since every court will require several servers (at least two, for redundancy) and a huge workload to update all the servers each time a system update is required. On the other hand, this architecture relies on a small need for interconnection among the courts. That means that a court can work normally even if the interconnection fails. The overall computational load on each server is very low. All the recent information systems are centralized. This paradigm shift is once again associated with the factors mentioned in the previous analysis: both due to the evolution of the communication network, providing faster and more reliable communications and due to the hardware virtualization. CITIUS Plus is a centralized system but with the possibility to work offline, providing leverage when the communication network fails. This feature increases the trust that users have in the information system, since they are assured of not losing the inserted data in case of a network failure. 4 On the modeling of e-government systems In the e-government panorama, but still closely related to laws, there are also some relevant initiatives. As an example, Austria developed a workflow management system for law management called eLaw. The base of the eLaw project was to provide access and help stakeholders during the definition or changes in the country's laws. With this system all stakeholders have access to the law under review, to all revisions and to their propositions in appropriate time, without conflicts in the responsibilities level, based on the concept of SoD (Separation of Duties) (Schaad, Spadone, & Weichsel, 2005). The SoD is a role-based access model, and these roles can be provided at a network level or at an operating system level or at the information system level. With this information system, they prevent situations like (1) a single stakeholder completing all the steps necessary to create/change a law; (2) avoiding conflicts of interest, where a stakeholder submits a law review and has simultaneously the power to revoke/accept it; and (3) minimizing the confrontation risk between stakeholders, related with their responsibilities and competencies, avoiding public confrontation. According to Schaad et al. (2005), the main benefits of this system are: 1 Increased visibility and transparency to the society, having more public information about the laws; 2 Decreased errors in law drafts, increasing the efficiency; 3 Decreased corruption, avoiding situations like (1) and (2); Similar to Austria's initiative, Bungeni (Kiswahili word for “inside Parliament”) is an initiative of UNDESA (United Nations Department of Economic and Social Affairs) (UN DESA, 2012) that enables the virtualization of parliament procedures. It shares the same benefits of the eLaw project, and at the time of this paper's writing, it will soon be available for test pilots. Bungeni is an open source Parliamentary and Legislative Information System, “that aims at making Parliaments more open and accessible to citizens” (Bungeni, 2012). Its target are the African and the Latin American National Parliaments, in order to provide a digital solution for drafting, managing, consolidating and publishing legislative and parliament documents. The information system is based on a workflow management system, storing information using formats from open standards in XML and supported by a legal ontology. As Ashok Hariharan presents (Hariharan, 2012), Bungeni is oriented to the user, with a user friendly text processor, although it is web based. Document's semantic meaning is implicit and added without user intervention. This tool can be modified to fit the specific needs of a national parliament. At semantic level Bungeni uses the Akoma Ntoso ontology (Akoma Ntoso, 2012), a “simple technology-neutral electronic representations (in XML format) of parliamentary, legislative and judiciary documents”. The Akoma Ntoso provides the ontology to promote the data interexchange between different providers, with the need to develop different data readers. UNDESA is not the only organization working on legal standards. In fact, the Africa i-Parliaments Action Plan (Africa i-Parliaments, 2012) is member of a broader network, the LegalXML (OASIS, 2008), a working group focused on electronic filing of court documents. Also, since 2002 the LegalXML Group joined the OASIS consortium, which resulted in the OASIS LegalXML Group. The OASIS LegalXML group produces several open standards in some legal fields, like court filing, notary or legislative. 5 The Cape Verde experience SIPP's design started in 2008 and the system was ready to be used by 2011. Following the actual tendencies in the development of e-justice information systems, its architecture is centralized and the system's interface is web based. The information system is composed of two separate applications: the Workflow Service and the Web Application, as depicted in Fig. 9 . The workflow service is responsible for handling all the workflow related tasks, triggering and managing cross-workflow events. The main advantage of separating the business logic in workflows is the possibility of supporting simultaneously different workflows for the same process typology. This is important because when there is a legislative amendment, the new legal proceedings are initiated under the law but the legal proceedings that have not been completed or already filed maintain the procedure in force at the time of its development. One of the features supported by the workflow service is the ability of versioning documents. Document versioning enables users to safely work on their documents online, saving changes and rolling back versions as needed. This feature tries to leverage between this e-justice information system and the traditional way to work with a case file, allowing the user to work on a given document online, just as if he was working on his regular document processing editor. In this case due to necessary care with the contents of the undisclosed document, the document is written and stored centrally in a secure way. With this approach the user has a tool that: (1) supports multiple versions of the same document; (2) does not require local storage, avoiding problems like document/computer theft or hardware failure and allowing the user to handle the document in different places but always maintaining the same safety criteria; and (3) has a secure mechanism that allows only the user to read and write on the working document. SIPP applies a SoD policy, based on application roles. This feature is crucial to information system acceptance by the stakeholders and to increase the trust between users and the e-justice information system. This security enforcement allows the system to recognize the user role and actual permissions within a given case process and provides access to the process information only on the occasions foreseen on the Process Code. Cape Verde being an archipelago, every island has to produce the electricity it needs. Unfortunately, electrical outages are frequent either by technical problems in electrical generation plants, or undersizing of the capacity of power plants, or simply lack of diesel to put the generators into operation. This is a liability to SIPP, because it can produce a service disruption, total or partial (depending on the outage location). Cape Verde has a country wide governmental network that can be used in public facilities like schools, hospitals, courts, etc. The governmental network at the start of SIPP's project is depicted in Fig. 10 . The two main cities are Praia, the capital on the Santiago Island, and Mindelo on S. Vicente Island and the connections among them are primordial. The 3rd most important island is Sal where the local economy is based on tourism. As illustrated, in the most remote islands and areas, this network has a very low connection speed. In the cases where the governmental network is not available or does not meet the desired connection speeds, users may contract private broadband DSL internet services, with download speeds of up to 4 Mbps. In 2011, the Cape Verde authorities started a project to upgrade the governmental network to the latest broadband technology, linking all the islands in the country. To secure data, we adopted the use of a PKI for the SIPP system. This PKI is based on a worldwide renowned Root CA, and the SIPP help desk team manages the issuing and revoking of certificates. Based on this PKI, users can sign final document versions and can encrypt and decrypt SIPP's working versions of documents, providing a bigger sense of security to the overall system. SIPP has been in testing phase since June 2010, and will be put in production during 2012 in a definitive way as soon as the national parliament approves a legislative amendment that allows the processing and completion of legal proceedings electronically. The prototype's initial testing phase began in parallel with training the end users of the system: judges, prosecutors and judicial staff. The training was prepared with two distinct modules: (a) training of general ICT skills, and (b) specific training for each of the users of the system at his place of work and focusing on their specific needs. During the first training phase, the Justice agents received training in general ICT skills, like the use of productive tools, such as text processor or spreadsheet, e-mail, internet and document scanning. These general skills are the basics in using the SIPP information system, because the system is web based, with text processor features. The second phase of training plan was over SIPP. In this phase we use on-job assisted training, as discussed in Teixeira and Pinto (2012) so that the users could better understand how to accomplish several goals based on their courthouse roles. With this approach the users can practice with the new tool, and we can tune the information system, its interface and overall information processing, to better fit the real users' needs. 6 Risk factors Justice systems work based on well-established procedures, carried out by Justice related staff. These activities can be automated, standardized and computerized. E-justice information systems can help and ease the fulfillment of some of these tasks. However, as with all information systems, there are risk factors associated. In a so sensible area, like Justice, where people's future may be decided, the risk factors must be well known and considered. Jaeger and Thompson (2003) present some risk factors in e-government information systems. They present challenges like: 1. providing reliable electricity and telecommunications networks; 2. issues related to language and communication; 3. good coordination between local, regional and national e-government initiatives; 4. the development of methods and performance indicators to assess the quality of e-services provided; 5. ensure the quality and utility of e-services provided; 6. the education of the general population for the benefits of use e-government services; 7. preventing the e-government from lessening responsiveness and responsibility of government officials. Since e-justice information systems are a subset of the e-government information systems, they can be analyzed under the same issues. Kuk's study (Kuk, 2003) concluded that the quality of e-services decreased due to poor or lack of internet access. Slow communication networks present a liability, because e-justice systems need to exchange high amounts of data, as official acts and documents with hundreds or thousands of pages, multimedia archives, like pictures of a crime scene, or live feeds from one court to another during trials, are some examples that can illustrate the added traffic over such network (Jaeger & Thompson, 2003; Kuk, 2003). As exposed in Section 2, governments of countries pointed as a key feature a good communication network. In a country like Singapore, it is easier to upgrade the communication network, because of the country's geography, and since it has one of the biggest GDP in the world. In a bigger country like Brazil, they adopted a strategy to upgrade the communications network between state capitals to 2 Gbps links and to ensure links between central courts and small claims courts in each state. In an archipelago like Cape Verde, the upgrade of the communications infrastructure is more complex than in continental countries. Each island must be considered separately and then it is necessary to plan an adequate inter-island infrastructure. For communicating within each island a type of WiMAX (Worldwide Interoperability for Microwave Access) infrastructure is being designed. Due to the curvature of the earth, it is impossible to establish radio links between the groups of islands in the North (S. Vicente, S. Antão and S. Nicolau) and in the South (Santiago, Maio, Fogo and Brava) nor Northeast (Sal and Boavista), so any update on the infrastructure will have to go through the placement of a set of physical paths between the groups of islands. According to current standards, this connection can be made into fiber optics or via a satellite link. The fiber optic link provides faster and cheaper communications than the satellite link and this is therefore used only as a backup system. Unfortunately the optical fiber path is often cut off by fishing boats nets leaving the communication between the islands dependent on satellite links. Accurate planning of the design, development and maintenance stages of information systems presents a second risk factor, especially when working on a system that is designed to operate on a 24/7 basis. Also, when planning a substitution of legacy systems, or when new systems have to interact with such systems, the design team has to make a good evaluation of what the institution really needs. If the design and development teams do not take into consideration the changes occurred in the lapse of time between the original design and the upgrade, like the changes in the users' needs and the arrival of new technologies better fitted for a given task, this migration process will continue to develop over legacy software, possibly accumulating old mistakes. On the other hand, when dealing with the evolution of legacy systems, special care must be taken to understand and validate not only the previously business model rules, but also the new implementation of such rules. The same principle applies to the system's architecture: the evolution of a given system may or may not require a change in the application's architecture, depending on the users' and applications' needs. In Singapore, they evolved from desktop applications to web-based information systems because the justice system needed an information system with this architecture, with new technology. To mitigate this risk, SIPP has a modular architecture, as shown in Fig. 9. This modularity, with clear distinction of presentation layer, business layer and process handling workflow layer, enables each layer to evolve accordingly to its needs. Given the constant evolution of the law, the workflows that regulate each process type may need to be changed. When such changes occur, depending of the type of change, there may be the need to simultaneously support the old process procedure regulations (for active processes) and the new process procedure regulations (for newly created processes). In other cases, the changes must be implemented in all the active workflow processes. The independence of the workflow layer enables us to make the necessary changes without affecting the other layers. During SIPP's development, there was a major change in the Criminal Code. One of the changes was a different way of calculating the proceedings costs of a given process. In terms of design and development, this meant that there were several active rules or workflows for calculating costs, depending on parameters such as the filing date of the process. The continuous development of new information systems poses another risk factor. If not properly conducted, it can create information systems islands and system fragmentation, with no data interexchange, which is vital in the Justice area. This situation occurred in Brazil, where they developed a national information system, but allowed the existence of custom information systems at the court level. Still on the new information systems development subject, it is necessary to account for the interoperability within the country's e-government systems. Systems may require access to citizen's information, such as personal data, fiscal data or criminal record. This information must not be concentrated in one huge information system, but in smaller, dedicated information systems, with interfaces for authorized systems to query information. When systems are not capable of exchanging information with others, data and development efforts are doubled, making this a huge implementation risk, as stated by Fabri (2007). There is also a risk that derives directly from enabling information exchange among systems: data confidentiality. With all our data available for query by other systems, what are the guarantees offered to the citizens, in terms of data protection? To minimize the exposure to such risk, and in the event of database attacks, we decided that it would be best to make data anonymous, by using local identifiers as a mere reference to the original information. This way, whenever we require the original citizen's information, our system will use the local identifier to request it to its original system holder. Since the identifiers (local and remote) differ, the attacker's will not have a direct, ease to link path among databases. This data protection mechanism increments the bandwidth consumption, but guarantees up to date information concerning the citizen. In terms of system development and project leadership, conflicts among stakeholders may arise due to: • the lack of knowledge on organized development efforts that try to answer the problems for different stakeholders, misleading a group of stakeholders to embrace an unnecessary second development effortor • the lack of perspectives on the development of an information system for all stakeholders, a group of stakeholders embrace an independent development of an information system to help solving their problems. This situation happened in Portugal, where the ASJP tried to impose an information system to the courts – Tribunal XXI (Abrantes, 2005; Microsoft, 2005), without discussing the project with authorities and other stakeholders involved in the Justice. At the same time that the ASJP announced the Tribunal XXI, national authorities were planning and designing CITIUS that was soon released. CITIUS had a broader range in features and addressed more stakeholders, so ASJP's project was dropped. The abandoning of the ASJP project generated a considerable amount of users strongly against CITIUS, mainly from within members of that association. Despite the inclusion of the end users' representatives in the production process being considered as a positive approach, if their influence in the process is overwhelming, then that is not so positive. This was reported by Langbroek and Tjaden (2009), concerning a Dutch project failure. The Dutchmen tried to develop a separated workflow management system for the appeals from the first instance court to the appeal courts, but it was called a failure in 2001 and had a cost of 13 million euros. The very same case is referred by Fabri (2007), where he points the lack of communication among the stakeholders as a possible reason for project failure in development or implementation phases. Given such experience, and considering the overall benefits of having experienced stakeholders on the design team, the SIPP's design team included representatives of judges, prosecutors and secretary staff, among others. With these members in the design team, the development team had more input and feedback from the users, and was able to develop and tune a prototype more accurate and closer to the users' perspectives. This prototype was then used in the meetings between the members of the design team, as a follow up and demonstration of the concepts already specified. This approach favored the discussion between peers with different visions about the necessary steps and data to fulfill a given task using the prototype. Using the stakeholder's visions on how to fulfill such task, the software architects were able to propose working approaches and operation steps with which all stakeholders would feel comfortable. Besides the practical advantages of such heterogeneous design team, the involvement of these stakeholders since the beginning enables them to see their ideas being implemented. This produces, more than a responsibility for what is implemented, an ownership (almost paternity like) feeling towards the system: With such feeling, the involved stakeholders would be excited and compelled to spread the word to their colleagues and defend the system's benefits from potential critics. This evangelism tends to provide better acceptance results than the mere imposition by ranks or by foreign agents. In SIPP, one of the follow-throughs of this feeling is the writing, by secretary members of the specialist group, of an annotated version of the Code of Process Cost. These members have been of invaluable help to accurately calculate all the different cost variations around the proceedings costs. With this task, they were even able to find inaccuracies on traditional calculation boards. Given their experience and insurance by SIPP's calculation engine, they have embraced the challenge of producing a book about the calculation of a process costs, according to the new Code. This annotated Code of Process Cost will explain the new rules and use SIPP's calculation engine and user interface to provide graphical examples. Similar challenges have been launched to the judges and prosecutors members of the specialists group. From the user's point of view, the applications should adapt to the users and not the other way around. Poorly assembled UIs (User Interfaces) that do not follow accessibility and usability heuristics can be a nightmare to work with. The way data are organized and displayed is also an important factor. If the digital metaphor for process and document navigation is confused with mixed legal terms and wrong taxonomy, users can waste time, decreasing efficiency and productivity. These issues combined with traditional backlog problems can drag even more the process procedures. In our experience, and based on the previous issue, SIPP's prototype covers this risk. During the design meetings, the different inputs from the stakeholders allowed to tune the UI. This methodology ensured a better user experience to handle the different tasks involved in the system. The testing phase consolidated the prototype, and the number of potentials issues with SIPP decreased with the increase of the tests' feedback. Interface and information presentation considerations may be extended to the printed versions of electronically submitted data. In this case, this information may be presented in a standardized way, regardless of its point of origin. In an effort to standardize documents in SIPP, the specialists participating in the design meetings proposed new document layouts and information templates to be used in the system. These layouts and templates were implemented, presented to the test users and refined to better suite everyone's perception of the information necessary within each document type. One of the most disruptive layouts presented was in fact the most applauded: the process cover. Traditionally, for each process phase the process would “gain” a need cover, that would be placed on top of the others. With a digital process, there is no need to replace covers. The new printed cover will contain the new information. On top of the traditional information already existing on paper, we added a new concept to the cover: a general process activity overview, with indication of dates and actions carried out. This way anyone holding a physical copy of a process within SIPP can have a general idea of what has been going on in the process, without having to open it. As referred, these information systems must work 24h per day, 7days per week. Thus, the infrastructure must be flexible, redundant and capable of recovery in case of disaster. Plans to recover in case of disaster must be taken, especially if there is the need to invest on building datacenters or buying more equipment for them. These decisions should consider the datacenter's nature and its goals. Questions about the location, the surrounding geography or geology and the likelihood of natural disasters should be analyzed carefully and fairly evaluated, since the data in these datacenters is vital. Another important decision is the amount of data that managers are aware that may be lost in the event of a disaster that might occur between backup operations. The answer to these questions should help on planning backup and restore solutions. In the Belgium case study, one reason pointed by the technical team as a major challenge was the catastrophic recovery scenario, and maybe for that unsolved reason the government stopped the project. Good practice manuals refer that a secondary server, geographically distant from the main site, should be implemented to handle catastrophic situations where the main site is unavailable. Regular backups should also be transferred for this site. The computing resources on the secondary site may be more modest than the primary site. This site should activate itself, using the latest backups available, upon detecting the failure on the primary site. For SIPP we have implemented a secondary site on a different island. Regular database backups are transferred for the site. Not only the communication network is a concern, but also the electrical network is important. These infrastructure networks need to be consistent and reliable. Electrical power is something that western citizens take almost for granted. However, in African developing countries, on islands with no rivers to build hydroelectric dams on and with wind and solar generators still scarce, the population is almost entirely supplied by diesel run public powerhouses. In Cape Verde, it is common to be without any electrical power for more than 24h. In this case, the preventive measure was to ensure that the datacenter would have a backup generator, capable of running uninterruptedly for long periods. However, this measure covers only the datacenter. If a courthouse is without electricity, it will be unable to access SIPP. To solve this issue, the Cape Verde authorities have a project sponsored by the World Bank to upgrade the national electrical network, reducing the waste of energy and water, and reducing the oil dependency (Radiotelevisão Caboverdiana, 2012). Data handling is a big issue on e-justice systems. As exposed in the case studies, all countries have concerns with their system's data security, integrity and confidentiality. These concerns target not only the datacenter and network security, by using firewalls, VPNs, and controlling the physical and virtual accesses, but they also target data and documents integrity. To ensure the user's identity, most case studies rely on a PKI. By using a PKI, data and documents can be digitally signed and verified, ensuring non-repudiation, integrity and authentication. This is vital because these data and documents have legal validity, and these decisions have impact on society. In this paper we analyzed two different PKI approaches. Singapore relies on a commercial PKI to issue certificate valid for the justice system, and Portugal and Brazil use the existent national PKI. The second approach has more risks, with protestors arguing that such PKI is a government initiative, and that in democracy the Justice and Government are separated. This conflict arose in Brazil, where the National Bar Association tried to stop the use of the national PKI. When using a PKI, documents and data can be ciphered/deciphered, increasing security. In Belgium they did not use this approach. In fact, they did not use any approach and pointed this as a problem to be solved. The lack of solution for such problem poses a huge security risk, which, along with the remaining threats found, put the Phenix's development to a halt. As with Singapore, SIPP relies on a commercial PKI to issue its certificates. In the Justice system, Justice agents have different duties, and each duty has different requirements and needs. For example, a judge makes decisions and a court officer executes them. Based on that, e-justice systems have risks related to the execution of duties or actions and related to the permission of performing a task, or accessing a certain feature. To increase the trust in e-justice systems, these usually implement a SoD that works properly and ensures that the tasks and features available to the user at a given time are just the ones that he may execute. Similar to the Austrian eLaw system, SIPP implements a SoD based on application roles, separating the different duties related to the same process procedure type, and regulating the access to the different features when handling a process. The SoD concept is applied independently on the interface layer and on the data layer, with the user's identification being required when accessing the data layer. This way, the internal logical services can crosscheck if the given user is in fact entitled to perform the desired operation. The introduction of IT in the justice system must also be considered as a risk factor. The simple usage of an information system to support regular operations must be legislated. These law changes are vital for the daily use of e-justice information systems, since the decisions made using them will have the same legal value of the paper based decisions. All of the case studies presented changed their laws to support the use of an information system to process procedures electronically. Currently, Cape Verdean authorities are preparing the necessary changes to the Law to introduce SIPP as a legally valid system to handle case files. As with any fairly complex information systems development, for developing an e-justice system it is crucial to have a good and solid multidisciplinary team. Given its specificities, more than an overall picture of the system, the IT design team must have the ability to integrate and understand the inherent justice concepts. To better support the system's design, this team must integrate the representatives of as much justice stakeholders as possible, in an effort to cover the different points of view of what the system should/will be. It is important to have the fragmented vision from judges, prosecutors, lawyers and court officers, because they will use the system on a daily basis. Having these stakeholders in the developing team can help to understand each stakeholder's individual needs and to clarify the borderline interactions, avoiding future misunderstandings. The type of the development (in-house or outsourced) can influence the information system's maintainability. This is a risk factor to consider, since it influences the long term support of any information system (from regular maintenance operations to the development of new features or bug corrections). In Portugal the several information systems were developed in-house, with the maintainability and the long term support ensured by the hired teams. In Singapore there was a shift from in-house development to outsourcing, with the outsourcing company resulting from a spin-off from the in-house development, so the information system knowledge necessary to support and maintain the system was therefore ensured. The SIPP's project managers' initial idea was to follow the Singapore's development model, where a spin-off holding the knowledge of the development of the system would be created to support it. However, unlike Singapore, the initial development team was composed of two universities, Cape Verde University and Aveiro University. The reason to include two universities was twofold: the SIPP's development and the national knowledge capacity of the Cape Verde University. The Cape Verde University was at the time on its year one, and was struggling to find people with technical and academic background capable of teaching new classes. This struggle had impact on satellite projects where the Cape Verde University should be involved, such as the SIPP's development, because it was unable to hire additional staff to be exclusively dedicated to this project. Given this reality, the responsibility over the project's development lied solely on the University of Aveiro. This change had impact on the initial expectations regarding the system's support: the spin-off should result from local knowledge acquired during the development of the system; and at this point, such knowledge can only be found within the University of Aveiro, in Portugal. Considering that the development is being made by a university, whose goal is to teach and research (and not to provide support) and that the creation of a spin-off to provide support overseas may not be feasible, the long term support to the system is still not guaranteed. This is an open issue that needs to be addressed by the system's managers as soon as possible. Another associated risk factor is the IT skills from justice agents. These skills can be classified in two different aspects: (1) general ICT skills and (2) specific e-justice information system skills. A user lacks general ICT skills when he struggles on tasks like working with productivity tools, such as a text processor or spreadsheet, understanding how to use an e-mail client or on how to take advantage of search engines and internet websites. The specific information system skills relate to the understanding of the digital metaphor used to mimic the traditional process handling and to the grasp of the system's features. To avoid and minimize this risk, measures may be taken to help users to better use the system. This may be accomplished with end user training. Considering the end-user training methods review made by Gupta and Bostrom (2006), the planning of a training session must have in mind the targeted system or software. Given the requirements in general ICT knowledge and in system specific knowledge, training efforts should be divided in two distinct areas: a training plan to provide general ICT skills and a second training plan on the use of the information system. These plans should be incremental, and the success of the user's training measured in terms of learning outcomes. Depending on such outcomes, users may start the second training phase, or repeat (entirely or partially) the first training phase. The second training phase in SIPP involved the understanding of the visual representation of processes' information and how to accomplish the required tasks. This phase is an ongoing process that tries to closely follow the development of the prototype system and enables us, as developers, to take action and rapidly adapt the interfaces upon user's feedback. With the use of digital technologies, is easier to ignore parts of an e-mail or other digital document, not intentionally, but inadvertently (Jaeger & Thompson, 2003). This risk can compromise the public service provided to the society by the Justice, simply because the Justice agent is less responsive to citizens. Considering that in the digital world user's desks are not clogged with stacks of paper, it may be easy to miss important tasks. To minimize this liability, SIPP's interface presents at all times the tasks under the user's responsibility. Tasks are presented with a color code to better visualize its urgency. Another risk related to information system's usage is relying in the information system, avoiding taking responsibilities related to their duties. Information systems are a tool to help with the work, to accomplish their tasks, but they do not replace the human intervention. Therefore, users involved with the information system must be aware and educated to change their mindset to the digital world, where the physical presence (of both people and case files) component is suppressed, so that the service quality may be the same (and preferably better) as if they were physically present. Last but not least, the society needs to be aware of the benefits (Jaeger & Thompson, 2003) of the e-government initiative in general, and of the e-justice in particular. If these information systems have good quality, with features that are really needed, and with clear benefits in efficiency, citizens are impelled to take advantage of e-government information systems. This leads to a decrease in corruption, increasing the transparency between governments and society, creating more stable governance conditions. The people of Cape Verde spread over 9 islands (domestically) and have an estimated overseas community bigger than the Cape Verde inhabitants. This high level of community spread forced authorities to embrace technology enabled solutions that could reduce the distance between government service providers and citizens, making Cape Verde the 21st country (out of 53) in the 2008 African e-Government ranking produced by Rorissa and Demissie (2010). The United Nations' 2008 report (United Nations, 2008) places Cape Verde as the leader of the E-Government Readiness for West Africa, which translates to the 6th place on the top ranked countries in Africa and to the 104th place of the overall E-Government Readiness Index 2008, indexed at 0.4158. More recently, the United Nations E-Government Survey 2010 (United Nations, 2010) places Cape Verde in the 6th position of the top ranked countries in Africa, making the 108th place of the World E-Government Development Ranking 2010, indexed at 0.4054. In the same report, Cape Verde ranks 92nd (of 189) on the Online Service Index and ranks 68th (of 157) on the e-participation index. In the United Nations e-Government Survey 2012 (United Nations, 2012), Cape Verde kept both the 1st position on the e-government development in Western Africa and the 6th place on the top ranked countries in Africa, with the 118th position in the World E-Government Development Ranking 2012, indexed at 0.4297. In the same report, Cape Verde ranks 89th in the Online Service Index and 23rd on the e-participation index. Cape Verde's evolution in terms of overall index (from 0.4158 to 0.4297) and of specific e-participation index (from 68th to 23rd) shows that the population, despite all the difficulties, is eager to take part and to take full advantage of the benefits of e-government initiative. 7 Conclusion and future work This paper presented several approaches to worldwide experiences in the design, development and implementation of e-justice information systems. Upon evaluation of the case studies' outcome and what was crucial for such outcome, we presented SIPP, the e-justice system designed and implemented for the Cape Verde Justice. Based on those experiences, we enumerated a set of risk factors associated with the development and implementation of such systems. Despite the experiences being worldwide, in different countries with different contexts, we demonstrated that they share the same risks factors. One of the major risk factors is the initial design phase and the continuous development scrutiny. If the initial architecture is poorly planned due to misinterpretations of the requirements, the entire project may be at risk. Continuous scrutiny and presentation of working prototypes to the stakeholders will enable rapid corrections of any misinterpretations. Also, these prototypes give stakeholders and future users a preview of the overall system. With such preview, initial user expectations can be better understood and, if required, the development and design teams can make rapid behavior and user interface changes to better align with the users' point of view. From the presented case studies, one of the least consistent parameters evaluated is the development team type: in-house or outsource. This lack of consistency is probably related with the country's philosophy and historical background on similar initiatives. More than the development model, the subsequent maintenance model adopted may also be of significant impact in terms of support and development of new features. As illustrated by the case studies presented, both models may succeed or fail, depending on factors as the overall information vision, leadership and technical skills. SIPP's maintenance model is still to be determined, since application maintenance support is not within the university's goals. In e-justice systems, the knowledge gap between the design team and the users may impair the entire system. To handle such liability, the work performed by the design and development teams should be followed closely by a party of the different types of users that will use the system. During the development of SIPP, the design team performed extensive meetings with a group of specialists of the different areas: judges, prosecutors and secretary staff. To better interface with the design team, the development team and this specialist group, we included a specialist with legal background from University of Aveiro, that would act as a “translator” for complex legal questions (for the IT teams) and also as a “translator” for some information system related aspects (for the specialist group). The introduction of information systems as a tool to help in an organization structure changes the organization itself. People in the organization have to be aware of these changes. To avoid shocks related to the use of new information systems, people should take part in training sessions. The training sessions should cover two aspects: general ICT skills and specific information system skills. When the users' skills concerning general ICT reaches a given goal level, users may advance for the next phase (Teixeira & Pinto, 2012). Specific information system training must provide users skills on how to accomplish their day-to-day tasks using the system. Considering that systems evolve and users tend to forget some of the previously learnt abilities, the training plans should be refreshed when needed. To what concerns the network infrastructure, all case studies pointed as a key feature a good and reliable communication infrastructure. The increase of volume of data interexchange mandates a reliable network infrastructure, mainly due to features such as video conference and to the spread and mandatory use of e-justice information systems. In Cape Verde they are upgrading the governmental network to the latest technology in broadband network, covering almost all islands. With this investment, all islands may use the e-justice information system without the need of using commercial DSL connections, thus helping on lowering the operational costs of the justice system. After the design, development and implementation of SIPP, we started the design and development of the continuation of Cape Verde's e-justice information system. This new iteration will enable the digital handing of civil matters, based on the Civil Process Code, and relying on the framework developed for SIPP. References Abrantes, 2005, December 20 M. Abrantes Câmara Corporativa: “Tribunal XXI” Retrieved May 8, 2012 from 2005, December 20 Africa i-Parliaments, 2012 Africa i-Parliaments Africa i-Parliaments – Site. (Africa i-Parliaments) Retrieved April 14, 2012 from 2012 Akoma Ntoso, 2012 Akoma Ntoso Akoma Ntoso - Site. (Akoma Ntoso) Retrieved April 14, 2012, from 2012 Andrade and Joia, 2010 A. Andrade L. Joia Organizational structure and ICT strategies in the Brazilian Justice Proceedings of the 4th International Conference on Theory and Practice of Electronic Governance ICEGOV '10. Pequim 2010 Barra, 2006 M.C. Barra Infra-estrutura de Chaves Públicas Brasileira (ICP-Brasil) e a Formação do Estado Electrônico Infra-estrutura de Chaves Públicas Brasileira (ICP-Brasil) e a Formação do Estado Electrônico 261 2006 Universidade de Brasília, Instituto de Ciências Sociais, Departamento de Sociologia Brasília, Brasil Bungeni, 2012 Bungeni Bungeni – Site. (Bungeni) Retrieved April 14, 2012 from 2012 Coelho, 2010, November 1 - 4 M.A. Coelho ICP-Brasil – The Brazilian PKI Sixth Symposium and Exhibition on ICAO MRTDs, Biometrics and Security Standards 2010, November 1 - 4 International Civil Aviation Organization Montréal, Canada Conselho Nacional de Justiça, 2013 Conselho Nacional de Justiça \"Portal CNJ - Relatórios,\" Retrieved 16 January 2013, from 2013 Conselho Superior da Magistratura Judicial, 2010 Conselho Superior da Magistratura Judicial Relatório sobre a situação da Justiça 2010 Conselho Superior da Magistratura Judicial Praia, Cabo Verde Direcção-Geral da Política de Justiça, 2005 Direcção-Geral da Política de Justiça Breve Guia Prático do SITAF Reforma do Contencioso Administrativo 2005 Direcção-Geral da Política de Justiça Lisboa, Portugal (Retrieved November 21, 2011, from Economist Intelligence Unit, 2011 Economist Intelligence Unit Democracy index 2011 2011 Economist Intelligence Unit London Fabri, 2007 M. Fabri Comparing the use of information and communication technologies in European Public Prosecution Offices Information and communication technology for the public prosecutor's office 2007 Clueb s.c.a.r.l. Bologna 1 28 ISBN: 978-88-491-3037-9 Gabinete de Acompanhamento da Informatização nos Tribunais (GAIT/ASJP), 2009 Gabinete de Acompanhamento da Informatização nos Tribunais (GAIT/ASJP) Primeiros Seis Meses de Utilização do CITIUS - Inquérito de Avaliação à Funcionalidade e Eficiência - Relatório Preliminar Associação Sindical dos Juízes Portugueses 2009 Associação Sindical dos Juízes Portugueses Lisboa Gupta and Bostrom, 2006 S. Gupta R.P. Bostrom End-user training methods. Proceedings of the 2006 ACM SIGMIS CPR conference on computer personnel research Forty four years of computer personnel research: achievements, challenges & the future - SIGMIS CPR ’06 2006 ACM Press New York, New York, USA 172 Hariharan, 2012 A. Hariharan Legislative XML creation with Bungeni editor Achieving Greater Transparency in Legislatures through the Use of Open Document Standards 2012 (Washington D. C. Retrieved from Instituto das Tecnologias de Informação na Justiça, 2004 Instituto das Tecnologias de Informação na Justiça Sistema de Informação dos Tribunais Administrativos e Fiscais - SITAF. Lisboa: Instituto de Informática - Ministério das Finanças Retrieved November 21, 2011, from Prémio Fernandes Costa - Edição de 2004 - Instituto de Informática 2004 Instituto Nacional de Estatística de Cabo Verde, 2011 Instituto Nacional de Estatística de Cabo Verde Apresentação dos Resultado Definitivos do Recenseamento Geral da População e Habitação - RGPH 2010 2011 INECV Praia, Cabo Verde ITI, 2011, Novembro 17 ITI EstruturaIcp<Certificacao<TWiki Retrieved November 19, 2011, from 2011, November 17 Jaeger and Thompson, 2003 P.T. Jaeger K.M. Thompson E-government around the world: lessons, challenges, and future directions Government Information Quarterly 20 2003 389 394 Kuk, 2003 G. Kuk the digital divide and the quality of electronic service delivery in local government in the United Kingdom Government Information Quarterly 2003 353 363 Langbroek and Tjaden, 2009 P.M. Langbroek M.I. Tjaden Organising data exchange in the Dutch criminal justice chain Transylvanian Review of Administrative Sciences 28 Special Issue 2009 8 26 Magnus, 1999 R. Magnus e-Justice: The Singapore Story 1999 National Center for State Courts Singapore Martínez and Abat, 2009 A.C. Martínez P.F. Abat E-Justice: Information and Communication Technologies in the Court System 2009 IGI Global Hershey, Pennsylvania, United States of America Microsoft, 2005, November 23 Microsoft Microsoft Imprensa|Comunicados. (Microsoft) Retrieved May 9, 2012 from 2005, November 23 Ministério da Justiça, 2003, Dezembro 30 Ministério da Justiça Diário da República - I Série B, Portaria n.º 1417/2003 de 30 de Dezembro de 2003 2003, Dezembro 30 Imprensa Nacional - Casa da Moeda Lisboa, Portugal Ministério da Justiça, 2008a Ministério da Justiça Diário da República, 1.ª série - N.º 118, Portaria n.º 457/2008 de 20 de Junho de 2008 2008 Imprensa Nacional - Casa da Moeda Lisboa Ministério da Justiça, 2008b Ministério da Justiça Diário da República, 1.ª série- N.º 26, Portaria n.º 114/2008 de 6 de Fevereiro de 2008 2008 Imprensa Nacional - Casa da Moeda Lisboa Ministério da Justiça, 2010a Ministério da Justiça Diário da República, 1.ª série - N.º 131, Portaria n.º 471/2010 de 8 de Julho de 2010 2010 Imprensa Nacional - Casa da Moeda Lisboa Ministério da Justiça, 2010b Ministério da Justiça Diário da República, 1.ª série - N.º 68, Portaria n.º 195-A/2010 de 8 de Abril de 2010 2010 Imprensa Nacional - Casa da Moeda Lisboa Neves, 2009 C. Neves O CITIUS: legalmente opcional, mas praticamente indispensável Boletim da Ordem dos Advogados 60/61 2009 54 56 OASIS, 2008 OASIS Legal XML (OASIS) Retrieved November 2011, 23, from 2008 OECD, 2003 OECD The e-Government Imperative 2003 OECD Publications Service Paris, France 10.1787/19901054 Orzessek and Sommer, 1997 M. Orzessek P. Sommer ATM & MPEG-2: Integrating Digital Video Into Broadband Networks 1 ed. 1997 Prentice Hall Upper Saddle River, New Jersey, Estados Unidos da América Presidência do Conselho de Ministros, 2006 Presidência do Conselho de Ministros Diário da República - I Série-A, Decreto-Lei n.º 116-A/2006 de 16 de Junho de 2006 2006 Imprensa Nacional - Casa da Moeda Lisboa Presidência do Conselho de Ministros, 2011 Presidência do Conselho de Ministros Diário da República, 1.ª série - N.º 45 - 4 de Março de 2011 2011 Imprensa Nacional - Casa da Moeda Lisboa Radiotelevisão Caboverdiana, 2012, February 4 Radiotelevisão Caboverdiana Banco Mundial empresta 40 milhões de euros a Cabo Verde para reforma do sector da energia Retrieved April 23, 2012, from 2012, February 4 Rorissa and Demissie, 2010 A. Rorissa D. Demissie An analysis of African e-Government service websites Government Information Quarterly 27 2 2010 161 169 Santos, 2005 B.S. Santos Os tribunais e as novas tecnologias de comunicação e de informação Sociologias 7 13 2005 82 109 10.1590/S1517-45222005000100004 Schaad et al., 2005 A. Schaad P. Spadone H. Weichsel A case study of separation of duty properties in the context of the Austrian “eLaw” process 2005 SIC, 2011 SIC Jornal da Noite Edição 13-12-2011 (1ª parte) 2011 SIC Lisboa (Retrieved from Silva, 2006, Maio 4 M. Silva A Informática nos Tribunais Retrieved November 2008, 3, from 2006, Maio 4 Singapore Network Services Pte Ltd, 2007, Junho 15 Singapore Network Services Pte Ltd Break through with CrimsonLogic - it makes better sense Retrieved October 26, 2011, from 2007, Junho 15 Subordinate Courts, (n.d.) Subordinate Courts. (n.d.). Years In Review. Retrieved Outubro 18, 2011, from Teixeira and Pinto, 2012 C. Teixeira J.S. Pinto Assisted on job training S. Kofuji E-Learning/Book 4 2012 InTech TelecomSpace, 2011 TelecomSpace Asynchronous Transfer Mode|TelecomSpace. (TelecomSpace) 2011 (Retrieved Outubro 19, 2011) UN DESA, 2012 UN DESA UN DESA|United Nations Department of Economic and Social Affairs (UN DESA) Retrieved April 14, 2012, from 2012 United Nations, 2008 United Nations E-Government Survey 2008 2008 United Nations New York United Nations, 2010 United Nations E-Government Survey 2010 2010 United Nations New York United Nations, 2012 United Nations E-Government Survey 2012 2012 United Nations New York Velicogna, 2007 M. Velicogna Justice systems and ICT. What can be learned from Europe? Utrecht Law Review 3 1 2007, June 129 147 Velicogna et al., 2011 M. Velicogna A. Errera S. Derlange e-Justice in France: the e-Barreau experience Utrecht Law Review 7 1 2011, January 163 187 Vuyst and Fairchild, 2006 B. Vuyst A. Fairchild The Phenix project: a case study of e-justice in Belgium ICEC '06 Proceedings of the 8th international conference on Electronic commerce. Fredericton, New Brunswick 2006 Wever, 2009 W. Wever E-justice perspectives at the GCC 15th GCC e-Government and e-Services Forum. Dubai 2009 João Rosa, MSc student in Masters in Information Systems. Research interests: System modeling and architecture, workflow based systems, semantic web and e-government. Cláudio Teixeira, Assistant researcher, PhD in Computer Science (2009); 5 year Degree in Telematics and Computers Engineering (2003). Research interests: Integration of information systems, value added services, system modeling and architecture, XML based information systems, dynamically configured web portals, cloud computing and e-government. Joaquim Sousa Pinto, Assistant Professor, PhD in Electronics Engineering (1997); 5 year Degree in Electronics and Telecommunications Engineering (1985). Research interests: Digital Libraries, Information Systems, Cloud Computing. "
    },
    {
        "doc_title": "Cloud computing enhanced service development architecture for the living usability lab",
        "doc_scopus_id": "84898310737",
        "doc_doi": "10.4018/978-1-4666-3667-5.ch003",
        "doc_eid": "2-s2.0-84898310737",
        "doc_date": "2013-03-31",
        "doc_type": "Book Chapter",
        "doc_areas": [
            {
                "area_name": "Medicine (all)",
                "area_abbreviation": "MEDI",
                "area_code": "2700"
            },
            {
                "area_name": "Health Professions (all)",
                "area_abbreviation": "HEAL",
                "area_code": "3600"
            }
        ],
        "doc_keywords": [
            "Ambient assisted living (AAL)",
            "Innovative services",
            "Life expectancies",
            "Living laboratories",
            "Local processing",
            "Multiple data streams",
            "Service development",
            "Storage resources"
        ],
        "doc_abstract": "© 2013, IGI Global.As life expectancy increases, so does the number of Ambient Assisted Living (AAL) initiatives. The Living Usability Lab is a user-centered living laboratory aimed at open-innovation and evaluation of new approaches to AAL applications and services, where the different stakeholders may develop and evaluate innovative services for the elderly in near-real life conditions. These AAL initiatives often traverse several research fields, from embedded devices to multiple data streams analysis. Advanced processing, reasoning, and storage of such data streams poses a complex problem usually solved using local processing and storage resources. This chapter presents an overview of the LUL initiative, its services, and applications, and explores the problem of advanced processing, reasoning, and storage from a cloud computing perspective.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Health@Home scenario: Creating a new support system for home telerehabilitation",
        "doc_scopus_id": "84861978367",
        "doc_doi": null,
        "doc_eid": "2-s2.0-84861978367",
        "doc_date": "2012-06-13",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Biomedical Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2204"
            }
        ],
        "doc_keywords": [
            "Ambient assisted living",
            "Conceptual architecture",
            "Early evaluation",
            "Elderly people",
            "Innovative method",
            "Multi-modality",
            "Support systems",
            "Telerehabilitation",
            "User-centric",
            "Video surveillance"
        ],
        "doc_abstract": "The creation of innovative methods and technologies for elderly is the main purpose for Ambient Assisted Living. This paper provides a description on all the associated stages and development questions required for the establishment of a new telerehabilitation service. The service intends to provide elderly people with the possibility of performing rehabilitation sessions in their houses, with constant medical supervision via video surveillance. Following the principles of a new conceptual architecture for services, and developed according to user-centric paradigms such as multimodality and high usability criteria, early evaluation results point the service as an asset for remote rehabilitation.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Cloud computing enhanced service development architecture for the living usability lab",
        "doc_scopus_id": "80054071972",
        "doc_doi": "10.1007/978-3-642-24352-3_31",
        "doc_eid": "2-s2.0-80054071972",
        "doc_date": "2011-10-19",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            },
            {
                "area_name": "Mathematics (all)",
                "area_abbreviation": "MATH",
                "area_code": "2600"
            }
        ],
        "doc_keywords": [
            "Ambient assisted living",
            "Complex problems",
            "Data stream",
            "Life expectancies",
            "Living lab",
            "Local processing",
            "Multiple data streams",
            "Research fields",
            "Service development",
            "Telerehabilitation"
        ],
        "doc_abstract": "As life expectancy increases, so does the number of ambient assisted living (AAL) initiatives. These IT initiatives often traverse several research fields; from embed devices to multiple data streams analysis. Advanced processing and reasoning of such data streams poses a complex problem usually solved using local processing resources. This paper addresses this problem from a cloud computing perspective. © 2011 Springer-Verlag.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Cloud computing: A platform of services for services",
        "doc_scopus_id": "80054055305",
        "doc_doi": "10.1007/978-3-642-24355-4_10",
        "doc_eid": "2-s2.0-80054055305",
        "doc_date": "2011-10-19",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            },
            {
                "area_name": "Mathematics (all)",
                "area_abbreviation": "MATH",
                "area_code": "2600"
            }
        ],
        "doc_keywords": [
            "Cloud systems",
            "DaaS",
            "IaaS",
            "PaaS",
            "SaaS",
            "Services and applications",
            "State of the art"
        ],
        "doc_abstract": "This article describes the state of the art of cloud computing, focusing on its features and on the variety of services and applications that can be placed inside a cloud system, such as databases, processing, cloud gaming, storage and backup, etc.. This article also assesses and highlights the advantages and disadvantages of using cloud computing by companies and provides an overview of cloud computing trends and solutions currently available. © 2011 Springer-Verlag.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Cloud interchangeability: Redefining expectations",
        "doc_scopus_id": "80052571099",
        "doc_doi": null,
        "doc_eid": "2-s2.0-80052571099",
        "doc_date": "2011-09-14",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Science (miscellaneous)",
                "area_abbreviation": "COMP",
                "area_code": "1701"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Deployment settings",
            "Interchangeability",
            "Network resources",
            "Standard method",
            "State-of-the-art reviews",
            "Systems interoperability"
        ],
        "doc_abstract": "The large growth of the last few years in cloud computing has been overwhelming, either on resources, deployment or complexity. Still, it lacks a sustaining basis such as standard methods and deployment settings to potentiate a full evolution. Interoperability and interchangeability are expected to overcome vendor lock-ins. This paper overviews the problem with a state-of-the-art review and reflects some of the undergoing approaches.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Sky computing",
        "doc_scopus_id": "80052497339",
        "doc_doi": null,
        "doc_eid": "2-s2.0-80052497339",
        "doc_date": "2011-09-12",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Management of Technology and Innovation",
                "area_abbreviation": "BUSI",
                "area_code": "1405"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "High-performance computing",
            "infrastructure-as-a-service",
            "IT infrastructures",
            "sky computin"
        ],
        "doc_abstract": "Increasing the IT infrastructure without worrying about constraints like location, power, heating/cooling and other has overcome the best expectations from just a few years ago. Yet, the Cloud wide spawn has opened a new window of development by combining groups of Clouds: Sky Computing. The Clouds in the Sky essentially blend efforts. How to manage these Clouds and to deploy applications becomes an upcoming challenge. A good example is the use of High Performance Computing on the Cloud, which would significantly drop costs and would encourage low budget projects. © 2011 AISTI.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A new living lab for usability evaluation of ICT and next generation networks for elderly@home",
        "doc_scopus_id": "79960543375",
        "doc_doi": null,
        "doc_eid": "2-s2.0-79960543375",
        "doc_date": "2011-07-25",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computational Theory and Mathematics",
                "area_abbreviation": "COMP",
                "area_code": "1703"
            },
            {
                "area_name": "Applied Mathematics",
                "area_abbreviation": "MATH",
                "area_code": "2604"
            }
        ],
        "doc_keywords": [
            "Conceptual model",
            "General population",
            "Living lab",
            "Next generation network",
            "Universal Design",
            "Usability evaluation",
            "Usability testing",
            "Work in progress"
        ],
        "doc_abstract": "Living Usability Lab for Next Generation Networks (www.livinglab.pt) is a Portuguese industry-academia collaborative R&D project, active in the field of live usability testing, focusing on the development of technologies and services to support healthy, productive and active citizens. The project adopts the principles of universal design and natural user interfaces (speech, gesture) making use of the benefits of next generation networks and distributed computing. Therefore, it will have impact on the general population, including the elderly and citizens with permanent or situational special needs. This paper presents project motivations, conceptual model, architecture and work in progress.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Web services deployment on P2P networks, based on JXTA",
        "doc_scopus_id": "78649853557",
        "doc_doi": null,
        "doc_eid": "2-s2.0-78649853557",
        "doc_date": "2010-12-13",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            }
        ],
        "doc_keywords": [
            "Centralized architecture",
            "Centralized components",
            "Different services",
            "P2P network",
            "Peer to peer"
        ],
        "doc_abstract": "Digital libraries require several different services. A common way to provide services to Digital Libraries is with the use of Web Services but Web Services are usually based on centralized architectures. In our work we propose that Peer-to-peer networks can be used to relieve the weight of centralized components on the Digital Library infrastructure. One of the challenges of this approach is to develop a method that allows the integration of existing web services into this new reality. In this paper we propose the use of a proxy that allows exposing Web Services that are only accessible trough the peer-to-peer network to the outside world. This proxy also manages interactions with existing external Web Services making them appear as part of the network itself, thus enabling us to reap the benefits of both architectures.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Integrating and optimizing business process execution in P2P environments",
        "doc_scopus_id": "78649818497",
        "doc_doi": null,
        "doc_eid": "2-s2.0-78649818497",
        "doc_date": "2010-12-13",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            }
        ],
        "doc_keywords": [
            "Business process execution",
            "Business process re-engineering",
            "Distributed networks",
            "Emerging technologies",
            "Its efficiencies",
            "Network traffic",
            "P2P environment",
            "Service oriented application"
        ],
        "doc_abstract": "Service oriented applications and environments and peer-to-peer networks have become widely researched topics recently. This paper addresses the benefits and issues of integrating both technologies in the scope of business process execution and presents proposals to reduce network traffic and improve its efficiency.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "GlobaliD - Privacy concerns on a Federated Identity Provider associated with the users' national citizen's card",
        "doc_scopus_id": "78649418947",
        "doc_doi": "10.1109/CENTRIC.2010.26",
        "doc_eid": "2-s2.0-78649418947",
        "doc_date": "2010-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            }
        ],
        "doc_keywords": [
            "Accountability",
            "Anonymity",
            "Citizen card",
            "Identity federation",
            "Privacy",
            "Trustworthiness"
        ],
        "doc_abstract": "Personal information sharing is one of the most common online activities. Most of the times we feel forced to give up about some privacy in order to share a piece of information with others. This paper reflects on the anonymity, integrity, privacy of users' personal information and it's scattering across the Web by taking an approach to digital identity management concept. Consequently it also reflects on the users' information certification and accountability. In this paper we purpose a Federated Identity Management solution for the Web to decrease the privacy issues and avoid the lost of anonymity that may occur when users exchange their particular information within web contexts. We will use a collection of publicly available strong identification mechanisms, such as the users (Portuguese) National Electronic Citizen Identity Card, and a Federated Identity initiative to create the GlobaliD, a Federated Identity Provider to address the previously mentioned reflections. Our aim with the development of GlobaliD is to take a step further in the digital identity management and therefore in the privacy and anonymity safety of the users identity Online by making it more versatile, responsible, trustworthy, integrity and privacy safe, anonym and thus secure. © 2010 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "GlobaliD: Federated identity provider associated with national citizen's card",
        "doc_scopus_id": "77957844142",
        "doc_doi": null,
        "doc_eid": "2-s2.0-77957844142",
        "doc_date": "2010-10-18",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Citizen card",
            "Digital identity",
            "Digital identity management",
            "Fingerprint",
            "GiD",
            "GlobaliD",
            "Identity"
        ],
        "doc_abstract": "Digital Identity is the representation of the overall known information about a user across online applications. Digital identity management is the collection of processes, policies and technologies to manage the complete life cycle of users' identities, such as creation, management, and destruction. Most web applications request users to have a registered digital identity in their system to allow access to their services. Having a myriad of digital identities to manage, users tend to take less protective measures regarding their identities and become reluctant at the moment of adopting (other) applications. Furthermore, having the personal information scattered across many systems, concerns users about its whereabouts and many times leads them to provide false information. The Federation identity concept was introduced to address user digital identity management overload by creating a framework for systems interoperability. It establishes a set of rules and standards in order to create a reliable and secure namespace for the exchanging of identity information between source (usually users via their identity provider) and target (usually web applications), allowing users to access several web applications seamlessly by using only one digital identity. This paper reflects on an approach to the federated identity management, by using a collection of federation standards for the developing of a federated identity provider to enable users to access the web applications seamlessly using a publicly available strong identification mechanism: the National Electronic Citizen Identity Card. Our aim with the development of the GlobaliD identity provider is to take a step further in the digital identity management, making it more versatile, responsible, anonymity and privacysafe, trustworthy and thus secure.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "User provided cloud computing",
        "doc_scopus_id": "77954948097",
        "doc_doi": "10.1109/CCGRID.2010.37",
        "doc_eid": "2-s2.0-77954948097",
        "doc_date": "2010-07-30",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computational Theory and Mathematics",
                "area_abbreviation": "COMP",
                "area_code": "1703"
            },
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Cloud computing",
            "Dynamic bandwidth",
            "Grid users",
            "Home-PCs",
            "Internet access",
            "Paradigm shifts",
            "Processing capacities",
            "Web 2.0"
        ],
        "doc_abstract": "Web 2.0 started a paradigm shift concerning content generation. Users spend hours browsing and producing contents to share, most of the times, freely. During these activities, their laptops and home PCs are considerably underused. By combining the amount of idle processing capacity with increasingly fast internet accesses, every computer can be considered as a computational \"nearby\" resource. The question is: what to do with them? This paper explores how these resources can be used to give something back to the user in a secure and private way. © 2010 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A cloud oriented approach for people-provided services",
        "doc_scopus_id": "77954528260",
        "doc_doi": "10.1109/ICIW.2010.54",
        "doc_eid": "2-s2.0-77954528260",
        "doc_date": "2010-07-16",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Cloud computing",
            "Dynamic bandwidth",
            "Grid users",
            "Home-PCs",
            "Internet access",
            "Paradigm shifts",
            "Processing capacities",
            "Web 2.0"
        ],
        "doc_abstract": "Web 2.0 started a paradigm shift concerning content generation. Users spend hours browsing and producing contents to share, most of the times, freely. During these activities, their laptops and home PCs are considerably underused. By combining the amount of idle processing capacity with increasingly fast internet accesses, every computer can be considered as a computational \"nearby\" resource. The question is: what to do with them? This paper explores how these resources can be used to give something back to the user in a secure and private way. © 2010 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Service oriented P2P networks for digital libraries, based on JXTA",
        "doc_scopus_id": "74549185159",
        "doc_doi": null,
        "doc_eid": "2-s2.0-74549185159",
        "doc_date": "2009-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            }
        ],
        "doc_keywords": [
            "Central servers",
            "P2P network",
            "Peer-to-peer",
            "Peer-to-peer services",
            "Potential resources",
            "Service Oriented",
            "Single point"
        ],
        "doc_abstract": "Digital libraries tend to be based on centralised models. This centralised approach has both advantages and drawbacks. Regarding the drawbacks we notice that the central server used is a single point of failure that can effectively render a digital library unusable if it fails. In this kind of approach we are also ignoring potential resources that are available in other computers on the network. This paper describes a peer-to-peer network architecture based on JXTA and on SOA (Service Oriented Architecture) that can be used as a support infrastructure for a digital library.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "SInBAD digital library preservation using irods data grid",
        "doc_scopus_id": "74549164197",
        "doc_doi": null,
        "doc_eid": "2-s2.0-74549164197",
        "doc_date": "2009-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            }
        ],
        "doc_keywords": [
            "Data Grid",
            "Data grids",
            "Digital library systems",
            "Digital preservation",
            "Grid-based"
        ],
        "doc_abstract": "Digital libraries are important instruments to make knowledge accessible to everyone. Maintaining the information stored within a digital library accessible to the public while ensuring that it remains protected from outside threats is one of the key concerns in digital libraries research. This paper describes possible ways to integrate SInBAD, the University of Aveiro digital library system with a grid based preservation system.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "QGM - A system to improve maths e-learning",
        "doc_scopus_id": "67650556630",
        "doc_doi": null,
        "doc_eid": "2-s2.0-67650556630",
        "doc_date": "2009-07-21",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Education",
                "area_abbreviation": "SOCI",
                "area_code": "3304"
            }
        ],
        "doc_keywords": [
            "Generator models",
            "Internet projects",
            "Learning objects",
            "LOM8MathML",
            "MATEMATICA",
            "Parameterized",
            "Technological platform"
        ],
        "doc_abstract": "The main, goal of Projecto Matematica Ensino (Mathematics Teaching Project) - PmatE - is to promote the learning of mathematics. To achieve that, PmatE has been developing since 1990 an internet project especially designed to increase the interest of students in the discipline. The core of the Project anchors on the so-called \"Questions Generator Model\" (from the Portuguese \"Modelo Gerador de Questões\"). Each \"model\" is a tool based on parameterized expressions, which usually allows thousands of different questions to be generated (different formulations of the same \"model\") formally equivalent in terms of pedagogic content. The scope of this paper is to redesign the former \"model\" using the IEEE LOM's structure to define the learning object and redefine the model structure itself to allow for independence of the technological platform used to support the Project.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Managing scientific production",
        "doc_scopus_id": "57849115806",
        "doc_doi": "10.1109/INFTECH.2008.4621581",
        "doc_eid": "2-s2.0-57849115806",
        "doc_date": "2008-12-25",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Dedicated systems",
            "Digital copies",
            "Distributed models",
            "Scientific achievements",
            "Scientific publications"
        ],
        "doc_abstract": "A substantial amount of universities' and institutes' funding derives from their scientific achievements. Researchers are encouraged to publish new findings and ideas at an ever growing rate. How can the university keep track of the research of hundreds of scientists? How can the university rate departments and distribute funding according to scientific achievements? We present a distributed model for these tasks: a dedicated system for registering information about scientific publications (eABC); a dedicated system for harvesting statistics and respond to queries on scientific production; a dedicated system to maintain digital copies of the scientific publications (SInBAD) and finally a dedicated system to manage researchers CV (Curriculum@ua). The main challenges in each of these systems will be presented, along with a brief description of each one. © IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Applications@DA - Online platform for organizational online submission Applications",
        "doc_scopus_id": "57849104444",
        "doc_doi": "10.1109/INFTECH.2008.4621636",
        "doc_eid": "2-s2.0-57849104444",
        "doc_date": "2008-12-25",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Generic platforms",
            "Online applications",
            "Online submissions",
            "Online tools",
            "Portugal",
            "Production stages",
            "WEB applications",
            "Web-based systems",
            "Workflows"
        ],
        "doc_abstract": "This paper describes the Applications@UA system: a web based system for managing online candidatures at Universidade de Aveiro, Portugal. It is a generic platform that supports virtually any kind of candidature or application. It is in production stage since late 2005. Online applications and candidatures represent document workflows that need to consider specific rules designed for that particular event. The main purpose of this system is to provide a web application with back and front offices capable of designing and managing the rules of the events. This online tool has proven to be useful for applicants, evaluators and staff responsible for applications. © IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "UNIMARC-XML performance testing",
        "doc_scopus_id": "70350651517",
        "doc_doi": "10.1145/1621087.1621118",
        "doc_eid": "2-s2.0-70350651517",
        "doc_date": "2008-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Data storage",
            "Exchange format",
            "Indexing and retrieval",
            "Performance testing",
            "Performance tests",
            "XML data",
            "XML query performance",
            "XML storage"
        ],
        "doc_abstract": "Considering the notoriety that XML has gained in the last years as an exchange format, how can we conciliate XML data exchange and presentation with efficient data storage? Is there a one-fits-all solution? If not, what are the possible scenarios and solutions? This paper presents preliminary results on performance tests over several state-of-the-art solutions for XML storage, indexing and retrieval. © ACM 2008.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Search engines evaluation for P2P based Digital Libraries",
        "doc_scopus_id": "70350648584",
        "doc_doi": "10.1145/1621087.1621119",
        "doc_eid": "2-s2.0-70350648584",
        "doc_date": "2008-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Centralized approaches",
            "Distributed Computing",
            "Indexing",
            "P2P-based",
            "Peer-to-peer computing",
            "Search queries",
            "Traditional systems"
        ],
        "doc_abstract": "Indexing and searching services play a critical role in digital libraries. They are responsible for maintaining an index of the existing resources and responding to search queries. Traditional systems store these indexes using a centralized approach, but recent distributed computing paradigms bring new challenges to the storage of information and query processing. In this paper, we will discuss the new trends in the area of P2P based digital libraries and which challenges they place for these services. In the second part of the paper, we evaluate different engines according to defined objectives and propose changes accordingly. © ACM 2008.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "SWIT: An open-source web-based database management system with indexing engine integration",
        "doc_scopus_id": "70350630139",
        "doc_doi": "10.1145/1621087.1621120",
        "doc_eid": "2-s2.0-70350630139",
        "doc_date": "2008-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Database optimization",
            "Indexing",
            "Indexing engines",
            "Management applications",
            "Open-source",
            "Performance",
            "Query performance",
            "Remote administration",
            "Web based",
            "WEB-BASED database"
        ],
        "doc_abstract": "There are currently a considerable number of digital libraries using XML documents to describe their resources. In this paper, we describe a database solution which integrates an XML native database and a search engine to improve query performance. A web based management application is also presented which allows local and remote administration of the database. © ACM 2008.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "User profiles in organizational environments",
        "doc_scopus_id": "58149165178",
        "doc_doi": null,
        "doc_eid": "2-s2.0-58149165178",
        "doc_date": "2008-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            }
        ],
        "doc_keywords": [
            "Dynamic profiling",
            "Dynamic user profile",
            "Relevant informations",
            "Stereotypes",
            "User profile",
            "User profiling",
            "User's interests",
            "Web sites"
        ],
        "doc_abstract": "In an organizational/corporative environment, each user can perform different roles throughout the time. Dynamic user profiles can be used to accomplish this variation specification. A user profile is a set of information about a given user in a given context and on a specific period of time. The concept of dynamic profiling simply means that the relevant information about the user can vary in time. User profiling is usually related to web advertisement of goods and services for a user in a web site, by means of gathering information of the user's interests and then harvesting the web over these interests. The profile discussed in this paper is service related, directly depending from the user's condition in an organization.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Improving performance of background jobs in digital libraries using grid computing",
        "doc_scopus_id": "58049178479",
        "doc_doi": null,
        "doc_eid": "2-s2.0-58049178479",
        "doc_date": "2008-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            }
        ],
        "doc_keywords": [
            "Case studies",
            "Centralized architectures",
            "GRID applications",
            "Grid services",
            "Improving performances",
            "Large amounts of datums",
            "Memory usages",
            "Multimedia files",
            "Performance issues"
        ],
        "doc_abstract": "Digital libraries are responsible for maintaining very large amounts of data, which must typically be processed for storage and dissemination purposes. Since these background tasks are usually very demanding regarding CPU and memory usage, especially when dealing with multimedia files, centralized architectures may suffer from performance issues, affecting the responsiveness to users. In this paper, we propose a grid service layer for the execution of background jobs in digital libraries. A case study is also presented, where we evaluate the performance of a grid application.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "SOPPA - Service oriented P2P framework for digital libraries",
        "doc_scopus_id": "58049139902",
        "doc_doi": null,
        "doc_eid": "2-s2.0-58049139902",
        "doc_date": "2008-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            }
        ],
        "doc_keywords": [
            "Data and metadatas",
            "Dynamic environments",
            "New opportunities",
            "P2p networks",
            "Peer-to-peer",
            "Service oriented approaches",
            "SOA"
        ],
        "doc_abstract": "P2P and SOA paradigms provide new opportunities for the development of new digital libraries and the redesign of existing ones. This paper describes the work being conducted to create a framework for the creation of digital libraries, which relies on a P2P network and service-enabled peers to achieve high modularity, reusability and performance in dynamic environments. While this framework supports data and metadata storage and management, this paper focuses on its service oriented approach.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Resource aggregation in digital libraries - Static vs dynamic protocols",
        "doc_scopus_id": "55849099291",
        "doc_doi": null,
        "doc_eid": "2-s2.0-55849099291",
        "doc_date": "2008-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Distributed systems",
            "Heterogeneous systems",
            "Metadata aggregation",
            "Resource aggregation",
            "Static and dynamic"
        ],
        "doc_abstract": "This article analyses development of static and dynamic protocols to aggregate metadata and resources from heterogeneous systems. In particular, it compares the advantages and drawbacks of both types of protocols and presents a case study of the University of Aveiro Information System as an example of the possibilities of dynamic resource aggregation systems.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "User profiles in corporate scenarios",
        "doc_scopus_id": "51249109933",
        "doc_doi": "10.1109/ICIW.2008.60",
        "doc_eid": "2-s2.0-51249109933",
        "doc_date": "2008-09-12",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Dynamic user profile",
            "Profile management using web services",
            "Stereotypes",
            "User profile",
            "User profiling"
        ],
        "doc_abstract": "In an organizational/corporative environment, each user can perform different roles throughout the time. Dynamic user profiles can be used to accomplish this variation specification. A user profile is a set of information about a given user in a given context and on a specific period of time. The concept of dynamic profiling simply means that the relevant information about the user can vary in time. User profiling is usually related to web advertisement of goods and services for a user in a web site, by means of gathering information of the user's interests and then harvesting the web over these interests. The profile discussed in this paper is service related, directly depending from the user's condition in an organization. © 2008 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "User profiles in organizational environments",
        "doc_scopus_id": "45749133866",
        "doc_doi": "10.1108/10650740810886312",
        "doc_eid": "2-s2.0-45749133866",
        "doc_date": "2008-06-20",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Library and Information Sciences",
                "area_abbreviation": "SOCI",
                "area_code": "3309"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "Purpose – The aim of this paper is to describe a project to provide an online web portal that can be used as a front-end for all university users – students, teachers, staff – and services, library, administration, e-learning, and e-mail. Design/methodology/approach – The profile model proposed is mainly inheritable, defined by profile components with transactional templates, security rules and layout templates. This approach is being tested on a campus prototype portal. The prototype is an underway project in development at our university. Findings – This paper explains that, even though different from the overall approaches, the basic profile and the profile management system proposed are solid alternatives when addressing personalization of organization users. Originality/value – This new approach explains how user modelling applications can be integrated into any organization without the cost of reengineering the entire information system already in place. © 2008, Emerald Group Publishing Limited",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A digital library framework for the University of Aveiro",
        "doc_scopus_id": "74549144082",
        "doc_doi": null,
        "doc_eid": "2-s2.0-74549144082",
        "doc_date": "2008-01-01",
        "doc_type": "Book Chapter",
        "doc_areas": [
            {
                "area_name": "Mathematics (all)",
                "area_abbreviation": "MATH",
                "area_code": "2600"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": null,
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "The new institutional portal of UA methodology of development",
        "doc_scopus_id": "56749159016",
        "doc_doi": "10.1145/1352694.1352766",
        "doc_eid": "2-s2.0-56749159016",
        "doc_date": "2007-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Information architecture",
            "Information subsystems",
            "Managing information",
            "Portal implementations",
            "University communities",
            "Web portal"
        ],
        "doc_abstract": "A university institutional portal is a step forward in managing information for the vision of a university directed to its public. Knowing the importance of this tool, the University of Aveiro (UA) developed in the last years its institutional portal. In this paper, we look for describing the diverse steps in the implementation of this application, since the necessary survey of requirements, followed by i) the necessity of development and integration of information subsystems; ii) the development of an institutional image and identity, and Hi) the involvement of the university community at the final stage of the process. We also aim to describe the diverse phases of the Portal implementation until its launching.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "TDmat-mathematics diagnosis evaluation test for engineering sciences students",
        "doc_scopus_id": "33947725811",
        "doc_doi": "10.1080/00207390601035476",
        "doc_eid": "2-s2.0-33947725811",
        "doc_date": "2007-01-01",
        "doc_type": "Review",
        "doc_areas": [
            {
                "area_name": "Mathematics (miscellaneous)",
                "area_abbreviation": "MATH",
                "area_code": "2601"
            },
            {
                "area_name": "Education",
                "area_abbreviation": "SOCI",
                "area_code": "3304"
            },
            {
                "area_name": "Applied Mathematics",
                "area_abbreviation": "MATH",
                "area_code": "2604"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "Since 1989, the Mathematics Education Project (PmatE-Projecto Matemtica Ensino) has developed several strategies to improve the success of students in Mathematics. The most important of these are mathematical games for all grades above primary school. The online evaluation of Mathematics subjects is one of PmatE's goals. The implementation of an on-line diagnosis test-TDmat (Teste Diagnstico de Matemtica), mandatory for all students enrolling for the first time in Science and Engineering courses at the University of Aveiro, was the approach chosen to evaluate the mathematical competences of these students. TDmat is a computer test with automatic evaluation in which the analysis of results is done automatically. This paper describes how it is conceived as well as the main results and conclusions drawn from evaluations of the school years 2003/2004 and 2004/2005.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Contact@UA - A profile driven portal",
        "doc_scopus_id": "33749052052",
        "doc_doi": "10.1109/AICT-ICIW.2006.69",
        "doc_eid": "2-s2.0-33749052052",
        "doc_date": "2006-10-03",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Dynamic web interface",
            "Elearning",
            "Web service (WS)"
        ],
        "doc_abstract": "Contact@UA is an underway project in development at University of Aveiro, Portugal. The goal of the project is to provide an online web portal that can be used as a front-end for all University users - students, teachers, staff...- and services - library, administration, elearning, email.... The aim of Contact@UA is not to build a bulk of new services, but instead to integrate the existing ones, in a dynamic web interface that self reconfigures according to the preferences and privileges of the user that logs into the portal. One of the key features of this portal is the usage of a web service (WS) architecture system to integrate the information collected in the existing services. © 2006 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "SInBAD - A digital library to aggregate multimedia documents",
        "doc_scopus_id": "33749052481",
        "doc_doi": "10.1109/AICT-ICIW.2006.172",
        "doc_eid": "2-s2.0-33749052481",
        "doc_date": "2006-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Information system",
            "Multimedia documents",
            "Web services"
        ],
        "doc_abstract": "The University of Aveiro is currently developing SInBAD, an integrated system for digital libraries and archives. The aim of the project is to build an information system to support the aggregation of multimedia documents such as books, photographs, and audiovisual resources. All these resources are part of the academic life and identity of the University. The architecture adopted in SInBAD is divided into 3 subsystems - Library, Archive and Jazz - and is Web Service oriented. Also, documents are distributed by several Agents in a dynamic manner. The basic description model used in the documents is the element set defined by the Dublin Core Metadata Initiative, although each subsystem may use specific data structures according to the document type and format. In this paper we present the created system, pointing out the interoperability and the web service oriented architecture. Also, despite its distributed nature, users may search simultaneously in all documents. © 2006 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Contact@UA - Multi-service web portal",
        "doc_scopus_id": "84859945571",
        "doc_doi": null,
        "doc_eid": "2-s2.0-84859945571",
        "doc_date": "2005-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Dynamic web interface",
            "Multi-services",
            "New services",
            "Portugal",
            "User profile"
        ],
        "doc_abstract": "Contact@UA is an underway project in development at University of Aveiro, Portugal. The goal of the project is to provide an online web portal that can be used as a front-end for all university users -students, teachers, staff...- and services - library, administration, e-learning, email.... The aim of Contact@UA is not to build a bulk of new services, but instead to integrate the existing ones, in a dynamic web interface that self reconfigures according to the preferences and privileges of the user that logs into the portal.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Portuguese parliamentary records: A multimedia digital library distributed architecture, based on Web Services",
        "doc_scopus_id": "33847114038",
        "doc_doi": "10.1109/NWESP.2005.64",
        "doc_eid": "2-s2.0-33847114038",
        "doc_date": "2005-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Audiovisual archives",
            "Multimedia digital libraries",
            "Web services"
        ],
        "doc_abstract": "This paper presents the overall work of the Portuguese Parliamentary Records: a Multimedia Digital Library composed by the Parliamentary Records and an Audiovisual Archive. These systems are briefly described and a distributed architecture, based on Web Services, that allows integrating information from different systems that compose the Multimedia Digital Library, is presented and analyzed. © 2005 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Web annotation system based on web services",
        "doc_scopus_id": "33847104723",
        "doc_doi": "10.1109/NWESP.2005.82",
        "doc_eid": "2-s2.0-33847104723",
        "doc_date": "2005-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "System implementation",
            "Web annotation tools",
            "Web services"
        ],
        "doc_abstract": "Annotation tools allow users to complement existing documents with comments, suggestions or other information. Currently, desktop annotation tools are much more sophisticated than those available for annotating web documents, EspiritUs is a Web Services based system designed to allow users to create, share, and search annotations on the web. In this article we analyze in detail existing web annotation tools, present the adopted architecture based on XML technologies, describe the system implementation and present two possible annotation scenarios. Finally, we present some conclusions and guidelines for future work for this project. © 2005 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "XML family skills used by FLoWPASS",
        "doc_scopus_id": "21944441701",
        "doc_doi": null,
        "doc_eid": "2-s2.0-21944441701",
        "doc_date": "2005-06-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Web services",
            "Workflow process automation"
        ],
        "doc_abstract": "We created a framework called FLoWPASS - Framework to Laws Workflow Process Automation System. It discusses about the the interrelation amongst the WPA, the XML Family and its integration with Database Legacy Systems. Its main idea is to separate the workflow process logic from the application components. For that, we used workflow process management techniques based on WfMC Reference Model, Java programming to implement the process logic, and XML Schemas for data and metadata modeling. We are testing a workflow process automation prototype to be used in our case study: the information management system of the Portuguese Parliament legislative processes. In this work, we describe the XML Family skills used by FLoWPASS to show the related multimedia documents. We implemented a first prototype to show the laws' workflow processes based on WfMC XPDL Schema. For the applications components we built XML Schemas to generate XML files and test XSL files, which will be used to format data for each possible system front-end used by FLoWPASS-based systems, like PDAs, third generation mobile phones and desktop personal computers.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Theories of generalised functions: Distributions, ultradistributions and other generalised functions",
        "doc_scopus_id": "63449139085",
        "doc_doi": "10.1533/9780857099488",
        "doc_eid": "2-s2.0-63449139085",
        "doc_date": "2005-01-01",
        "doc_type": "Book",
        "doc_areas": [
            {
                "area_name": "Mathematics (all)",
                "area_abbreviation": "MATH",
                "area_code": "2600"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "Explaining and comparing the various standard types of generalised functions which have been developed during the 20th Century, this text also contains accounts of recent non-standard theories of distributions, ultradistributions and Stato-hyperfunctions. The book could readily be used as a main text on generalised functions for mathematical undergraduates in final year analysis courses, as it presupposes little more than a general mathematical background. It also makes a valuable reference text for non-specific applied mathematics students, such as physicists or electrical engineers, needing to gain expertise in the application of generalised functions to physical problems, without any prior acquaintance of the specialised subject matter. An ideal companion book to Delta Functions, also by Professor Hoskins. © 2005 Woodhead Publishing Limited.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Audiovisual archive with MPEG-7 video description and XML database",
        "doc_scopus_id": "8444240453",
        "doc_doi": null,
        "doc_eid": "2-s2.0-8444240453",
        "doc_date": "2004-11-23",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Audiovisual archives",
            "MPEG-7",
            "NXDB",
            "Video content"
        ],
        "doc_abstract": "This article presents the development of an audiovisual archive that uses the MPEG-7 standard to describe video content and a XML database to store the video descriptions. It presents the model adopted to describe the video content, the framework of the audiovisual archive information system, a video indexing tool developed to allow the creation and manipulation of XML documents with the video descriptions and an interface to visualize the videos over the Web.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Infinitesimal Methods of Mathematical Analysis",
        "doc_scopus_id": "79551613427",
        "doc_doi": "10.1533/9780857099501",
        "doc_eid": "2-s2.0-79551613427",
        "doc_date": "2004-01-01",
        "doc_type": "Book",
        "doc_areas": [
            {
                "area_name": "Mathematics (all)",
                "area_abbreviation": "MATH",
                "area_code": "2600"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "This modern introduction to infinitesimal methods is a translation of the book Métodos Infinitesimais de Análise Matemática by José Sousa Pinto of the University of Aveiro, Portugal and is aimed at final year or graduate level students with a background in calculus. Surveying modern reformulations of the infinitesimal concept with a thoroughly comprehensive exposition of important and influential hyperreal numbers, the book includes previously unpublished material on the development of hyperfinite theory of Schwartz distributions and its application to generalised Fourier transforms and harmonic analysis. This translation by Roy Hoskins was also greatly assisted by the comments and constructive criticism of Professor Victor Neves, of the University of Aveiro. © 2004 HORWOOD PUBLISHING LIMITED Published by Elsevier Ltd. All rights reserved.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Design and development of a virtual library and a SOAP/Z39.50 gateway using Java technologies",
        "doc_scopus_id": "0035171414",
        "doc_doi": "10.1117/12.433007",
        "doc_eid": "2-s2.0-0035171414",
        "doc_date": "2001-07-12",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Electronic, Optical and Magnetic Materials",
                "area_abbreviation": "MATE",
                "area_code": "2504"
            },
            {
                "area_name": "Condensed Matter Physics",
                "area_abbreviation": "PHYS",
                "area_code": "3104"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Applied Mathematics",
                "area_abbreviation": "MATH",
                "area_code": "2604"
            },
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "A study on design and development of virtual libraries was carried out. The development of a SOAP/Z39.50 gateway was also analyzed using open technologies such as Java and extensible markup language (XML). The gateway uses simpler protocols to improve the interoperability of biblographic information systems. © 2001 SPIE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Portuguese parliamentary records digital library",
        "doc_scopus_id": "84973924399",
        "doc_doi": null,
        "doc_eid": "2-s2.0-84973924399",
        "doc_date": "2001-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            }
        ],
        "doc_keywords": [
            "Historical periods",
            "Members of parliaments",
            "Portuguese parliament",
            "Printed materials",
            "Specific information"
        ],
        "doc_abstract": "The first phase of the digitalisation of the Portuguese Parliament proceedings will cover the historical period between 1935-2000 and will sum up to around 200.000 pages. In this stage we intend to develop the mechanisms as well as the tools for the entire project of the Parliament Digital Library, which we predict will have up to one million pages. The process involves the microfilming of all the available material, the scanning of the material so as to obtain the image of the page as well as the use of an OCR - Optical Character Recognition - that recovers the original text, allowing to search in the original documents. The project concerns printed material only, manuscripts will be handled separately in a later stage. This project was initially aimed at the disposal of the Parliament Intranet, however it seems likely that most of its information will be accessible on the Internet. At this stage, the material is organized in small brochures with an average of 40-50 pages each and contains the speeches of members of Parliament. Each one of the pages is treated individually, so when the user is looking for specific information, he is drawn to the page or pages in which the expression is used. The visualization of the pages can be either in text mode or in the original text through digitalized image. Despite the granularity of the system being \"page\", which means that each page is treated as a complete element, it is possible to print the entire document, in text or image, obtaining therefore a copy of the original document, because each page is wrapped with metadata.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Hyperfinite representation of distributions",
        "doc_scopus_id": "0043262762",
        "doc_doi": "10.1007/BF02829532",
        "doc_eid": "2-s2.0-0043262762",
        "doc_date": "2000-01-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Mathematics (all)",
                "area_abbreviation": "MATH",
                "area_code": "2600"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "Hyperfinite representation of distributions is studied following the method introduced by Kinoshita [2, 3], although we use a different approach much in the vein of [4]. Products and Fourier transforms of representatives of distributions are also analysed.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Sampling and Π-sampling expansions",
        "doc_scopus_id": "0042188662",
        "doc_doi": "10.1007/BF02829533",
        "doc_eid": "2-s2.0-0042188662",
        "doc_date": "2000-01-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Mathematics (all)",
                "area_abbreviation": "MATH",
                "area_code": "2600"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "Using the hyperfinite representation of functions and generalized functions this paper develops a rigorous version of the so-called 'delta method' approach to sampling theory. This yields a slightly more general version of the classical WKS sampling theorem for band-limited functions.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Hypermedia authoring tools based on OLE technology",
        "doc_scopus_id": "34249761206",
        "doc_doi": "10.1007/BF01215870",
        "doc_eid": "2-s2.0-34249761206",
        "doc_date": "1995-09-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Media Technology",
                "area_abbreviation": "ENGI",
                "area_code": "2214"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            },
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "This paper report on recent and on going work related to the design of a set of hypermedia authoring tools intended to produce courseware, to be used for self learning or distance learning and training environments in a cooperative way. These tools have roots in a standalone hypermedia editor developed to create courseware, to which were added other tools to enhance its usability, namely a hypermedia player to view courseware in self study mode, and a hypermedia browser to create, to navigate and to display graphically the hypermedia document structure. The underlying metaphors are the overhead projector, the transparency and the layer. This system was developed for the MS-Windows environment, supporting OLE technology. We discuss the impact that such technology might have on the \"look and feel\" of hypermedia learning material and we describe the implementation of a Hypermedia Editor, Browser and Player tools. Part of this work is carried out in the context of the Co-Learn European project, which is aiming to design and to implement a third generation cooperative learning environment. © 1995 Kluwer Academic Publishers.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "HyDE: A hypermedia document editor based on OLE technology",
        "doc_scopus_id": "0028138073",
        "doc_doi": "10.1109/mmcs.1994.292482",
        "doc_eid": "2-s2.0-0028138073",
        "doc_date": "1994-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Cooperative and distance education",
            "Human computer interaction",
            "Hypermedia",
            "Hypermedia document editor",
            "Multimedia"
        ],
        "doc_abstract": "This paper reports on recent and on going work related to the design of a Hypermedia Document Editor (HyDE) intended to produce courseware to be used in a cooperative and distance learning environment. This work is carried out in the context of the Co-Learn European project, which is aiming to design and to implement a third generation cooperative learning environment. We describe the impact that OLE technology might have on the `look and feel' of hypermedia learning material, the HyDE implementation and the application functionality.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "PC workstation for Ethernet monitoring and management",
        "doc_scopus_id": "0026403147",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0026403147",
        "doc_date": "1991-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Ethernet Monitoring",
            "Network Management",
            "PC Workstation"
        ],
        "doc_abstract": "The authors present a monitoring and management workstation for IEEE 802.3 networks (Ethernet) based on a PC-AT. The monitor performs traffic analysis, detects active machines in the network, maintains a network database with information regarding network topology and machines, filters specific packets or protocols, and can also work as a traffic generator. The system has a friendly user interface simplifying the interaction with the network manager.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Integrated management system for interconnected local area networks",
        "doc_scopus_id": "0026373979",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0026373979",
        "doc_date": "1991-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "central management workstations",
            "Communication protocols",
            "Data exchanges",
            "Integrated management",
            "Interconnected LAN"
        ],
        "doc_abstract": "In order to provide communication facilities for data exchange among workstations located in a modern organization it is necessary to interconnect different local area networks (LANs). Normally, these interconnected LANs have different access media and topologies (Ethernet, token-ring, FDDI, ...), communications protocols (TCP/IP, OSI, ...) and services. A proposal is presented for an integrated network management system, suitable for such a heterogeneous scenario, that will hide the differences of the underlying LANs. This management system provides a central management workstation with remote access and display, and monitoring agents.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "On the asymptotic behaviour of the titchmarsh- weyl coefficients for a fourth order equation",
        "doc_scopus_id": "33747063319",
        "doc_doi": "10.1080/16073606.1981.9632255",
        "doc_eid": "2-s2.0-33747063319",
        "doc_date": "1981-01-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Mathematics (miscellaneous)",
                "area_abbreviation": "MATH",
                "area_code": "2601"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "For second order equations -(py1)1 + qy = λy on [0,∞) it is known that the Titchmarsh—Wey1 coefficient m(λ) for large λ is asymptotically equivalent to that of the Fourier equation -y” = λy. There is at present no corresponding result for fourth order equations. In this paper we construct the ij (λ) coefficients for the fourth order equation y(4)—((x2 + 4k)y’)’—¼y = λy on [O, ∞) explicitly in terms of Integrals of Whittaker functions. We show that as λ →∞ the coefficients approach those of the corresponding Fourier equation y(4) = λy. © 1981, Taylor & Francis Group, LLC.",
        "available": false,
        "clean_text": ""
    }
]