[
    {
        "doc_title": "Exploring the Age Effects on European Portuguese Vowel Production: An Ultrasound Study",
        "doc_scopus_id": "85123516451",
        "doc_doi": "10.3390/app12031396",
        "doc_eid": "2-s2.0-85123516451",
        "doc_date": "2022-02-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Materials Science (all)",
                "area_abbreviation": "MATE",
                "area_code": "2500"
            },
            {
                "area_name": "Instrumentation",
                "area_abbreviation": "PHYS",
                "area_code": "3105"
            },
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            },
            {
                "area_name": "Process Chemistry and Technology",
                "area_abbreviation": "CENG",
                "area_code": "1508"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Fluid Flow and Transfer Processes",
                "area_abbreviation": "CENG",
                "area_code": "1507"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.For aging speech, there is limited knowledge regarding the articulatory adjustments underlying the acoustic findings observed in previous studies. In order to investigate the age-related articulatory differences in European Portuguese (EP) vowels, the present study analyzes the tongue configuration of the nine EP oral vowels (isolated context and pseudoword context) produced by 10 female speakers of two different age groups (young and old). From the tongue contours automatically segmented from the US images and manually revised, the parameters (tongue height and tongue advancement) were extracted. The results suggest that the tongue tends to be higher and more advanced for the older females compared to the younger ones for almost all vowels. Thus, the vowel articulatory space tends to be higher, advanced, and bigger with age. For older females, unlike younger females that presented a sharp reduction in the articulatory vowel space in disyllabic sequences, the vowel space tends to be more advanced for isolated vowels compared with vowels produced in disyllabic sequences. This study extends our pilot research by reporting articulatory data from more speakers based on an improved automatic method of tongue contours tracing, and it performs an inter-speaker comparison through the application of a novel normalization procedure.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Association between acoustic speech features and non-severe levels of anxiety and depression symptoms across lifespan",
        "doc_scopus_id": "85104151098",
        "doc_doi": "10.1371/journal.pone.0248842",
        "doc_eid": "2-s2.0-85104151098",
        "doc_date": "2021-04-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Multidisciplinary",
                "area_abbreviation": "MULT",
                "area_code": "1000"
            }
        ],
        "doc_keywords": [
            "Adult",
            "Aged",
            "Aged, 80 and over",
            "Aging",
            "Anxiety",
            "Cross-Sectional Studies",
            "Depression",
            "Female",
            "Humans",
            "Male",
            "Middle Aged",
            "Portugal",
            "Speech Acoustics"
        ],
        "doc_abstract": "© 2021 Albuquerque et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Several studies have investigated the acoustic effects of diagnosed anxiety and depression. Anxiety and depression are not characteristics of the typical aging process, but minimal or mild symptoms can appear and evolve with age. However, the knowledge about the association between speech and anxiety or depression is scarce for minimal/mild symptoms, typical of healthy aging. As longevity and aging are still a new phenomenon worldwide, posing also several clinical challenges, it is important to improve our understanding of non-severe mood symptoms' impact on acoustic features across lifetime. The purpose of this study was to determine if variations in acoustic measures of voice are associated with non-severe anxiety or depression symptoms in adult population across lifetime. Methods Two different speech tasks (reading vowels in disyllabic words and describing a picture) were produced by 112 individuals aged 35-97. To assess anxiety and depression symptoms, the Hospital Anxiety Depression Scale (HADS) was used. The association between the segmental and suprasegmental acoustic parameters and HADS scores were analyzed using the linear multiple regression technique. Results The number of participants with presence of anxiety or depression symptoms is low (>7: 26.8% and 10.7%, respectively) and non-severe (HADS-A: 5.4 ± 2.9 and HADS-D: 4.2 ± 2.7, respectively). Adults with higher anxiety symptoms did not present significant relationships associated with the acoustic parameters studied. Adults with increased depressive symptoms presented higher vowel duration, longer total pause duration and short total speech duration. Finally, age presented a positive and significant effect only for depressive symptoms, showing that older participants tend to have more depressive symptoms. Conclusions Non-severe depression symptoms can be related to some acoustic parameters and age. Depression symptoms can be explained by acoustic parameters even among individuals without severe symptom levels.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Prosodic Changes with Age: A Longitudinal Study on a Famous European Portuguese Native Speaker",
        "doc_scopus_id": "85116396250",
        "doc_doi": "10.1007/978-3-030-87802-3_65",
        "doc_eid": "2-s2.0-85116396250",
        "doc_date": "2021-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Theoretical Computer Science",
                "area_abbreviation": "MATH",
                "area_code": "2614"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Different ages",
            "Human communications",
            "Longitudinal analysis",
            "Longitudinal study",
            "Pilot studies",
            "Prosodic features",
            "Prosodics",
            "Prosody",
            "Public figure",
            "Vocal aging"
        ],
        "doc_abstract": "© 2021, Springer Nature Switzerland AG.The understanding of human communication development throughout the lifetime involves the characterization of both segmental and suprasegmental parameters. This pilot study intends to analyse suprasegmental (i.e., prosodic) features in conversational longitudinal speech samples in uncontrolled environments. The ProsodyDescriptor Extractor was used to extract 17 prosodic features (intonation, intensity and rhythm measures) in a set of 90 speech intervals of 3 s to 6 s selected from three interviews collected in different ages of the same male public figure. Group mean comparison tests revealed that 14 prosodic features presented statistically significant differences between the three ages. In general, in comparison with his younger age, the speaker got a higher F0 mean level, more F0 variability, higher F0 peaks, more variable F0 peak values, less variable F0 falls, higher F0 min, less steeper F0 rises, less steeper F0 falls, less variable F0 rises, more energy in high frequencies, slower speech and articulation rate, less vocal effort and less variable global intensity. The longitudinal study of age-related changes in speech rhythm and intonation could contribute to the normal ageing process’ characterization, being a reference for clinical assessment and intervention.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Contributions to a quantitative unsupervised processing and analysis of tongue in ultrasound images",
        "doc_scopus_id": "85087274917",
        "doc_doi": "10.1007/978-3-030-50516-5_15",
        "doc_eid": "2-s2.0-85087274917",
        "doc_date": "2020-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Theoretical Computer Science",
                "area_abbreviation": "MATH",
                "area_code": "2614"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Automatic analysis",
            "Computational approach",
            "Electromagnetic articulography",
            "Speech motor control",
            "Speech production",
            "Temporal coherence",
            "Tongue segmentation",
            "Ultrasound imaging"
        ],
        "doc_abstract": "© Springer Nature Switzerland AG 2020.Speech production studies and the knowledge they bring forward are of paramount importance to advance a wide range of areas including Phonetics, speech therapy, synthesis and interaction. Several technologies have been considered to study static and dynamic features of the articulators and speech motor control, such as electromagnetic articulography (EMA), real-time magnetic resonance (RTMRI) and ultrasound (US) imaging. While the latest advances in RTMRI provide a wealth of data of the full vocal tract, it is an expensive resource that requires specialized facilities. In this sense, US is a more affordable alternative for several contexts, enabling the acquisition of larger datasets, but demands adequate computational approaches for processing and analysis. While the literature is prolific in proposing methods for tongue segmentation from US, the noisy nature of the images and the specificities of the equipment often dictate a poor performance on novel datasets, a matter that needs to be assessed, before large data acquisition, to devise suitable acquisition and processing methods. In the scope of a line of research studying speech changes with age, this work describes the first results of an automatic tongue segmentation method from US, along with a characterization of the main challenges posed by the image data. Even though improvements are still needed, particularly to ensure temporal coherence, at its current stage, this method can already provide the required data for an automatic analysis of maximum tongue height, a relevant parameter to assess speech changes on vowel production.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Validity and reliability of the Intelligibility in Context Scale: European Portuguese version",
        "doc_scopus_id": "85064177791",
        "doc_doi": "10.1080/02699206.2019.1589579",
        "doc_eid": "2-s2.0-85064177791",
        "doc_date": "2019-12-02",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Language and Linguistics",
                "area_abbreviation": "ARTS",
                "area_code": "1203"
            },
            {
                "area_name": "Linguistics and Language",
                "area_abbreviation": "SOCI",
                "area_code": "3310"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            }
        ],
        "doc_keywords": [
            "Child",
            "Child Language",
            "Child, Preschool",
            "Female",
            "Humans",
            "Male",
            "Parents",
            "Phonetics",
            "Portugal",
            "Reproducibility of Results",
            "Speech Intelligibility",
            "Speech-Language Pathology",
            "Surveys and Questionnaires",
            "Translating"
        ],
        "doc_abstract": "© 2019, © 2019 Taylor & Francis Group, LLC.The purpose of the study was to evaluate the validity, reliability, sensitivity and specificity of the European-Portuguese version of the Intelligibility in Context Scale (ICS-EP). Seventy-six children (age: M = 60.6, SD = 8.1 months), 25 having a parent or teacher concern about how they talked and 51 with no concern, were assessed with the phonetic-phonological test (TFF-ALPE) to calculate the following severity measures: percentage of phonemes correct (PPC), percentage of consonants correct (PCC), and percentage of vowels correct (PVC). Parents also filled out a questionnaire about their child’s development (e.g. concern about how the child talks). The ICS was then completed by parents to estimate their children’s intelligibility with different communicative partners. The results showed that item-level scores were different according to communicative partners. The mean ICS score for the whole sample was 4.5 (SD = 0.6), showing that children were “usually” to “always” intelligible. The ICS had excellent internal consistency (α = 0.96). Children with parental concern about their speech presented significantly lower mean scores (M = 3.91, SD = 0.59) than children without parental concerns (M = 4.78, SD = 0.36). There was a positive correlation between the ICS scores and PPC (r = .655), PCC (r = .654), and PVC (r = .588). A simple linear model was also obtained between the ICS mean score and the severity measures analyzed. High values were obtained for sensitivity (0.80) and specificity (0.84), using a cut-off point of 4.36. We conclude that the ICS-EP has good psychometric properties, suggesting it to be a valid tool for estimating children’s intelligibility when talking with different communicative partners. Therefore, this version of the ICS can be used as a screening measure for children’s speech intelligibility.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Reliability and validity evidence of the Assessment of Language Use in Social Contexts for Adults (ALUSCA)",
        "doc_scopus_id": "85045259658",
        "doc_doi": "10.1080/14015439.2018.1458898",
        "doc_eid": "2-s2.0-85045259658",
        "doc_date": "2019-10-02",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Arts and Humanities (miscellaneous)",
                "area_abbreviation": "ARTS",
                "area_code": "1201"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            },
            {
                "area_name": "LPN and LVN",
                "area_abbreviation": "NURS",
                "area_code": "2912"
            }
        ],
        "doc_keywords": [
            "Adult",
            "Case-Control Studies",
            "Female",
            "Humans",
            "Language",
            "Language Tests",
            "Male",
            "Pilot Projects",
            "Predictive Value of Tests",
            "Reproducibility of Results",
            "Social Behavior",
            "Stuttering"
        ],
        "doc_abstract": "© 2018, © 2018 Informa UK Limited, trading as Taylor & Francis Group.Background: The appropriate use of language in context depends on the speaker’s pragmatic language competencies. A coding system was used to develop a specific and adult-focused self-administered questionnaire to adults who stutter and adults who do not stutter, The Assessment of Language Use in Social Contexts for Adults, with three categories: precursors, basic exchanges, and extended literal/non-literal discourse. This paper presents the content validity, item analysis, reliability coefficients and evidences of construct validity of the instrument. Methods: Content validity analysis was based on a two-stage process: first, 11 pragmatic questionnaires were assessed to identify items that probe each pragmatic competency and to create the first version of the instrument; second, items were assessed qualitatively by an expert panel composed by adults who stutter and controls, and quantitatively and qualitatively by an expert panel composed by clinicians. A pilot study was conducted with five adults who stutter and five controls to analyse items and calculate reliability. Construct validity evidences were obtained using the hypothesized relationships method and factor analysis with 28 adults who stutter and 28 controls. Results: Concerning content validity, the questionnaires assessed up to 13 pragmatic competencies. Qualitative and quantitative analysis revealed ambiguities in items construction. Disagreement between experts was solved through item modification. The pilot study showed that the instrument presented internal consistency and temporal stability. Significant differences between adults who stutter and controls and different response profiles revealed the instrument’s underlying construct. Conclusion: The instrument is reliable and presented evidences of construct validity.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Development of the phonological awareness stimulation programme (PECF) - Digital version",
        "doc_scopus_id": "85070098725",
        "doc_doi": "10.23919/CISTI.2019.8760963",
        "doc_eid": "2-s2.0-85070098725",
        "doc_date": "2019-06-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Networks and Communications",
                "area_abbreviation": "COMP",
                "area_code": "1705"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            }
        ],
        "doc_keywords": [
            "Digital",
            "Games",
            "Phonological awareness",
            "Preschool",
            "Speech and language therapy",
            "Stimulation Programmes"
        ],
        "doc_abstract": "© 2019 AISTI.In Portugal there are few digital programmes tested and validated to stimulate Phonological Awareness (PA). The Phonological Awareness Stimulation Programme (PECF) was recently developed and validated for European Portuguese (EP). This tool allows that different professionals (e.g. speech and language therapists, kindergarten teachers, teachers and psychologists) work on PA with pre-school age and early school age children. The PECF consists of a tabletop version and a digital version. This study presents the developmental process of the PECF digital version. As future work, a randomized controlled study will be carried out and the comparison between the tabletop version and the digital one will be analyzed.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Validation of a Paediatric Speech and Language Screening (RALF)",
        "doc_scopus_id": "85032364193",
        "doc_doi": "10.1159/000479928",
        "doc_eid": "2-s2.0-85032364193",
        "doc_date": "2017-12-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Language and Linguistics",
                "area_abbreviation": "ARTS",
                "area_code": "1203"
            },
            {
                "area_name": "Linguistics and Language",
                "area_abbreviation": "SOCI",
                "area_code": "3310"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            },
            {
                "area_name": "LPN and LVN",
                "area_abbreviation": "NURS",
                "area_code": "2912"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© 2017 S. Karger AG, Basel.Background/Aims: This study aims to analyse psychometric characteristics of the Portuguese Paediatric Speech and Language Screening (RALF) test. Methods: 202 Portuguese children aged 3; 0-5; 11 were recruited from 4 kindergartens participating in this study. Reliability and validity (sensitivity and specificity) data were obtained and analysed. Results: Content validity, analysed by an expert panel (general practitioner, kindergarten, teacher, nurse, and speech and language pathologist) revealed that the items were representative and relevant for the content the instrument intends to measure. Sensitivity values were 95, 96, and 83% and specificity values were 85, 84, and 71% for the age groups 3; 0-3; 11, 4; 0-4; 11, and 5; 0-5; 11, respectively. Internal consistency, calculated through Cronbach's alpha, was 0.7, 0.8, and 0.7, respectively. The inter-judge reliability (interclass correlation coefficient) was 0.951. The results ensure the content validity of RALF. Sensitivity and specificity values revealed that RALF could discriminate typical from disordered speech-language developing children. RALF also presented good internal consistency and excellent reliability. Conclusion: RALF is a reliable and valid screening instrument that health and educational professionals can use in Portuguese children to identify children who may need a speech-language diagnosis for consideration or referral to speech therapy services.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Speech and language therapy service delivery: overcoming limited provision for children",
        "doc_scopus_id": "85023634421",
        "doc_doi": "10.1016/j.puhe.2017.06.013",
        "doc_eid": "2-s2.0-85023634421",
        "doc_date": "2017-10-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Public Health, Environmental and Occupational Health",
                "area_abbreviation": "MEDI",
                "area_code": "2739"
            }
        ],
        "doc_keywords": [
            "Child",
            "Child Health Services",
            "Child, Preschool",
            "Delivery of Health Care",
            "Feasibility Studies",
            "Humans",
            "Language Therapy",
            "Models, Organizational",
            "Organizational Case Studies",
            "Outcome Assessment (Health Care)",
            "Portugal",
            "School Health Services",
            "Speech Therapy"
        ],
        "doc_abstract": "© 2017 The Royal Society for Public HealthObjectives To test an alternative Speech and Language Therapy (SLT) service delivery model based on partnerships between a University and local schools and charities, and to report on the impact and feasibility of intervention based on long-term outcome measures and three case studies with individual analysis of Reliable Change. Study design The following six-step model was tested: 1—establishing partnerships; 2—flagging children; 3—pre-treatment SLT assessment; 4—reporting and discussion with parents and teachers; 5—treatment; 6—post-treatment assessment. Case studies are presented. Methods A partnership was established with one kindergarten in a pre-test and a total of 25 kindergartens during the second phase of the process. A group of 139 children were then flagged and assessed. The following long-term outcomes (18 months post-therapy) were investigated: phonetic-phonological standardised test percentiles and raw scores; receptive and expressive language percentiles and raw scores according to a standardised language test; percentage of syllables stuttered; duration of stuttering moments; academic achievement in norm-tests’ core areas (mathematics, Portuguese language and social studies). Case studies and a 95% credible interval analysis to assess Reliable Change are presented. Results Seventy five (54%) children needed SLT support. Fifty (67%) of those children returned to the clinic for long-term assessments and the analysis of all outcome measures showed significant improvements in their performance, 18 months post-therapy. Case Studies Reliable Change analysis revealed a statistically significant improvement, which also clearly shows the feasibility and the positive impact of the intervention. Conclusions This specialised and differentiated care network constitutes an alternative delivery system of SLT services that addresses the lack of support currently experienced by children and their families. The long-term outcome measures and the 95% credible interval analysis are reliable methods to determine the impact of interventions.",
        "available": true,
        "clean_text": "serial JL 272854 291210 291823 291904 291910 31 Public Health PUBLICHEALTH 2017-07-12 2017-07-12 2017-07-12 2017-07-12 2017-09-21T14:43:33 S0033-3506(17)30216-0 S0033350617302160 10.1016/j.puhe.2017.06.013 S300 S300.1 FULL-TEXT 2021-04-05T12:05:41.265025Z 0 0 20171001 20171031 2017 2017-07-12T23:53:13.026914Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist yearnav figure body affil articletitle auth authfirstini authfull authkeywords authlast grantsponsor grantsponsorid highlightsabst orcid primabst pubtype ref 0033-3506 00333506 true 151 151 C Volume 151 6 39 50 39 50 201710 October 2017 2017-10-01 2017-10-31 2017 Original Research article fla © 2017 The Royal Society for Public Health. Published by Elsevier Ltd. All rights reserved. SPEECHLANGUAGETHERAPYSERVICEDELIVERYOVERCOMINGLIMITEDPROVISIONFORCHILDREN JESUS L Introduction Guidelines for service quality assurance Aims Method Establishing partnerships Flagging children Assessment Reporting and discussion with caregivers and teachers Treatment and post-treatment assessment Case studies Ninety-five percent credible intervals Results Service delivery Case studies SSD—case study 1 DLD—case study 2 FD—case study 3 Discussion Conclusions Author statements Acknowledgments Ethical approval Funding Competing interests References LAW 2000 165 188 J MCLEOD 2009 1213 1229 S BEITCHMAN 1986 98 110 J TOMBLIN 1997 1245 1260 J MCQUISTON 2011 230 238 S PINBOROUGHZIMMERMAN 2007 359 367 J NWOSU 2015 130 133 N JACOBY 2002 370 380 G BRYAN 2008 K MEETINGSPEECHLANGUAGECOMMUNICATIONNEEDSVULNERABLEYOUNGPEOPLEMODELSERVICEDELIVERYFORRISKOFFENDINGREOFFENDING GUYER 2009 142 149 B AMERICANSPEECHLANGUAGEHEARINGASSOCIATION 2015 BUDGETCUTSMAINTAININGSPEECHLANGUAGEPATHOLOGYAUDIOLOGYSERVICESINSCHOOLS MELINE 2010 1 14 T ASPEECHLANGUAGEPATHOLOGISTSDILEMMABESTCHOICEFORSERVICEDELIVERYINSCHOOLSEBPBRIEFS HARULOW 2013 12 15 S GRACIO 2014 A POLITICASPUBLICASDEEDUCACAOESPECIAL MINISTERIODAEDUCACAO 2008 154 164 WILLOUGHBY 2016 657 664 K LINDSAY 2005 329 345 G MOOSS 2015 57 64 A GASCOIGNE 2006 M SUPPORTINGCHILDRENSPEECHLANGUAGECOMMUNICATIONNEEDSWITHININTEGRATEDCHILDRENSSERVICES STANDINGLIAISONCOMMITTEEOFEUSPEECHANDLANGUAGETHERAPISTSANDLOGOPEDISTSCPLOL 2009 AFRAMEWORKFORETHICALPRACTICEINSPEECHLANGUAGETHERAPY AMERICANSPEECHLANGUAGEHEARINGASSOCIATION 2004 PREFERREDPRACTICEPATTERNSFORPROFESSIONSPEECHLANGUAGEPATHOLOGY AMERICANSPEECHLANGUAGEHEARINGASSOCIATION 1999 GUIDELINESFORROLESRESPONSIBILITIESSCHOOLBASEDSPEECHLANGUAGEPATHOLOGIST AMERICANSPEECHLANGUAGEHEARINGASSOCIATION 2008 2008SCHOOLSSURVEYCASELOADCHARACTERISTICS MCGINTY 2006 1 30 A THRONEBURG 2000 10 20 R WILCOX 1991 49 60 M WORLDHEALTHORGANIZATION 2001 ICFINTERNATIONALCLASSIFICATIONFUNCTIONINGDISABILITYHEALTH MORGAN 2009 D SINLGECASERESEARCHMETHODSFORBEHAVIORALHEALTHSCIENCES FERGUSON 2009 A RESEARCHINGCOMMUNICATIONDISORDERS UNICOMB 2016 728 739 R YIN 2009 R CASESTUDYRESEARCHDESIGNMETHODS JESUS 2015 57 60 L PROCEEDINGS10THIBERIANCONFERENCEINFORMATIONSYSTEMSTECHNOLOGIES TABLETABLETT2TTHERAPYSOFTWAREDEVELOPMENTAPPROACH JESUS 2016 85 L PROCEEDINGS30THWORLDCONGRESSINTERNATIONALASSOCIATIONLOGOPEDICSPHONIATRICS EXPLORINGVIEWSSERVICEUSERSANOVELINTERVENTIONFORCHILDRENSPEECHSOUNDDISORDERSDESIGNPRETESTING JESUS 2016 230 L PROCEEDINGSAMERICANSPEECHLANGUAGEHEARINGASSOCIATIONCONVENTION2016 EFFECTIVENESSTWOMETHODSPHONOLOGICALINTERVENTIONSFORSPEECHSOUNDDISORDERSTABLETOPTABLET LOUSADA 2012 151 156 M MENDES 2013 A MENDES 2014 89 94 A GUIMARAES 1995 I PROTOCOLODEAVALIACAOOROFACIAL YARUSS 2006 90 115 J LOUSADA 2013 172 187 M GILLON 2007 G INTEGRATEDPHONOLOGICALAWARENESSINTERVENTIONPROGRAMFORPRESCHOOLCHILDRENSPEECHLANGUAGEIMPAIRMENT HODSON 1991 B TARGETINGINTELLIGIBLESPEECHAPHONOLOGICALAPPROACHREMEDIATION LANCASTER 2008 G DEVELOPINGSPEECHLANGUAGESKILLS AGRESTI 2005 515 523 A SANDLER 2001 192 195 A JESUS 2010 L PROTOCOLODEANAMNESEDELINGUAGEMNACRIANCADAUNIVERSIDADEDEAVEIRO MENDES 2014 A OWENS 2011 R LANGUAGEDEVELOPMENTINTRODUCTION PAUL 2012 R LANGUAGEDISORDERSINFANCYTHROUGHADOLESCENCELISTENINGSPEAKINGREADINGWRITINGCOMMUNICATING GUITAR 2014 B STUTTERINGINTEGRATEDAPPROACHNATURETREATMENT BROWN 2015 1 8 C SNOWLING 2001 173 183 M GARDNER 2006 513 540 H BOTTING 2006 77 98 N 2012 EDUCACAOSOFREOMAIORCORTEDESDEO25DEABRIL 2016 QUERREPORAPOIODEEDUCACAOESPECIALPARAMILHARESDEALUNOS 2016 DIMINUICAONUMERODEALUNOSPORTURMAEPROMOCAOSUCESSOESCOLARPROJETODERESOLUCAONO181XIII1A ROSA 2013 E CORTESSIGNIFICATIVOSNADESPESAPUBLICACOMAEDUCACAOCIENCIAEENSINOSUPERIORNOPERIODO20112013 ROSA 2016 E NOPERIODO20012016OESTADOFINANCIOUOENSINOPRIVADOCOM44644MILHOESEOSPRIVADOSQUEREMMAIS POPOVA 2014 571 581 S CROSBIE 2005 467 491 S DODD 2002 B DIAGNOSTICEVALUATIONARTICULATIONPHONOLOGY YAIRI 2005 E EARLYCHILDHOODSTUTTERINGFORCLINICIANSBYCLINICIANS JESUSX2017X39 JESUSX2017X39X50 JESUSX2017X39XL JESUSX2017X39X50XL 2018-07-12T00:00:00.000Z UnderEmbargo © 2017 The Royal Society for Public Health. Published by Elsevier Ltd. All rights reserved. 2021-03-25T17:46:01.121Z Calouste Gulbenkian Foundation Fundação Calouste Gulbenkian This project has been partially funded by Calouste Gulbenkian Foundation, Portugal. item S0033-3506(17)30216-0 S0033350617302160 10.1016/j.puhe.2017.06.013 272854 2017-09-21T18:47:59.008713-04:00 2017-10-01 2017-10-31 true 914750 MAIN 12 45550 849 656 IMAGE-WEB-PDF 1 gr4 10890 137 219 gr5 10757 131 219 gr2 9693 95 219 gr3 10332 139 219 gr1 7563 35 219 gr6 10558 132 219 gr4 41090 334 535 gr5 41332 321 535 gr2 30175 160 367 gr3 38727 339 535 gr1 25079 92 581 gr6 40294 322 535 gr4 208077 1480 2370 gr5 209329 1420 2370 gr2 130049 709 1627 gr3 198579 1503 2370 gr1 113894 406 2571 gr6 205406 1427 2370 PUHE 2965 S0033-3506(17)30216-0 10.1016/j.puhe.2017.06.013 The Royal Society for Public Health Fig. 1 The six-step process of the SLT service model. SLT, Speech and Language Therapy. Fig. 1 Fig. 2 Number of children flagged. DLD, developmental language disorder; FD, fluency disorder; SLT, speech and language therapy; SSD, speech sound disorders. Fig. 2 Fig. 3 Reliable Change index plot case study 1: speech sound disorders. PCC, percentage of consonants correct. Fig. 3 Fig. 4 Reliable Change index plot case study 2—expressive language: developmental language disorder. Fig. 4 Fig. 5 Reliable Change index plot case study 2—receptive language: developmental language disorder. Fig. 5 Fig. 6 Reliable Change index plot case study 3: fluency disorders. Fig. 6 Original Research Speech and language therapy service delivery: overcoming limited provision for children L.M.T. Jesus a ∗ J. Martinez b A.R. Valente c M.C. Costa d a School of Health Sciences (ESSUA) and Institute of Electronics and Informatics Engineering of Aveiro (IEETA), University of Aveiro, 3810-193 Aveiro, Portugal School of Health Sciences (ESSUA) and Institute of Electronics and Informatics Engineering of Aveiro (IEETA) University of Aveiro Aveiro 3810-193 Portugal b Institute of Electronics and Informatics Engineering of Aveiro (IEETA), University of Aveiro, 3810-193 Aveiro, Portugal Institute of Electronics and Informatics Engineering of Aveiro (IEETA) University of Aveiro Aveiro 3810-193 Portugal c Institute of Electronics and Informatics Engineering of Aveiro (IEETA), University of Aveiro, 3810-193 Aveiro, Portugal Institute of Electronics and Informatics Engineering of Aveiro (IEETA) University of Aveiro Aveiro 3810-193 Portugal d Department of Mathematics (DMat) and Centre of Research and Development in Mathematics and Applications (CIDMA), University of Aveiro, 3810-193 Aveiro, Portugal Department of Mathematics (DMat) and Centre of Research and Development in Mathematics and Applications (CIDMA) University of Aveiro Aveiro 3810-193 Portugal ∗ Corresponding author. Objectives To test an alternative Speech and Language Therapy (SLT) service delivery model based on partnerships between a University and local schools and charities, and to report on the impact and feasibility of intervention based on long-term outcome measures and three case studies with individual analysis of Reliable Change. Study design The following six-step model was tested: 1—establishing partnerships; 2—flagging children; 3—pre-treatment SLT assessment; 4—reporting and discussion with parents and teachers; 5—treatment; 6—post-treatment assessment. Case studies are presented. Methods A partnership was established with one kindergarten in a pre-test and a total of 25 kindergartens during the second phase of the process. A group of 139 children were then flagged and assessed. The following long-term outcomes (18 months post-therapy) were investigated: phonetic-phonological standardised test percentiles and raw scores; receptive and expressive language percentiles and raw scores according to a standardised language test; percentage of syllables stuttered; duration of stuttering moments; academic achievement in norm-tests’ core areas (mathematics, Portuguese language and social studies). Case studies and a 95% credible interval analysis to assess Reliable Change are presented. Results Seventy five (54%) children needed SLT support. Fifty (67%) of those children returned to the clinic for long-term assessments and the analysis of all outcome measures showed significant improvements in their performance, 18 months post-therapy. Case Studies Reliable Change analysis revealed a statistically significant improvement, which also clearly shows the feasibility and the positive impact of the intervention. Conclusions This specialised and differentiated care network constitutes an alternative delivery system of SLT services that addresses the lack of support currently experienced by children and their families. The long-term outcome measures and the 95% credible interval analysis are reliable methods to determine the impact of interventions. Keywords Service delivery Speech and language therapy School-based services Children Introduction Speech and language disorders have been reported to have a prevalence of 2–25% in children. 1–7 These disorders in children can adversely affect emotional, educational and occupational development. 8 If Speech and Language Therapy (SLT) can be provided at the earliest stage of development then these problems can be more easily remediated. 9,10 However, schools and public services have been facing, over the last years, a loss of funding to support the inclusion of speech and language therapists, which has had a negative impact in these services. 11 Difficult economic times place an exceptional burden on schools and public services to deliver the best education with fewer resources. 11–13 These particular circumstances have a significant impact in small and fragile economies of countries such as Portugal, severely limiting the access to SLT in schools and public services. Currently, speech and language therapists often work with clients/families facing multiple complex communication problems and requiring social assistance who, regardless of their urgent needs, can not have access to support in overcoming difficulties that most likely will create subsequent complications. If speech and language therapist intervention is not provided, then the risk is that communication difficulties become more severe and pervasive and may require more complex interventions. 9 The specific legislation in countries such as Portugal, excludes a considerable number of children who need special support, so it is not possible to give adequate educative responses to these children because of legal limitations. 14 This legislation states that children with permanent special needs should have access to adequate educational responses. However, in reality only deaf, blind and autistic children, as well as children with cerebral palsy and other neuro-development disorders, are actually considered. 15 All the other children who do not have a diagnosis of permanent special need have a reduced chance of support by public services. Children with language, speech and/or communication difficulties are often part of this group that cannot have access to specialised support. Some of these children are treated in private practices but there are a large number of parents with economic difficulties who cannot provide their children with much needed care. This lack of support may lead to the accumulation of difficulties (that could be overcome if intervention was given), turning them into chronic alterations, and this can also lead to developmental disadvantage, poor social skills, behavioural problems, emotional difficulties, literacy disadvantage, and mental illness. 9,14 This can also reduce the chance of successful treatment and result in many children not completing or not having treatment before they start school. When this happens, children may access a new learning environment with an undiagnosed and untreated disorder. This often hinders academic performance and educational progression. 8,16 This calls for new ways of providing support to children who otherwise would not have adequate responses to their problems. A common approach to meet the children's needs has been the provision of treatment by private units associated with mainstream schools. 17 To establish new ways of providing support, it is important to create a well-structured design scheme. Breaking down service delivery programs structure into their components is very helpful for examining the inputs and resources that are needed to implement them. 18 Alongside this, the opportunity to develop new roles across traditional professional and agency boundaries must be exploited. 19 Guidelines for service quality assurance Children's SLT services should follow specific international guidelines. 19–21 The assessments can be conducted in a clinical or educational setting and/or other natural environment conducive to eliciting representative samples of children's speech language and communication abilities. The assessment should be based in standardised and informal tests that allow the evaluation of speech, language, orofacial myofunction, and communication. After assessment it is important to produce a report and the resulting information should be conveyed to the teacher and the caregiver. The report should include screening results, and recommendations, indicating the need for rescreening, assessment, or for a referral. 19–21 After the assessment and report, the next step should be the intervention. The intervention and consultation services should be provided when there is a reasonable expectation of benefit to the child in body structure/function and/or activity/participation, and the services should be based on the best available scientific and clinical evidence in conjunction with individual considerations. 19–21 Treatment may be conducted in a variety of settings, including homes, day care centres, clinics, and schools that are selected on the basis of intervention goals and in consideration of natural contexts for the child. 21 The American Speech-Language-Hearing Association 22 has previously described various options for SLT service delivery methods - the pull-out method being the most prevalent option: children are provided with one-to-one or a small group therapy sessions in an independent room environment. 23–26 The caregivers should be encouraged to be present during intervention sessions because training of others, including parents, should be viewed as a central activity for speech and language therapists to maximise the impact to the child and his/her family. 19 In any setting, intervention should be family centred, developmentally supportive, culturally appropriate and should address the personal and environmental factors that are barriers to or facilitators of children's communication. 19,21,27 Follow-up procedures are used to complete or supplement an assessment, monitor progress during intervention and/or determine status after screening, assessment, intervention or discharge. 21 The best practices described above should be the basis of a service delivery model, so it is very important to ensure that the right resources and conditions are in place when implementing these practices. This can be found at the University of Aveiro (UA), in Portugal, where an alternative SLT service delivery model has been developed, to overcome a generalised limited provision for children. At the UA, parents and teachers find a specialised team of speech and language therapists who can cover a wide range of areas. This team is able to provide care based on current best clinical practice guidelines. Furthermore, the clinic at the Speech, Language and Hearing Laboratory (SLHlab), is very well adapted to speech and language therapists', audiologists', psychologists', parents' and children's needs, which facilitates assessment and treatment. This represents an added value and has allowed clinicians to support local children who would not have access to SLT treatment in other ways. Unfortunately, there are no program delivery guidelines for organising or implementing speech-language and hearing services. 12 The aim of this article was to explore and provide new insights into the possibility of constructing an alternative delivery system of SLT services to address the problem presented above and to discuss how to ensure the best practices. We present here an approach that was able to respond to the needs of children as an alternative service delivery model based in partnerships between the UA and local schools. This model intends to be an alternative to the lack of support experienced by the children with language, speech and/or communication disorders (children without permanent special needs) that were not covered by public legislation as priorities for service delivery. The article first describes the methodology used to establish a new way of providing SLT support to children in pre-school and school aged children. The percentage of children flagged and in need of support, long-term outcomes designed to reveal if the therapy delivered has lasting effects and three case studies are presented and discussed. These three case studies are representative of the main intervention areas that had a major incidence in this sample. Case studies allow a careful and detailed observation, they are suitable for preliminary research and during the development of new assessment and intervention programs. 28 Case studies present a great value because many communication disorders are heterogeneous in nature. 29 In general, case studies present several advantages as close observation of individual changes over time, are cost-effective and positive results are enough to guarantee the need for more experimental investigation with larger samples. 30 However analysis of case studies commonly relies on visualising some aspects of the data and formal statistical approaches (normally relying on the use of continuous data) may not be the best option in these cases. Case study designs can be criticised for being less rigorous and statistically robust. 31 The determination of statistically significant change in outcome measures is thus very important for research. One method of measuring the statistical significance of individual change is to analyse the 95% credible intervals (CI) 30 as used in this study. Aims This study aims to present and describe a methodology of SLT service delivery to diminish the gap between the number of children in need of support and the number of children who actually receive this support. This methodology was implemented in Portugal but the same gap between the number of children in need and children receiving support is experienced in many other countries. Method The study was carried out at the University of Aveiro in Portugal. It was developed as part of a project where digital materials for speech and language therapists to work with children with Speech Sound Disorders (SSD) were validated. 32–34 This project's team included a speech and language therapist who was able to implement the method described below. Furthermore, another speech and language therapist (a funded Ph.D. student) also participated in the provision of services. This fact allowed the implementation of a free support system for children and for kindergartens/schools. This service targeted mainly children in pre-school and primary school age (with some exceptions regarding children and adolescents referred by external speech and language therapists). To our best knowledge, there is no similar service delivery established between a university, with a SLT team with different specialisation areas, and schools in Portugal, where children with speech and language difficulties could benefit from free therapy; for that reason, outcomes need to be analysed to assess the feasibility of the proposed service delivery model. Those outcomes and conclusions could be widespread, to support a similar implementation, financed by regional administrations. This service delivery incorporated the six step procedure described in Fig. 1 , based on the best practices described above. Establishing partnerships The first step to establish partnerships was to identify the schools and institutions in the Aveiro region that could benefit from SLT support. A list of contacts of every school and institution that did not have internal speech and language therapists or that was not covered by national public services was made. A total of 30 schools were contacted and a meeting was held (where the project was explained) with the heads of institutions that replied (a total of 25). The project had good acceptability; all the schools and institutions that replied to the first contact established by the research team accepted to participate and showed enthusiasm regarding the project, mainly because this was the only way that some children (with economic difficulties) could have free support. After the first meeting, the research team started the project implementation that included a second meeting with the teachers to explain the project in more detail and directly to them, to answer questions and to ask them to flag the children who they thought presented difficulties in speech perception/production and language development. Flagging children During the initial meeting, the research team provided the teachers with information related to normal linguistic development and characteristics of communication impairments. The school teachers were asked to flag any child who they considered as being in need of SLT support, based on the information gathered on the initial meeting. After the identification of the children, an informed consent was sent to the parents of the flagged children. If the parents consented, it was handed back to the school teachers who forwarded them to the research team. Although the main way of flagging was by the process described above, some children reached the service by flagging of external speech and language therapists and parents. Assessment Every flagged child was then assessed by a certified Speech and Language Therapist, at three specific time-points: Pre-intervention, one week post-intervention (reported in case studies) and 18 months post-intervention (reported for all of those children who returned to the clinic for post-intervention long-term assessments). The assessments were based in standardised and informal tests that allowed the evaluation of speech, language, orofacial myofunction, fluency and communication according to the needs of the child flagged. Related to language, the TL-ALPE, 37,47 a norm-referenced instrument, was used to assess the comprehensive and oral expressive language (semantics and morphosyntax). The TL-ALPE presents content validity, construct validity, criterion validity and inter- and intra-judge reliability. The TFF-ALPE 35,36 was the norm-referenced test used to assess the verbal articulation and type and percentage of occurrence of phonological processes. Inter- and intra-judge validity, content and construct validity were assured. To assess the oro-motor function of face, lips, jaw, teeth, tongue and palate, the PAOF test 38 was used. Related to fluency, spontaneous speech samples were collected and assessed in terms of stuttering severity. In addition, the impact of stuttering in quality of life was assessed through the administration of the Overall Assessment of the Speaker's Experience of Stuttering questionnaire. 39 The assessment process was audio-recorded using a Behringer ECM8000 microphone located 1 m from the mouth of the children. The microphone was connected to an Olympus LS-100 recorder. The assessments took place in two distinct environments: The SLHlab clinic at the UA; the children's schools. Children were diagnosed based on several parameters. For SSD, inclusion criteria were: no alterations on oro-motor structure and function (assessed with the PAOF); 38 no symptoms of verbal dyspraxia; normal receptive language assessed with the TL-ALPE; 47 presenting at least two phonological processes. 61,62 Children were diagnosed with developmental language disorder (DLD) if language scores were below −1.5 SD the mean of TL-ALPE and in the absence of another condition such as hearing impairment, emotional or behavioural difficulties, autism, neurological impairment or general developmental difficulties. Children with Fluency Disorders (FD) were signalled when they presented a minimum frequency of stuttering-like disfluencies (i.e. sounds, syllables or one syllable words repetition; prolongations of sounds or blocks of airflow or voicing in speech) of three per 100 syllables; greater than average duration, effort, and tension of stuttering-like disfluencies and concerned about fluency disruption. 63 In addition to the assessment instruments described above, which are specific to the field of SLT, the two speech and language therapists also collected information concerning academic activities. Academic activities should be part of a comprehensive assessment and refer to general school experiences. Data collected at school settings provide data that are useful to analyse functional communication abilities. The collection of information concerning academic activities could be made through systematic observation (i.e. observation of school performance) or measurement (i.e. school performance or academic achievement in norm-tests). In the therapy delivery service implemented, the speech and language therapists collected data through systematic observation of children's speech and language during oral activities in school environment, kindergarten teachers' feedback and academic achievement in norm-tests for those children in primary school at 18 months post-therapy. In Portuguese primary schools, academic achievement is assessed in three core areas (mathematics, primary language and social studies), and results reported using the following assignment of test scores to qualitative descriptors: 0–49% not good enough (insuficiente); 50–69% good enough (suficiente); 70–89% good (bom); 90–100% very good (muito bom). All participants in this study were in kindergarten at pre-intervention assessment, where, in Portugal, academic achievement is not assessed with norm-tests. We therefore only presented academic results for children who were enrolled in primary school at the time of assessment. Reporting and discussion with caregivers and teachers After the SLT assessment, a report was made for each child and the results were communicated to the teachers and parents/caregivers. The report included screening results and recommendations, indicating the need for rescreening, assessment, or for a referral. Children were excluded from the study if they presented an adequate linguistic development for their age group or referred to SLT treatment if they presented alterations that were inclusion criteria for any of the communication disorders referred above. Treatment and post-treatment assessment After the report was given to caregivers and teachers, 75 children benefited from individualised intervention services that were provided at the clinic or their schools when they were not able to travel to the clinic. The children were provided with one-to-one therapy sessions in an independent room environment. When possible, the caregivers were encouraged to be present during the intervention. Due to the complexity of each disorder and the variability within each child, the intervention procedures must comprise different intervention methods to fully respond to the children's needs. Therefore, the intervention strategies were based on several evidence-based approaches. Concerning SSD intervention, a phonologically based intervention was used. It consisted of a combination of phonological awareness activities 40 adapted from Gillon and McNeill's 41 phonological awareness programme, as well as Hodson & Paden's 42 auditory bombardment and discrimination and listening tasks from Lancaster. 43 Related to DLD, several forms of a hybrid approach were used, that is, specific language goals were considered for intervention, based on the assessment process. The activities and materials were selected by the clinician to consciously elicit the spontaneous use of the language skills targeted by the intervention plan objectives 49 . General methods of modelling, imitation and reinforcement to develop learning and language skills were also used. 48,49 Related to intervention on stuttering, the eclectic methodology approach developed by Guitar 50 was used. Identification, desensitisation, learning of fluency skills and generalisation were the phases of the intervention approach used. 50 After a period of intervention, a short-term follow-up assessment (one week post-intervention) was performed to monitor progress and to determine the need of further treatment or discharge. All 75 children who benefited from individualised intervention were targeted for a long-term follow-up assessment 18 months post-intervention. Two certified speech and language therapists, blind to the purposes of the study, were involved. They first contacted the caregiver to schedule an assessment session. During the follow-up session, the assessment procedures and instruments applied were similar to those used in the pre-treatment session and included (when available) the collection of information related to academic progress and achievements. More specifically, the following long-term outcomes were investigated: phonetic-phonological standardised test percentiles and raw scores; receptive and expressive language percentiles and raw scores according to a standardised language test; percentage of syllables stuttered; duration of stuttering moments; academic achievement in norm-tests’ core areas (mathematics, Portuguese language and social studies). For comparison purposes, during post-intervention assessment, children who were above the maximum age band (only 26% of the total number of children) on both the TFF-ALPE and TL-ALPE, were compared with the maximum age band available. Therefore, raw score data for the TFF-ALPE phonetic/production subtest were also provided for reference. IBM SPSS Statistics 22 was used to perform a non-parametric paired-sample analysis through the Wilcoxon-signed ranks test to compare several long-term outcomes before and after the intervention considered in this article. A pre-test of this model was conducted in one kindergarten. The methodology used was similar to those presented on each phase. It was concluded that the methodology was feasible to be generalised to a larger sample of 25 schools and kindergartens in the Aveiro region. Case studies The case studies represent ‘an empirical enquiry that investigates a contemporary phenomenon in-depth and within its real-life context’. 31 In the three cases, a summary of the patient clinical history and referral process, the assessment procedures, the setting where the intervention took place, details about the intervention and the patients progress based on pre- and post-intervention outcome measures, are presented. The first case study refers to a child with SSD, where an intervention based on phonological awareness activities was employed. The second case study refers to a child with DLD and the third case study describes an intervention with an adolescent who stutters. Those individuals were chosen since they represent the three main intervention groups in the sample, i.e. SSD, DLD and FD. The presented cases were selected using a random procedure within each group. The outcome measures are specific to each case study. Ninety-five percent credible intervals To address whether the observed changes in the case studies presented can be considered statistically significant (i.e. whether the intervention provided using this service delivery program was effective), the 95% credible intervals (CI) for the difference in proportions were constructed according to the methodology described in Unicomb et al. 30 The binomial distribution was taken as the underlying statistical model as it is a discrete distribution that is applicable whenever a fixed number of trials, n, is considered, for which there are only two possible outcomes: The success with probability p and the failure with probability 1−p. The trials are independent of each other and one is focused in counting the number of successful events in the total number of trials. In case study 1 (SSD), for instance, n represents the total number of consonants, x is the number of correct consonants and p = x/n is the proportion of correct consonants. With the 95% CI for the difference in two proportions, it is possible to test if the difference between pre- and post-treatment scores can be considered statistically significant. The same pre- and post-treatment analysis can be established for case studies 2 (DLD) and 3 (FD), where the outcome measures are also binary categories and the binomial distribution is applicable. The 95% CI for the difference in pre- and post-treatment proportions were constructed according to the Bayesian approach proposed in Agresti and Min. 44 These authors refer to the 95% CI for the difference as Bayesian confidence intervals because a 100(1 − α)% interval is obtained for a parameter, choosing the 100(α/2)% and 100(1 − α/2)% percentiles of the posterior distribution for the parameter. In this sense, a Bayesian confidence interval is a region that has posterior probability equal to the desired confidence level. The values for the posterior distribution were randomly generated using Markov Chain Monte Carlo methods. All computations were done with the free software R version 3.3.1., using the code provided by Unicomb et al. 30 To ascertain whether the difference between each individual in the case studies' pre- and post-treatment scores is statistically significant, one has to inspect the 95% CI for the difference and see if the interval does not contain the zero value. If it does not, then there has been a reliable change at the 0.05 significance level. To visually assess the significance, the CI were plotted using Microsoft Excel 2013. For each case study, a scatter plot was created representing pre- and post-treatment proportions against each other, together with a reference line of no change. Data points thus represent pre- and post-treatment proportions for each individual in each case study. The upper and lower 95% CI were used to draw the error bars to visually ascertain the level of uncertainty in the difference in pre- and post-treatment proportions. 30 Results Service delivery During the pre-test phase of the project, the teachers from one kindergarten (Jardim de Infância de Santiago in Aveiro) flagged 20 children (20% of the total number of children in that particular kindergarten), with eleven (11/20 = 55%) children needing intervention and nine (9/20 = 45%) not presenting relevant alterations for their age. These nine children showed signs that were deviant from normal development but did not need/justify SLT support, e.g. some children presented phonological processes, but these were considered normal for their age group. All teachers and parents reviewed (with the Speech and Language Therapist) their children's individual reports. Two additional cases from this kindergarten were referred to the UA team by external speech and language therapists and parents. The majority of the children in need of SLT had speech and/or language disorders, having then access to intervention based on proven methodologies according to their needs. In the larger study, the research team established partnerships with a group of 25 kindergartens and schools from the Aveiro region. In this second stage of the project, a group of 128 children were flagged by their teachers. In addition, a group of 11 children were referred by external speech and language therapists and parents mainly due to the specific expertise of the SLT team and mouth-to-mouth publicity about the service creation. The total number of children included in the larger study group was 139, as shown in Fig. 2 . The flagged children were assessed by a team of two speech and language therapists. As seen in Fig. 2, from the 139 children flagged, 46% (64 children) did not present relevant alterations for age, but still a report was made and shared with teachers and parents. The other 54% (75 children) needed SLT and the most common alterations in this group of children were SSD, DLD and FD. From the 75 children who presented alterations, 42 children presented SSD, 20 had DLD and 13 had FD. The results of the flagging processes were in line with screening literature that points a much less accurate estimate of child development when non-formal screening is used. 45 In general, the kindergarten teachers and/or parents reported that children had a low participation and difficulties in social communication and integration with peers. When needed, children were also evaluated by an audiologist, and by a psychologist to assess their non-verbal IQ. These assessments were possible due to the wide network of health professionals working within the UA. After the initial assessment, children entered an intervention program, delivered by the same team of two speech and language therapists. Concerning children with SSD, the average number of intervention sessions were 12, consisting of a phonological-based intervention. Each session had an average duration of 45 min; at the end of each session, the Speech and Language Therapist provided recommendations to parents or kindergarten teachers on how to potentiate the benefits of the therapeutic intervention (e.g. through homework). The specific goals for intervention in children with DLD were reached after an average of 20 sessions with a mean duration of 45 min each. The parents were encouraged to participate in every therapeutic session, to maximise the therapeutic gains. The stuttering intervention processes consisted of four phases, with an average of four sessions per phase. Specifically, related to children who stutter, family interaction patterns were also the focus of intervention to facilitate the child's fluency. Teachers and classroom peers were also involved in the treatment program to raise awareness towards stuttering. Long-term post-intervention assessment was used to monitor their progress in several aspects, including speech and language skills and academic activities. Concerning children with SSD, the percentage of return to assessment 18 months post-intervention was 76% (32/42), with a mean age of 57 months (standard deviation [SD] = 10 months) before intervention start. TFF-ALPE Phonetic subtest mean percentiles were pre 5.9 (SD = 4.0) and post 31.9 (SD = 19.9); TFF-ALPE Phonological subtest mean percentiles were pre 5.0 (SD = 3.4) and post 31.9 (SD = 14.8); TFF-ALPE Phonetic subtest mean raw scores were pre 49/90 = 54% (SD = 10%) and post 77/90 = 86% (SD = 10%). To compare the children's performance before and after the intervention period, the Wilcoxon-signed ranks (unilateral) test was used for all the variables considered. Regarding the percentiles of the TFF-ALPE phonetic and phonological subtests, the non-parametric approach was used since the normality tests rejected the null hypothesis of a normal population. In all other cases (DLD and FD groups), the non-parametric test was used due to the small sample sizes (DLD: N = 10; FD: N = 7). Significant differences between pre- and post-percentiles of the TFF-ALPE phonetic and phonological subtests were found (Z = −4.937, P = 0.000, effect size = 0.62 [large effect] for both the phonetic and phonological subtests). Note that although this study did not include a control group, the natural evolution of the children is taken into account since the percentiles were calculated considering the age group. Typically, developing children mature naturally and the percentiles described in TFF-ALPE incorporate this evolution (each child will tend to keep his percentile along time). Comparing percentiles from pre- to post-intervention moments can be used to detect a non-typical progress in the children's development. Post-intervention academic achievement of the 18 children with SSD that were enrolled in primary school was quite satisfactory: only one child was qualified as not performing ‘good enough’ (insuficiente); 33% of the children in mathematics, 28% in Portuguese language and 50% in social studies were classified as ‘very good’ (muito bom). Ten children (50%) with DLD returned to long-term assessment, with a mean age of 55 months (SD = 8 months) before intervention start. TL-ALPE mean receptive language percentiles were pre 19.7 (SD = 12.4) and post 46.7 (SD = 18.4); TL-ALPE mean expressive language percentiles were pre 9.0 (SD = 7.0) and post 34.5 (SD = 13.6); TL-ALPE mean receptive language raw scores were pre 34/49 = 70% (SD = 9%) and post 43/49 = 87% (SD = 5%); TL-ALPE mean expressive language raw scores were pre 34/76 = 45% (SD = 9%) and post 53/76 = 70% (SD = 6%). Regarding the percentiles of the TL-ALPE receptive and expressive subtests, significant differences were also found between the pre- and post-intervention values (Z = −2.803, P = 0.001, effect size = 0.63 [large effect] for both the receptive and expressive subtests). As for the TFF-ALPE, the natural evolution of the children's performance is taken into account by the fact that we are comparing percentiles, calculated for the appropriate age group at each moment. Only three out of 10 children with DLD assessed at 18 months post-intervention were enrolled in primary school but all with ‘good enough’ (suficiente) to ‘very good’ (muito bom) performance in all areas. Results from the pre-intervention assessment of children who stutter revealed a mean percentage of stuttered syllables of 8.3% (SD = 2.2%), and the presence of associated behaviours, mainly non-verbal (i.e. extremities movements). Mean duration of stuttering moments were 2.9 s (SD = 1.0 s). Feedback collected from teachers and parents revealed a low impact on academic achievements. However, one child stood out on their participation levels at school, due to the avoidance of communication moments. Some negative results were observed in measures of academic achievement that could be attributable to the stuttering impact. Eight out of the 13 (67%) children who stutter returned to post-intervention. All children presented less than 1% of stuttered syllables (mean = 0.6%; SD = 0.2%), a mean duration of stuttering moments lower than 2.0 s (mean = 1.9 s; SD = 1.0 s) and absence of associated behaviours at 18 months post-intervention. Feedback from teachers revealed that academic achievements were no longer impacted by the FD, and that an improvement was observed on fluency during speech activities (e.g. when describing, in class, their weekend activities or vacations), mainly on one child who presented avoidance on classroom participation before fluency intervention. The children who did not return to the long-term follow-up (18 months post-intervention) presented a low value (less than 1%) of stuttered syllables at the end of service delivery (one week post-intervention). Finally, both the percentage of stuttered syllables and the duration of stuttering moments also showed significant differences from pre- to post-intervention (Z = −2.366, P = 0.008, effect size = 0.63 [large effect] for both variables). In spite of the small sample size considered in the last two analysis performed (N = 10 and N = 7), the statistical tests and the large effect sizes obtained suggest that the intervention produced effective changes in the children's performance that would not have been achieved without it. Case studies The three case studies represent areas (SSD; DLD; FD) that are very common in the SLT clinic. Participants selected as case studies were randomly selected. For the SSD client, percentage of correct consonant and phonetic inventory is presented and for the child with DLD, the results of a standardised pre-school language test are reported. For the FD client, the results are presented in terms of percentage of syllable stuttered and the global impact in quality of life. SSD—case study 1 Participant: DB, a 4 years and 1 month-old male, was referred by his kindergarten teacher due to his low intelligibility of speech. Assessment: he was assessed in June 2015. Data related to the case history, collected using University of Aveiro's Case History Form for Child Language, 46 showed no relevant alterations. Further assessment included a phonetic-phonological test—TFF-ALPE; 36 a language test—TL-ALPE; 47 and an oro-motor abilities test—PAOF. 38 He showed normal expressive and receptive language for age and did not present oro-motor alterations. The child was also assessed by a psychologist and an audiologist to establish the diagnosis of SSD (with normal non-verbal IQ and normal hearing). Setting: a pull-out method was used and the child had one-to-one therapy sessions in SLHlab's clinical setting and the caregiver (mother) participated in all sessions (in some session his older brother was also present). Intervention: he then had 12 sessions of phonological-based intervention 34 centred in well-known methodologies. 40–43 The main phonological process targeted was the stopping of fricatives. Progress: DB presented a percentage of consonants correct (PCC) of 56% at pre-intervention that positively evolved to 76% after intervention. Results presented in Fig. 3 revealed that the change between pre- and post-intervention is statistically significant because the 95% CI bars do not cross the reference line. He added to his phonetic inventory the sounds [f, v, s, z, ʃ, ʒ, ɲ, ʀ]. An increase in his intelligibility was noticed and reported by his parents, teacher and peers. DLD—case study 2 Participant: TC, a 3 years and 11 months-old male, was flagged by his kindergarten teacher due to low expressive skills in comparison to his peers. Assessment: TC was assessed in September 2015. University of Aveiro's Case History Form for Child Language 46 was used, revealing no alterations from normal development. Further assessment also included: a phonetic-phonological test—TFF-ALPE; 36 a language test—TL-ALPE; 47 and an oro-motor abilities test—PAOF. 38 He showed alterations in receptive and expressive skills on the language test, on the phonetic-phonological test but no relevant alterations in oro-motor abilities. Setting: a pull-out method was used, and he had one-to-one therapy sessions in SLHlab's clinical setting and the caregiver (grandmother) was present in all sessions. Intervention: language intervention 48,49 over 20 sessions was then provided to the child. Progress: initially, the child showed very low communicative intent, preferring gestures rather than words. He was at percentile 14 in expressive language and percentile five in receptive language according to the TL-ALPE language test. TC presented a total of 32 correct answers in 76 possible for expressive language and a total of 30 correct answers in 49 possible regarding receptive language. After intervention, he improved his communicative intent, started to use more words than gestures and the language test scores evolved positively to percentile 23 in expressive language and percentile 84 in receptive language. He presented a total of 40 correct answers in 76 possible for expressive language and a total of 45 correct answers in 49 possible for the receptive language. Results presented in Fig. 4 revealed that the change between pre- and post-intervention is not statistically significant for expressive language, because the 95% CI bars cross the reference line. Fig. 5 shows that the change between pre- and post-intervention is statistically significant for receptive language because the 95% CI bars do not cross the reference line. FD—case study 3 Participant: DV, a 17-year-old adolescent client who stutters was referred by an external Speech and Language Therapist due to the fact that one of the team's speech and language therapists has a clinical specialisation in FD. Assessment: DV was assessed in October 2015. Data related to the case history was collected using the ‘Stuttering Case History Form—Adolescent/Adult’. 50 To obtain a holistic comprehension of DV as a person who stutters, several methods were implemented during the assessment: collection of three different speech samples (to assess stuttering severity) and administration of the Overall Assessment of the Speaker's Experience of Stuttering questionnaire, 39 to assess the impact of stuttering in DV's quality of life. Setting: a pull-out method was used, and DV had one-to-one therapy sessions in SLHlab's clinical setting. Intervention: during 14 intervention sessions with DV, the integrated approach of Guitar 50 was followed. Progress: initially, DV presented a frequency of 3.4% of stuttered syllables, with a mean duration of 0.7 s and barely noticeable physical concomitants. The client presented mainly repetitions and audible prolongations. It was concluded that stuttering presented a moderate impact on DV. Post-assessment revealed that the percentage of syllable stuttered (%SS) decreased to 1.5% as well as the impact of stuttering on communication in daily situations and quality of life. Fig. 6 shows that the change between pre- and post-intervention is not statistically significant because the 95% CI bars cross the reference line. Discussion Results showed that the proposed service delivery model can facilitate the detection of children in need of SLT in pre-school and primary school years that do not have the access to adequate support at the moment. When young children start school with speech, language and/or communication needs, they carry a greater risk of developing problems in literacy and numeracy learning. 10,51–54 If language difficulties are resolved early, and oral skills continue to improve at the same rate with development, then school performance will be within the normal range. 52 As the number of children who start school with speech, language and/or communication needs is higher than is recommended due to cuts that schools are facing, 55–59 there are an increasing number of children is advancing in their school path with impairments that will affect their progression in personal and educational life. This will have an impact in their emotional, occupational and educational development that influences the children's quality of life. Early identification and intervention, through a feasible service delivery model may have a role in decreasing the risk of developing secondary disabilities and in reducing the economic burden of communicative impairments in society. 60 It was observed that teachers were aware of children's speech and language alterations, resulting in more than half of the children flagged having relevant alterations and being in need of immediate support. Even the 46% that did not have relevant alterations for their age showed some signs that were deviant from the normal development, but not sufficient to need support, i.e., they showed, for example, some phonological processes in their speech that were not present in most of their peers but these processes were considered normal for age. Some kindergarten teachers flagged these children because they were not sure if these alterations were normal or not. However, the accuracy of the flagging of children by teachers can still be increased if workshops and awareness campaigns are promoted in schools. Early identification and access to high quality services may have a role in decreasing the risk of developing secondary disabilities and in reducing the economic burden of communicative impairments in society. 60 The long-term outcomes investigated, reveal that the therapy delivered, appeared to have lasting effects. This has implications for SLT including reduced therapy times and defining a set of core outcomes. This impact was also exemplified for our service delivery model in the case studies (a similar analysis was implemented for all the cases treated within the project). Regarding case study 1 and 2—receptive language, the 95% CI for the difference in pre- and post-intervention scores were [10.15; 28.48] and [13.79; 44.86] respectively. These ranges do not include the zero value, which means that the increase in PCC and correct answers in the receptive language test are statistically significant. For case study 1, this result means that DB increased his correct production of consonants after intervention. For case study 2, the results showed that the intervention contributed to a significant increase in TC's number of correct answers which means that he improved his receptive language capacities. In terms of case study 2—expressive language and case study 3—the 95% CI for the difference in pre- and post-intervention proportions were [−5.33; 25.60] and [−4.03; 0.03], respectively. Both ranges include the zero value meaning that the change was not statistically significant. Regarding case study 2, the result was expected because the intervention focus was only on receptive language. In spite of the non-significance of change, TC showed some positive progress probably due to an indirect impact of the receptive language intervention. For case study 3, the results reveal some decrease in the %SS; however as the %SS in the first assessment moment was per se very low, it would be difficult to expect a larger change. Qualitatively, the intervention had a greater impact regarding DV's quality of life and attitude towards stuttering. Conclusions This specialised and differentiated care network can constitute an alternative delivery system of SLT services that address the lack of support experienced currently, meeting children's needs and minimising the burden of communication disorders. It is very likely that this will have an impact in literacy, reading and writing acquisition, promoting positive school outcomes that contribute to a better quality of life in children. It would be interesting to analyse this impact in a future longitudinal study assessing the children who participated and had intervention. Also an implementation of this model in a permanent way could benefit more children every year and contribute to close the gap between the number of children needing support and the ones that can have access to it. The use of the 95% CI analysis proved to be suitable for assessing the change in the used measures allowing the illustration of the impact of the intervention in the 3 case studies presented. This model can be seen as an alternative way of responding to the needs of children who are lacking support. In general, it can be concluded that the model can contribute to an increase in the quality of life of the treated children who otherwise would have no access to SLT support. The interventions were always based in well-known methodologies that had been shown previously to be effective. The implementation model can be seen as an available resource that allows the creation of links between kindergartens, schools and clinical population. As future work more research on how teacher-oriented workshops and awareness campaigns influence the accuracy of the flagging is suggested. It would also be interesting to explore the impact of this service delivery on later literacy acquisition. Author statements Acknowledgments The authors would like to thank all the children, parents, kindergartens and schools who participated. They would also like to thank Andreia Hall, Isabel Monteiro da Costa and Joana Alves. Ethical approval Ethical approval was obtained from all authorities required by Portuguese bylaws for clinical and educational research: National data protection committee; independent ethics committee; Ministry of Education. Informed consents were collected from all carers before any data collection. Funding This project has been partially funded by Calouste Gulbenkian Foundation, Portugal. Competing interests None declared. References 1 J. Law J. Boyle F. Harris A. Harkness C. Nye Prevalence and natural history of primary speech and language delay: findings from a recent systematic review of the literature Int J Lang Commun Disord 35 2000 165 188 2 S. McLeod L.J. Harrison Epidemiology of speech and language impairment in a nationally representative sample of 4- to 5-year-old children J Speech Lang Hear Res 52 5 2009 1213 1229 3 J. Beitchman R. Nair M. Clegg P. Patel Prevalence of speech and language disorders in 5-year-old kindergarten children in the Ottawa-Carleton region J Speech Hear Disord 51 1986 98 110 4 J. Tomblin N. Records P. Buckwalter X. Zhang E. Smith M. O'Brien Prevalence of specific language impairment in kindergarten children J Speech Lang Hear Res 40 6 1997 1245 1260 5 S. McQuiston N. Kloczko Speech and language development: monitoring process and problems Pediatr Rev 32 6 2011 230 238 6 J. Pinborough-Zimmerman R. Satterfield J. Miller D. Bilder S. Hossain W. McMahon Communication disorders: prevalence and comorbid intellectual disability, autism and emotional/behavioral disorders Am J Speech Lang Pathol 16 2007 359 367 7 N. Nwosu Systemic review of the prevalence of speech and language disorders in Nigeria Int J Humanit Soc Sci 5 5 2015 130 133 8 G. Jacoby L. Lee A. Kummer L. Levin The number of individual treatment units necessary to facilitate functional communication improvements in the speech and language of young children Am J Speech Language Pathol 11 2002 370 380 9 K. Bryan J. Mackenzie Meeting the speech language and communication needs of vulnerable young people – Model of service delivery for those at risk of offending and re-offending London 2008 10 B. Guyer S. Ma H. Grason K. Frick D. Perry A. Sharkey Early childhood health promotion and its life course health consequences Acad Pediatr 9 3 2009 142 149 11 American Speech-Language-Hearing Association Budget cuts: maintaining speech-language pathology and audiology services in schools 2015 12 T. Meline C. Kauffman F. Bender G. Daly C. Lang A. Mcginty A speech-language pathologist's dilemma: what is the best choice for service delivery in schools? EBP Briefs 2010 Pearson Bloomington: MN 1 14 13 S. Harulow Facing cuts? Keep calm and star negotiating Bull – Off Mag R Coll Speech Lang Ther February 2013 12 15 London 14 A. Grácio Políticas Públicas de Educação Especial 2014 Conselho Nacional de Educação (CNE) Lisboa 15 Ministério da Educação Decreto de Lei 3/2008 Diário República 1 4 2008 154 164 16 K.A. Willoughby B.T.B. Chan S. Marques Using simulation to test ideas for improving speech language pathology services Eur J Oper Res 252 2016 657 664 Elsevier B.V. 17 G. Lindsay J.E. Dockrell C. Mackie Local education authorities approaches to provision for children with specific speech and language difficulties in England and Wales Eur J Spec Needs Educ 20 3 2005 329 345 18 A. Mooss M. Hartman G. Ibanez Manual development: a strategy for identifying core components of integrated health programs Eval Program Plann 53 2015 57 64 19 M. Gascoigne Supporting children with speech, language and communication needs within integrated children's services RCSLT Position Paper: London 2006 20 Standing Liaison Committee of E.U. Speech and Language Therapists and Logopedists (CPLOL) A framework for ethical practice in speech and language therapy 2009 21 American Speech-Language-Hearing Association Preferred practice patterns for the profession of speech-language pathology [Preferred Practice Patterns] 2004 22 American Speech-Language-Hearing Association Guidelines for the roles and responsibilities of the school based speech-language pathologist 1999 23 American Speech-Language-Hearing Association 2008 Schools survey: caseload characteristics 2008 24 A.S. Mcginty L. Justice Classroom-based versus pull-out interventions: a review of the experimental evidence EBP Briefs 1 1 2006 1 30 25 R.N. Throneburg L.K. Calvert J.J. Sturm A.A. Paramboukas P.J. Paul A comparison of service delivery models: effects of curricular vocabulary skills in the school setting Am J Speech Lang Pathol 9 2000 10 20 26 M.J. Wilcox T.A. Kouri S.B. Caswell Early language intervention: a comparison of classroom and individual treatment Am J Speech Lang Pathol 1 1991 49 60 27 World Health Organization ICF: international classification of functioning, disability and health 2001 28 D. Morgan R. M Sinlge-case research methods for the behavioral and health sciences 2009 Sage Thousand Oaks, CA 29 A. Ferguson E. Armstrong Researching communication disorders 2009 Palgrave Macmillan New York 30 R. Unicomb K. Colyvas E. Harrison S. Hewat Assessment of reliable change using 95{%} credible intervals for the differences in proportions: a statistical analysis for case-study methodology J Speech Lang Hear Res 58 2016 728 739 31 R. Yin Case study research: design and methods 4th ed. 2009 Sage Thousand Oaks, CA 32 L. Jesus J. Santos J. Martinez M. Lousada D. Pape The table to tablet (T2T) therapy software development approach Proceedings of the 10th Iberian Conference on Information Systems and Technologies 2015 57 60 Águeda, Portugal 33 L. Jesus J. Martinez J. Santos V. Joffe Exploring the views of service users on a novel intervention for children with speech sound disorders: design and pretesting Proceedings of the 30th World Congress of the International Association of Logopedics and Phoniatrics 2016 85 Dublin, Ireland 34 L. Jesus J. Martinez J. Santos V. Joffe Effectiveness of two methods of phonological interventions for speech sound disorders: tabletop & tablet Proceedings of the American speech-Language-Hearing Association Convention 2016 2016 230 Philadelphia, USA 35 M. Lousada A. Mendes A. Valente A. Hall Standardization of a phonetic-phonological test for European Portuguese children Folia Phoniatr Logop 64 3 2012 151 156 36 A. Mendes E. Afonso M. Lousada F. Andrade Teste Fonético-Fonologico ALPE Aveiro Edubox 2013 37 A. Mendes M. Lousada A. Valente A. Hall Validity and reliability of the European-Portuguese preschool language assessment ALPE Folia Phoniatr Logop [Internet] 66 3 2014 Oct 17 89 94 38 I. Guimarães Protocolo de Avaliação Orofacial 1995 Fisiopraxis Lisboa 39 J. Yaruss R. Quesal Overall assessment of the speaker's experience of stuttering (OASES): documenting multiple outcomes in stuttering treatment J Fluen Disord 31 2006 90 115 40 M. Lousada L.M.T. Jesus S. Capelas C. Margaça D. Simões A.R. Valente Phonological and articulation treatment approaches in Portuguese children with speech and language impairments: a randomized controlled intervention study Int J Lang Commun Disord 48 2 2013 Nov 4 172 187 41 G.T. Gillon B.C. McNeill Integrated phonological awareness: an intervention program for preschool children with speech-language impairment 2007 University of Canterbury Christchurch 42 B. Hodson E. Paden Targeting intelligible speech: a phonological approach to remediation 1991 College-Hill Press San Diego 43 G. Lancaster Developing speech and language skills 2008 Routledge London 44 A. Agresti Y. Min Frequentist performance of Bayesian confidence intervals for comparing proportions in 2 × 2 contingency tables Biometrics 61 2005 515 523 45 A.D. Sandler D. Brazdziunas W.C. Cooley L.G. Pijem D. Hirsch T.A. Kastner Developmental surveillance and screening of infants and young children Pediatrics 108 1 2001 192 195 46 L. Jesus M. Lousada Protocolo de Anamnese de Linguagem na Criança da Universidade de Aveiro [University of Aveiro's Case History Form for Child Language]. INPI Registration Number 465220 and IGAC Registration 2/06/2010 2010 University of Aveiro Portugal 47 A. Mendes E. Afonso M. Lousada F. Andrade Teste de Linguagem ALPE Aveiro Edubox 2014 48 R. Owens Language development: an introduction 8th ed. 2011 Pearson Boston 49 R. Paul C. Norbury Language disorders from infancy through adolescence: listening, speaking, reading, writing, and communicating 4th ed. 2012 Elsevier Mosby St. Louis, MO 50 B. Guitar Stuttering: an integrated approach to its nature and treatment 4th ed. 2014 Lippincott Williams & Wilkins Baltimore 51 C.M. Brown A.F. Beck W. Steuerwald E. Alexander Z.M. Samaan R.S. Kahn Narrowing care gaps for early language delay a quality improvement study Clin Pediatr (Phila) 2015 1 8 52 M. Snowling J. John D. Bishop S. Stothard Educational attainments of school leavers with a preschool history of speech-language impairments Int J Lang Commun Disord 36 2 2001 173 183 53 H. Gardner A. Froud A. McClelland H. Lely Development of the Grammar and Phonology Screening (GAPS) test to assess key markers of specific language and literacy difficulties in young children Int J Lang Commun Disord 41 5 2006 513 540 54 N. Botting Z. Simkin G. Conti-Ramsden Associated reading skills in children with a history of specific language impairment (SLI) Read Writ 19 2006 77 98 55 Educação sofre o maior corte desde o 25 de Abril Diário Económico (DE), 5/4/2012, Lisboa, Portugal 2012 56 BE quer repor apoio de Educação Especial para milhares de alunos Diário de Notícias (DN), 18/2/2016, Lisboa, Portugal 2016 57 Diminuição do número de alunos por turma e promoção do sucesso escolar (projeto de resolução no 181/XIII/1a) Bloco de Esquerda (BE), Lisboa, Portugal 2016 58 E. Rosa Cortes significativos na despesa pública com a educação, ciência e ensino superior no período 2011–2013 2013 Available from: www.eugeniorosa.com 59 E. Rosa Só no período 2001-2016 o Estado financiou o ensino privado com 4.464,4 milhões € e os privados querem mais 2016 Available from: www.eugeniorosa.com 60 S. Popova S. Lange L. Burd K. Shield J. Rehm Cost of speech-language interventions for children and youth with foetal alcohol spectrum disorder in Canada Int J Speech Lang Pathol 16 6 2014 571 581 61 S. Crosbie A. Holm B. Dodd Intervention for children with severe speech disorder: a comparison of two approaches Int J Lang Commun Disord 40 4 2005 467 491 62 B. Dodd H. Zhu S. Crosbie A. Holm A. Ozanne Diagnostic Evaluation of Articulation and Phonology 2002 Psychological Corporation London 63 E. Yairi N.G. Ambrose Early Childhood Stuttering for Clinicians by Clinicians 2005 Pro-ed Austin, Texas "
    },
    {
        "doc_title": "A country-wide probability sample of public attitudes toward stuttering in Portugal",
        "doc_scopus_id": "85015608188",
        "doc_doi": "10.1016/j.jfludis.2017.03.001",
        "doc_eid": "2-s2.0-85015608188",
        "doc_date": "2017-06-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Experimental and Cognitive Psychology",
                "area_abbreviation": "PSYC",
                "area_code": "3205"
            },
            {
                "area_name": "Language and Linguistics",
                "area_abbreviation": "ARTS",
                "area_code": "1203"
            },
            {
                "area_name": "Linguistics and Language",
                "area_abbreviation": "SOCI",
                "area_code": "3310"
            },
            {
                "area_name": "Cognitive Neuroscience",
                "area_abbreviation": "NEUR",
                "area_code": "2805"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            },
            {
                "area_name": "LPN and LVN",
                "area_abbreviation": "NURS",
                "area_code": "2912"
            }
        ],
        "doc_keywords": [
            "Adolescent",
            "Adult",
            "Age Factors",
            "Aged",
            "Attitude",
            "Educational Status",
            "Female",
            "Humans",
            "Male",
            "Middle Aged",
            "Portugal",
            "Public Opinion",
            "Sampling Studies",
            "Socioeconomic Factors",
            "Stuttering",
            "Young Adult"
        ],
        "doc_abstract": "© 2017 Elsevier Inc.Background Negative public attitudes toward stuttering have been widely reported, although differences among countries and regions exist. Clear reasons for these differences remain obscure. Purpose Published research is unavailable on public attitudes toward stuttering in Portugal as well as a representative sample that explores stuttering attitudes in an entire country. This study sought to (a) determine the feasibility of a country-wide probability sampling scheme to measure public stuttering attitudes in Portugal using a standard instrument (the Public Opinion Survey of Human Attributes–Stuttering [POSHA–S]) and (b) identify demographic variables that predict Portuguese attitudes. Methods The POSHA–S was translated to European Portuguese through a five-step process. Thereafter, a local administrative office-based, three-stage, cluster, probability sampling scheme was carried out to obtain 311 adult respondents who filled out the questionnaire. Results The Portuguese population held stuttering attitudes that were generally within the average range of those observed from numerous previous POSHA–S samples. Demographic variables that predicted more versus less positive stuttering attitudes were respondents’ age, region of the country, years of school completed, working situation, and number of languages spoken. Non-predicting variables were respondents’ sex, marital status, and parental status. Conclusion A local administrative office-based, probability sampling scheme generated a respondent profile similar to census data and indicated that Portuguese attitudes are generally typical.",
        "available": true,
        "clean_text": "serial JL 271233 291210 291682 291723 291738 291743 291782 291784 291923 31 Journal of Fluency Disorders JOURNALFLUENCYDISORDERS 2017-03-06 2017-03-06 2017-03-16 2017-03-16 2017-05-31T20:41:33 S0094-730X(16)30024-9 S0094730X16300249 10.1016/j.jfludis.2017.03.001 S300 S300.1 FULL-TEXT 2017-05-31T17:49:55.553724-04:00 0 0 20170601 20170630 2017 2017-03-06T17:16:50.401794Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist yearnav figure table e-component body acknowledge affil appendices articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor highlightsabst primabst ref vitae 0094-730X 0094730X true 52 52 C Volume 52 5 37 52 37 52 201706 June 2017 2017-06-01 2017-06-30 2017 article fla © 2017 Elsevier Inc. All rights reserved. ACOUNTRYWIDEPROBABILITYSAMPLEPUBLICATTITUDESTOWARDSTUTTERINGINPORTUGAL VALENTE A 1 Introduction 1.1 Attitudes toward stuttering 1.2 Stuttering attitudes in various countries 1.2.1 Comparative country studies with a short questionnaire 1.2.2 Comparative studies using the POSHA–S 1.3 Purpose 2 Materials and methods 2.1 Attitude measure 2.1.1 Instrument 2.1.2 Scoring 2.1.3 Psychometric properties 2.1.4 Translation 2.2 Probability sampling scheme 2.3 Data analysis 3 Results 3.1 Demographic 3.1.1 Respondents 3.1.2 Demographic and related ratings 3.2 Comparison of the Portuguese results with POSHA–S database 3.3 POSHA–S predictors variables of Portuguese stuttering attitudes 4 Discussion 4.1 Summary 4.2 Portuguese attitudes toward stuttering 4.3 Feasibility of the probability sampling scheme 4.4 Demographic predictors of stuttering attitudes 4.5 Strengths, limitations, and future research Acknowledgements Appendix A Supplementary data References ALKHALEDI 2009 44 59 M ARNOLD 2015 28 39 H AYDIN 2008 C MSCTHESIS KEKEMELIGEYONELIKTOPLUMSALFARKINDALIGINBELIRLENMESIDETERMININGAWARENESSTOWARDSTUTTERING BABBIE 2006 E PRACTICESOCIALRESEARCH BESTEGULDBORG 2015 133 145 A STUTTERINGMEETSSTEREOTYPESTIGMADISCRIMINATIONOVERVIEWATTITUDERESEARCH AMERICANINDIANPERCEPTIONSSTUTTERING BLOODSTEIN 2008 O AHANDBOOKSTUTTERING BOYLE 2013 1517 1529 M BOYLE 2015 43 71 M STUTTERINGMEETSSTEREOTYPESTIGMADISCRIMINATIONOVERVIEWATTITUDERESEARCH STIGMASTUTTERINGCONCEPTUALIZATIONSAPPLICATIONSCOPING BURLEY 1986 329 333 P COOPER 1996 119 135 E COSKUN 2006 M KEKEMELIKVEHIZLIBOZUKKONUSMAHAKKINDAFARKINDALIGINBETIMLENMESIDESCRIBINGAWARENESSABOUTSTUTTERINGCLUTTERING CROWE 1977 343 357 T CROWE 1983 13 27 T CROWE 1981 163 174 T DALY 2014 C PUBLICATTITUDESTOWARDSSTUTTERINGEPIDEMIOLOGICALSTUDYIRISHPOPULATION DOODY 1993 363 373 I DORSEY 2000 77 83 M EVANS 2008 203 219 D FIELD 2013 A DISCOVERINGSTATISTICSUSINGIBMSPSSSTATISTICS FLYNN 2011 110 121 T GOFFMAN 1963 E STIGMANOTESMANAGEMENTASPOILEDIDENTITY GRIFFIN 2007 217 222 M PROCEEDINGSFLUENCYDISORDERS YOUNGCHILDRENS35YEAROLDPERCEPTIONSADYSFLUENTSPEAKER GUILLEMIN 1993 1417 1432 F HARTFORD 2007 217 222 E PROCEEDINGSFLUENCYDISORDERS PERCEPTIONSPRIMARYSCHOOLCHILDRENAPERSONSTUTTERS HUGHES 2015 310 350 S STUTTERINGMEETSSTEREOTYPESTIGMADISCRIMINATIONOVERVIEWATTITUDERESEARCH ATTITUDESTOWARDSTUTTERINGANNOTATEDBIBLIOGRAPHY IP 2012 543 556 M JUNUZOVICZUNIC 2015 226 242 L STUTTERINGMEETSSTEREOTYPESTIGMADISCRIMINATIONOVERVIEWATTITUDERESEARCH EFFECTSFLUENCYDISORDERSCOURSEWORKSTUDENTSSTUTTERINGATTITUDESINTWOCOUNTRIES KIRSCH 2006 D ADOLESCENTPERCEPTIONSPEERSSTUTTER LASS 1989 127 134 N LASS 1994 90 93 N LASS 1992 78 81 N LI 2015 8 18 J MACKINNON 2007 297 309 S NILLSON 2013 S MSCTHESIS TRYRELAXASURVEYSTUDYINSWEDENAMONGNATIVESWEDESARABICIMMIGRANTSCONCERNINGVIEWSSTUTTERING OZDEMIR 2011 262 267 R OZDEMIR 2011 318 333 R PEREIRA 2008 24 31 M PRZEPIORKA 2013 703 714 A RUSCELLO 1994 125 132 D RUSCIANO 2003 361 366 F STLOUIS 2011 256 261 K STLOUIS 2012 246 253 K STLOUIS 2012 129 146 K STLOUIS 2012 116 122 K STLOUIS 2015 7 42 K STUTTERINGMEETSSTEREOTYPESTIGMADISCRIMINATIONOVERVIEWATTITUDERESEARCH EPIDEMIOLOGYPUBLICATTITUDESTOWARDSTUTTERING STLOUIS 2015 K INVITEDKEYNOTEADDRESS8THWORLDCONGRESSINTERNATIONALFLUENCYASSOCIATION WORLDWIDEPERSPECTIVESPUBLICPROFESSIONALATTITUDESTOWARDFLUENCYDISORDERS STLOUIS 2005 413 416 K STLOUIS 2015 165 177 K STUTTERINGMEETSSTEREOTYPESTIGMADISCRIMINATIONOVERVIEWATTITUDERESEARCH PUBLICATTITUDESTOWARDMALESVERSUSFEMALESSTUTTERUNITEDSTATESIRAN STLOUIS 2009 101 107 K STLOUIS 2008 K STLOUIS 2014 34 50 K STLOUIS 2009 11 28 K STLOUIS 2010 361 377 K STLOUIS 2014 21 34 K STLOUIS 2016 115 130 K STLOUIS 2016 104 K STLOUIS 2014 36 50 K THEILING 2013 M MSCTHESIS OFFENTLICHEWAHRNEHMUNGVONSTOTTERNDENINDEUTSCHLANDERPROBUNGUNDVALIDIERUNGDERDEUTSCHENVERSIONDESPOSHASPUBLICPERCEPTIONPEOPLESTUTTERINGERMANYTESTINGVALIDATIONGERMANVERSIONPOSHAS TOMAIULOI 2013 D 29THWORLDCONGRESSINTERNATIONALASSOCIATIONLOGOPEDICSPHONIATRICS STUTTERINGATTITUDESINITALY TYRRELL 2009 L MSCTHESIS ACOMPARISONATTITUDESKNOWLEDGEBELIEFSABOUTSTUTTERINGINBRITISHUNIVERSITYSTUDENTSLIVINGINUKSYRIANUNIVERSITYSTUDENTSLIVINGINSYRIA VALENTE 2015 93 110 A STUTTERINGRISKFACTORSPUBLICATTITUDESIMPACTPSYCHOLOGICALWELLBEING CROSSCULTURALADAPTATIONPUBLICOPINIONSURVEYHUMANATTRIBUTESSTUTTERINGPOSHASEUROPEANPORTUGUESEEPTRANSLATIONADAPTATIONPROCESSAMODEL VANBORSEL 1999 124 132 J WESIERSKA 2015 K PAPERPRESENTEDINTERNATIONALCONFERENCESPEECHLANGUAGETHERAPYMODERNTRENDSINLOGOPAEDICDIAGNOSISTHERAPY ZMIANAPOSTAWWOBECJAKANIAWPOLSCEWSTEPNEDONIESIENIAZBADANCHANGINGATTITUDESTOWARDSSTUTTERINGINPOLANDPRELIMINARYSTUDYREPORT WESIERSKA 2015 216 225 K STUTTERINGMEETSSTEREOTYPESTIGMADISCRIMINATIONOVERVIEWATTITUDERESEARCH ACOMPARISONATTITUDESTOWARDSSTUTTERINGBETWEENPOLISHSLPSSLPSTUDENTSUSINGPOSHAS WESIERSKA 2014 263 284 M XINGMING 2001 145 150 J YAIRI 1970 161 170 E YEAKLE 1986 345 359 M VALENTEX2017X37 VALENTEX2017X37X52 VALENTEX2017X37XA VALENTEX2017X37X52XA 2019-03-16T00:00:00.000Z UnderEmbargo © 2017 Elsevier Inc. All rights reserved. item S0094-730X(16)30024-9 S0094730X16300249 10.1016/j.jfludis.2017.03.001 271233 2017-05-31T17:49:55.553724-04:00 2017-06-01 2017-06-30 true 1001587 MAIN 16 41557 849 656 IMAGE-WEB-PDF 1 gr1 11403 164 112 gr2 20304 146 219 gr1 29632 412 282 gr2 76676 352 527 gr1 107690 1462 1000 gr2 446203 1560 2333 mmc1 mmc1.docx docx 47833 APPLICATION JFD 5637 S0094-730X(16)30024-9 10.1016/j.jfludis.2017.03.001 Elsevier Inc. Fig. 1 Regions (NUTS level II) in Portugal and percentage of respondents in each region. Fig. 1 Fig. 2 Comparison of POSHA–S results from the Portuguese population and the database samples. Fig. 2 Table 1 Descriptive demographic information of Portuguese respondents with frequencies and associated percentages. Where available, recent Portuguese census data are provided. Table 1 Variable Categories Number of respondents Percentage Portuguese population (from census) Age group a 18–24 yr 88 28.3% 9.4% 25–64 yr 124 39.9% 67.4% ≥65 yr 90 28.9% 23.2% No answer 9 2.9% – Sex a Male 150 48.2% 47.0% Female 157 50.5% 53.0% No answer 4 1.3% – Region (NUTS level II) a North 62 19.9% 34.7% Center 94 30.2% 22.4% Lisbon 38 12.2% 26.6% Alentejo 68 21.9% 7.3% Algarve 16 5.1% 4.3% Azores 11 3.5% 2.2% Madeira 16 5.1% 2.5% No answer 6 1.9% – School level completed a Primary school (1st cycle) 71 22.8% 28.1% Middle school (2nd cycle) 19 6.1% 11.9% Middle school (3rd cycle) 43 13.8% 15.9% High school 89 28.6% 15.3% Trade/military/technical school 30 9.6% – 4-yr university degree 35 11.3% 14.4% Master or similar degree 10 3.2% 1.3% Doctoral degree 1 0.3% 0.3% No answer 13 4.2% – Working situation a Student 35 11.3% 2.4% Working 140 45.0% 49.9% Unemployed or not working 42 13.5% 7.3% Retired 87 28.0% 27.0% Student worker 2 0.6% – No answer 5 1.6% – Marital status a Married 185 59.5% 56.9% Not married 112 36.0% 43.1% No answer 14 4.5% – Parental status a Parent 165 53.1% – Non-parent 117 37.6% – No answer 29 9.3% – Religion Christian 229 73.6% – Catholic 204 65.6% – Denomination unspecified 23 7.4% – Evangelical 2 0.6% – Muslim 1 0.3% – Agnostic 4 1.3% – Atheist 3 1.0% – None 6 1.9% – No answer 68 21.9% – Native language Portuguese 303 97.4% – Other 1 0.3% – No answer 7 2.3% – Number of languages known a 1 137 44.1% – 2 83 26.7% – 3 47 15.1% – 4 39 12.5% – No answer 5 1.6% – Persons known who have a stuttering disorder b Nobody 80 25.7% – Acquaintance 172 55.3% – Close friend 31 10.0% – Relative 33 10.6% – Me 5 1.6% – Other 9 2.9% – No persons known Stuttering 80 25.7% – Mentally ill 113 36.3% – Obese 45 14.5% – Left handed 47 15.1% – Intelligent 23 7.4% – Self-identification Stuttering 5 1.6% – Mentally ill 2 0.6% – Obese 18 5.8% – Left handed 13 4.2% – Intelligent 51 16.4% – a Predictor variables evaluated statistically in the study. b Items weighted and used to construct the Personal Experience item on the POSHA–S. Table 2 Mean values for POSHA–Sstuttering subscores and Overall Stuttering Scores (OSSs) for predictor demographic variables in the Portuguese population. Table 2 Predictor variable Categories Beliefs about people who stutter Self-reactions to people who stutter Overall stuttering score Age group 18–24 yr 35.6 9.0 22.3 25–64 yr 36.5 8.9 22.7 ≥65 yr 28.4 −5.9 11.2 Sex Male 33.8 5.7 19.7 Female 33.5 5.0 19.3 Region North 32.2 6.9 19.5 Center 32.3 6.1 19.2 Lisbon 31.9 −2.8 13.6 Alentejo 33.2 1.5 17.3 Algarve 36.8 −5.8 15.5 Azores 36.6 27.7 32.1 Madeira 46.7 12.3 29.5 School level completed Primary school (1st cycle) 30.4 −4.3 13.1 Middle school (2nd cycle) 36.9 6.8 21.9 Middle school (3rd cycle) 30.0 7.7 18.8 High school 35.7 9.9 22.8 Trade/military/technical school 27.9 5.7 16.8 4-yr university degree 41.4 11.2 26.3 Master or similar degree 31.0 9.4 20.2 Doctoral degree 33.3 −21.7 a 5.8 Working situation Student 38.0 5.8 21.9 Working 32.6 10.6 21.6 Unemployed or not working 38.6 6.4 22.5 Retired 29.4 −5.02 12.2 Student worker 30.2 −5.5 12.4 Marital status Married 32.8 4.2 18.5 Not married 35.1 5.9 20.5 Parental status Yes 33.4 3.4 18.4 No 33.7 6.7 20.2 Number of languages known 1 30.3 0.2 15.3 2 37.8 2.9 20.4 3 30.8 16.2 23.5 4 35.1 11.2 23.2 a Data related to Subscores and OSS concerning doctoral degree is based on only one respondent. A country-wide probability sample of public attitudes toward stuttering in Portugal Ana Rita S. Valente a b Kenneth O. St. Louis c Margaret Leahy d Andreia Hall e Luis M.T. Jesus f g ⁎ a Institute of Electronics and Informatics Engineering of Aveiro (IEETA) University of Aveiro, Aveiro, Portugal Institute of Electronics and Informatics Engineering of Aveiro (IEETA) University of Aveiro Aveiro Portugal b Department of Education and Psychology (DEP) University of Aveiro, Aveiro, Portugal Department of Education and Psychology (DEP) University of Aveiro Aveiro Portugal c Department of Communication Sciences & Disorders West Virginia University, Morgantown, WV, USA Department of Communication Sciences & Disorders West Virginia University Morgantown WV USA d Department of Clinical Speech and Language Studies Trinity College Dublin, Dublin, Ireland Department of Clinical Speech and Language Studies Trinity College Dublin Dublin Ireland e CIDMA - Center for Research and Development in Mathematics and Applications, Department of Mathematics University of Aveiro, Aveiro, Portugal CIDMA - Center for Research and Development in Mathematics and Applications, Department of Mathematics University of Aveiro Aveiro Portugal f Institute of Electronics and Informatics Engineering of Aveiro (IEETA) University of Aveiro, Aveiro, Portugal Institute of Electronics and Informatics Engineering of Aveiro (IEETA) University of Aveiro Aveiro Portugal g School of Health Sciences (ESSUA) University of Aveiro, Aveiro, Portugal School of Health Sciences (ESSUA) University of Aveiro Aveiro Portugal ⁎ Corresponding author at: School of Health Sciences (ESSUA), University of Aveiro, Portugal. Background Negative public attitudes toward stuttering have been widely reported, although differences among countries and regions exist. Clear reasons for these differences remain obscure. Purpose Published research is unavailable on public attitudes toward stuttering in Portugal as well as a representative sample that explores stuttering attitudes in an entire country. This study sought to (a) determine the feasibility of a country-wide probability sampling scheme to measure public stuttering attitudes in Portugal using a standard instrument (the Public Opinion Survey of Human Attributes–Stuttering [POSHA–S]) and (b) identify demographic variables that predict Portuguese attitudes. Methods The POSHA–S was translated to European Portuguese through a five-step process. Thereafter, a local administrative office-based, three-stage, cluster, probability sampling scheme was carried out to obtain 311 adult respondents who filled out the questionnaire. Results The Portuguese population held stuttering attitudes that were generally within the average range of those observed from numerous previous POSHA–S samples. Demographic variables that predicted more versus less positive stuttering attitudes were respondents’ age, region of the country, years of school completed, working situation, and number of languages spoken. Non-predicting variables were respondents’ sex, marital status, and parental status. Conclusion A local administrative office-based, probability sampling scheme generated a respondent profile similar to census data and indicated that Portuguese attitudes are generally typical. Keywords Stuttering Attitudes Portugal POSHA–S Representative sampling 1 Introduction 1.1 Attitudes toward stuttering The current study was motivated by a growing number of investigations over several decades that have investigated public attitudes toward stuttering and have documented that the general public attributes negative traits to people who stutter (c.f. reviews by Hughes, 2015). Studies have sampled people from different ages (Doody, Kalinowski, Armson, & Stuart, 1993; Evans, Healey, Kawai, & Rowland, 2008; Griffin & Leahy, 2007; Hartford and Leahy, 2007; Kirsch, 2006), varying family status (Al-Khaledi, Lincoln, McCabe, Packman, & Alshatti, 2009; Crowe & Cooper, 1977; Özdemir, St. Louis, & Topbaş, 2011b), and different professional groups (Crowe & Cooper, 1983; Crowe & Walton, 1981; Dorsey & Guenther, 2000; Lass et al., 1992, 1994; Ruscello, Lass, Schmitt, & Pannbacker, 1994; Yeakle & Cooper, 1986), including speech and language therapists (SLTs) (Cooper & Cooper, 1996; Lass, Ruscello, Pannbacker, Schmitt, & Everly-Myers, 1989; Yairi & Williams, 1970). Findings from these studies indicate that anxiety, shyness, nervousness, introversion, and unassertiveness are among those negative traits commonly attributed to people who stutter and are referred to as the “stuttering stereotype” (MacKinnon, Hall, & MacIntyre, 2007; Yairi & Williams, 1970). The purpose of this study was to determine POSHA–S results using a probability sampling approach. As described in the Method (see Section 2.2), the country of Portugal was chosen for this research because the country's government is organized in such a way that a novel approach to probability sampling was feasible. Stigma, which can include prejudice (e.g., stuttering stereotype) and discrimination, relate to a “spoiled identity” (Goffman, 1963). Stigma typically begins with negative attitudes of the public (i.e., public stigma), but can become internalized by individuals (i.e., self-stigma) (Boyle, 2013). Given the pervasiveness of public and self-stigma related to stuttering, and their consequences, calls for actions, e.g., public awareness campaigns, to mitigate public stigma are common. The assumption has been that providing compelling, accurate, and up-to-date information regarding stuttering will increase the likelihood that people who stutter can grow up and live without the burden of stigma (Flynn & St. Louis, 2011). A major initiative, the International Project on Attitudes Toward Human Attributes (IPATHA), was inaugurated to compare public attitudes toward stuttering in different populations and then to develop a science of improving such attitudes. Both purposes required a standard survey instrument that could be translated and used internationally. Accordingly, the Public Opinion Survey of Human Attributes–Stuttering (POSHA–S explained in detail below in Section 2.1.1) was developed (St. Louis, 2011, 2012a, 2012b, 2015a, 2015b) and has been used since 2001 to collect information related to attitudes toward stuttering in 42 different countries and in 26 different languages (circa March, 2016). Excluding experimental versions of the instrument and samples composed entirely of stuttering individuals, SLTs, or Speech and Language Therapy (SLT) students, 11383 respondents from 141 different samples comprise the public database. The USA is most highly represented in the database, but American respondents account for 29% of the samples. Because the database samples vary, based on such selection variables as country, age, level of education, profession, socio-economic status (SES), or languages known, the median of the 141 sample means is taken as the “average” for each POSHA–S rating. The rationale is that, compared to the mean of all 141 sample means, the median value minimizes influence of “outlier” samples, i.e., samples with extremely positive (high) or extremely negative (low) attitudes. Currently, the median of the “Overall Stuttering Score” (OSS, described below) is 17 for public samples. On the POSHA–S −100 to +100 scale, this means that values below 17 are below average and those above 17 are above average. Most of the studies have employed various methods of convenience sampling. Typically, these involved investigators asking friends, acquaintances, family members, students, or colleagues to both fill out the POSHA–S and to distribute other questionnaires to their friends, acquaintances, family members, students, or colleagues. Many of these studies have excluded SLTs or SLT students (except those seeking to sample only these populations) since clear evidence exists that their attitudes are more positive than those of people in other professions (e.g., St. Louis, Przepiórka, et al., 2014). A few studies have used a form of probability sampling. These range from random sampling from a list of the population to sampling from a randomly selected cluster of potential respondents. 1.2 Stuttering attitudes in various countries Whereas, studies of public attitudes toward stuttering have been carried out in numerous countries, no systematic research has been reported that has sought to collect a representative sample that would allow generalization of findings to an entire country. Following is a review of selected studies that measured attitudes in samples across different regions of a country or sampled comprehensively enough to generate an impression of attitudes in a specific country. Most of the studies used convenience sampling. The few that used probability sampling are highlighted. 1.2.1 Comparative country studies with a short questionnaire Van Borsel and colleagues (Pereira, Rossi, & Borsel, 2008; Van Borsel, Verniers, & Bouvry, 1999; Xing Ming, Jing, Yi Wen, & Van Borsel, 2001) carried out parallel studies in Belgium, China, and Brazil with an orally-presented questionnaire composed of 12 questions (different from the POSHA–S questionnaire). The three studies were similar enough such that the authors have reported inter-country comparisons. Questions related to respondents’ knowledge about stuttering as well as thoughts about stuttering in other races and treatment of stuttering children. The studies were carried out with a form of convenience sampling, but with constraints designed to reduce bias that may be inherent in typical samples of convenience. Eligible respondents were people on a main shopping street who happened to be present on the days of sampling and agreed to talk to examiners who approached them. The fact that none of the respondents were presumably known to the questioners reduced selection bias, and the fact that none of them could have known in advance that they would be approached reduced response bias. Care was taken to assure that three age groupings and both sexes were proportionally included and that SLTs, physicians, and people who stuttered were excluded. Similarities and differences among respondents from Belgium, China, and Brazil were reported. For example, 68–85% reported that they had heard or met a person who stutters, and of those 41–59% knew someone who stuttered who was a friend, relative, or neighbor. Fifty-three to 71% thought more males than females stuttered. Other selected results of these studies are compared to those of the current study in Section 4.3. 1.2.2 Comparative studies using the POSHA–S Although numerous studies have been carried out in the USA using the POSHA–S in its original English, only one study intended to sample a subset of the population of the entire country, i.e., a study of American Indians (Native Americans) (Beste-Guldborg, St. Louis, & Campanale, 2015). In this study, through email lists acquired from tribal directories provided by tribal leaders, more than 1500 self-identified American Indian adults filled out online POSHA–S. They represented four regional tribal groups: Northern Plains, Eastern, Southwestern, and Northwestern tribal groups. Overall, 95 different tribal affiliations were listed, with individuals responding from 35 of the 50 USA states. Summary POSHA–S scores (described below) were very similar across the four regions and the Overall Stuttering Scores (OSSs) were identical to the POSHA–S database median (17) in the majority of the sample. Nevertheless, significant differences between regions for selected individual items occurred, partly because of the large sample sizes (n =205–639). The authors concluded that, in spite of a few exceptions, the American Indians had accommodated closely to majority attitudes around the country. Using Turkish translations of the POSHA–S, public attitudes in Turkey were investigated in four different studies. Three of them were convenience samples (i.e., Aydın, 2008; Çoşkun, 2006; St. Louis, de Andrade, Georgieva, & Troudt, 2005,). One was a probability sample derived from a public school-based scheme wherein city districts, then elementary schools within them, were selected at random (i.e., Özdemir et al., 2011b). This probability study compared samples of sixth-year elementary students with their parents, grandparents or adult relatives, and adult neighbors. Specific results are summarized in Section 4.3. Overall, however, the above-mentioned convenience samples yielded more negative Beliefs about stuttering on the POSHA–S but less negative Self Reactions to stuttering [Section 2.1.1] than the probability samples. Accordingly, Özdemir, St. Louis, and Topbaş (2011a) concluded that results from convenience sampling generated different attitudes than results obtained from probability sampling in one Turkish city. Four POSHA–S investigations in Poland (in Polish) explored attitudes toward people who stutter (Przepiórka, Błachnio, St. Louis, & Woźniak, 2013; St. Louis, Przepiórka, et al., 2014; Węsierska, Węsierska, St. Louis, & Beste-Guldborg, 2015; Węsierska & St. Louis, 2014). Respondents were 268 adults from the general public, 188 SLTs, 403 SLT students and 205 university students from other majors, all responding via convenience sampling. Generally, the Polish attitudes on different samples were quite consistent except that, uniformly, SLTs held more positive attitudes on POSHA–S than SLT students, and both groups were more positive than the general public (St. Louis, Przepiórka, et al., 2014; Węsierska, Błachnio, Przepiórka, & St. Louis, 2015). Subsequent to data collection in the current study but highly relevant to it, St. Louis, Sønsterud, et al. (2016) reported a study of European country attitudes that involved combining data from eight different studies of public attitudes. It showed that attitudes varied across countries, with the most positive attitudes being demonstrated in a combined sample from Norway and Sweden with an OSS of 34 (Nillson & Wetterling, 2013; St. Louis, Sønsterud, Carlo, Heitmann, & Kvenseth, 2014), followed next by the same OSS (23) from a sample from Bosnia-Herzegovina and a combined sample from Ireland and England (Daly & Leahy, 2014; Tyrrell, 2009; Węsierska & St. Louis, 2014), then by a sample from Germany (OSS =15) (Theiling, 2013), and finally with the least positive attitudes from Italy (OSS =−3) (Tomaiuloi, Del Gado, Capparelli, & St. Louis, 2013). It was noteworthy that for three of the country samples, i.e., Norway, Bosnia-Herzegovina, and Italy, three different regions of the countries had been sampled in the same investigations, permitting regional comparisons within the countries. In each case, differences within countries were small, even though differences among countries were large. In the case of Italy, for example, 100 adults were sampled from several provinces in the north, in the central region, and in the south, wherein OSSs were 0, 12, and −6, respectively. All of these studies used convenience sampling except a portion of the Swedish sample which employed probability sampling. In searching for predictors in this compilation of studies of European attitudes, the authors were limited by the differences in sampling procedure (e.g., different strategies for convenience sampling), sample size, and other factors. Accordingly, they used a strategy of comparing rank orders of numerous demographic variables in the five countries (or areas) with rank orders for OSS. This procedure would not identify the effect of a given variable, e.g., sex of the respondent, on all the attitudes. Instead, it would provide an estimate of whether that variable had parallel or nonparallel effects in the different countries or areas. It is noteworthy that the suspected demographic variables of sex, age, and education had less effect on public stuttering attitudes than one's citizenship. Thus, national identity, or unique factors related to being a citizen of a particular country, was hypothesized to be a variable worthy of further investigation. For example, it might seem that the most negative Italian attitudes might somehow be related to less positive attitudes that have been observed in southern Europe and Turkey, but the samples in Bosnia-Herzegovina, where more positive OSSs were observed, were roughly in the same latitude. Furthermore, recent unpublished POSHA–S data from France and Spain generated OSSs closer to or above the overall POSHA–S database mean, 19 and 16, respectively (M. Eboli, personal communication, April, 2014; L. Leprovost, personal communication November, 2015). The authors called for additional studies of public attitudes in Europe, especially those that could be generalized with some confidence to entire countries. Given that no systematic studies of public attitudes toward stuttering in any country using the POSHA–S have been published, the current study focused on Portugal and its potential geographical and cultural influences that might affect Portuguese public attitudes. Would Portuguese attitudes be more negative than the POSHA–S median values, as was the case in Italy, or be close to the median, as was the case in France and Spain (with which Portugal shares a border)? Regardless of the answers to this question, the need exists for a study designed to sample public attitudes toward stuttering in such a way that would enable statistical inferences from the sample to the typical, literate, adult population of an entire country. To do so, the sample size would need to be large enough to provide the statistical power to identify potential demographic variables that influence public attitudes within the country. A systematic, country-wide sample of public attitudes toward stuttering in Portugal would also be useful for stakeholders in the country. Although no systematic research study has been conducted related to public attitudes toward those who stutter, information distributed through pamphlets by the Portuguese Stuttering Association indicate that the public holds the stuttering stereotype with misconceptions about stuttering as well as a lack of information about the disorder (Associação Portuguesa de Gagos [Portugese Stuttering Association], 2014). Results from a carefully designed, probability sampling study could inform future public awareness campaigns or cognitive-behavioral treatments to attempt to mitigate negative stuttering attitudes and also serve as a baseline against which potential long-term attitude changes could be compared. 1.3 Purpose The overall purpose of this study was to measure the attitudes related to stuttering and people who stutter throughout the country of Portugal using the widely used POSHA–S. Two research questions guided the research. (a) To what extent is a local administration office-based probability sampling scheme in all the regions of the country of Portugal feasible for measuring and generalizing public attitudes toward stuttering? Addressing this question involved comparing demographic profiles to Portuguese census information and comparing the attitude results with results from other samples around the world. In that this is the first countrywide probability sample of public attitudes toward stuttering, complete information on the results are provided in tables and supplementary material. (b) To what extent do selected demographic variables predict Portuguese stuttering attitudes? Results were stratified according to selected variables, such as educational achievement, and tested statistically to determine whether the variables predicted more positive versus less positive stuttering attitudes. 2 Materials and methods 2.1 Attitude measure 2.1.1 Instrument The POSHA–S is an epidemiological survey instrument designed to measure public attitudes toward stuttering worldwide (St. Louis, 2011, 2012b, 2015a, 2015b). As such, it was deemed the most appropriate measure of public attitudes for this feasibility study. It has a demographic section, a general section related to the comparison of stuttering with other stigmatizing and nonstigmatizing (“anchor”) conditions, and a detailed section related to stuttering. Items ratings of the POSHA–S are clustered and averaged to calculate components and components are clustered and averaged into subscores. The Beliefs about people who stutter subscore reflects opinions external to the respondent, i.e., Traits/Personality, Help From, Cause, and Potential. The Self Reactions to people who stutter subscore reflects opinions that personally involve or are internal to the respondents, i.e., Accommodating/Helping, Social Distance/Sympathy, Knowledge/Experience, and Knowledge Source. The mean of these two stuttering subscores is the OSS. The third subscore, Obesity/Mental Illness, permits comparisons of attitudes toward stuttering with those other potentially stigmatizing attributes (See St. Louis [2011] for a detailed rationale.) 2.1.2 Scoring Items in the general section and some of the demographic section require a 1–5 rating. Items in the detailed stuttering section require a “yes”, “no”, “not sure” response. The latter are first converted to a 1–3 scale (i.e., “no”=1, “not sure”=2 and “yes”=3) and then, for the sake of convenience, to a −100 to +100 scale with 0 being neutral. The 1–5 ratings are also converted to the −100 to +100 scale (i.e., “1”=−100, “2”=−50, “3”=0, “4”=+50 and “5”=+100) (St. Louis, 2012b)). Ratings on some items are inverted so that, uniformly, higher POSHA–S scores reflect more sensitive or accurate attitudes (consistent with recent literature findings), and lower scores reflect less sensitive or accurate attitudes. 2.1.3 Psychometric properties Psychometric and related properties of the POSHA–S have been carefully addressed and shown in numerous publications to be satisfactory and adequate, i.e., item analysis (St. Louis, 2012b), reliability (St. Louis, 2012b; Junuzović-Žunić et al., 2015; St. Louis, Lubker, Yaruss, & Aliveto, 2009), construct and discriminant validity (Flynn & St. Louis, 2011; St. Louis, Reichel, Yaruss, & Lubker, 2009; St. Louis, Williams, Ware, Guendouzi, & Reichel, 2014), and internal consistency (Al-Khaledi et al., 2009; St. Louis, 2012b). The instrument has been shown to be user-friendly as well as easy to measure and score (St. Louis, Lukber, Yaruss, Adkins, & Pill, 2008; St. Louis, Reichel, et al., 2009). It has been typically administered as a paper-and-pencil questionnaire, but an online administration versus paper-and-pencil administration were found to generate very similar results (St. Louis, 2012c). 2.1.4 Translation In a growing number of studies, the POSHA–S has been administered in many different languages (26 languages circa March, 2016), documenting that the instrument can be successfully and efficiently translated to other languages for international comparisons (St. Louis, 2015a, 2015b). For example, in the most comprehensive translation study, St. Louis and Roberts (2010) showed that differences in stuttering attitudes in two officially bilingual countries (Canada and Cameroon), were large regardless of whether an experimental prototype of the POSHA–S was given in English or French (when respondents selected their stronger language for the survey). By contrast, differences between English and French POSHA–S were small, regardless of the country. The authors recommended that POSHA–S translations be carried out by a bilingual person (in English and the other language) with knowledge of speech and language therapy. A back-translation to English should also be made by another bilingual person without familiarity with POSHA–S or the details of the study in question. They also pointed out that back-translations could not always exclude differences between the original and the translation. In order to rule out inaccuracies or inconsistencies that might affect the results, translation procedures carried out for the current study were more stringent than those of any previous translations (St. Louis, 2015a, 2015b). The following procedures were carried out: Translation into European Portuguese, synthesis of the translations, back-translation, committee review of the resultant translation, and feedback from the committee for final adjustments (Beaton, Bombardier, Guillemin, & Ferraz, 1998; Guillemin, Bombardier, & Beaton, 1993). The detailed process and satisfactory results are described elsewhere (Valente, Jesus, Roberto, Leahy, & St. Louis, 2015). 2.2 Probability sampling scheme A three-stage cluster probability sampling scheme, approved by an ethical committee and the National Data Protection Commission, was implemented for this study, with each stage including simple random sampling (Thompson, 2012). The scheme was designed to locate adults representing the population of Portugal as accurately as possible. The first stage entailed compiling a list of all Portuguese mainland districts and Islands (a total of 20 districts) as well as a list of all administrative regions (concelhos) within them. All 308 administrative regions in the entire country were included, with a number assigned to each region. Using random sampling without replacement five administrative regions within each district were selected such that a total of 100 administrative regions were included in the sampling frame. For the second stage, a list of all administrative subregions (freguesias) within each of the five administrative regions selected from each district was compiled resulting in a total of 1456 administrative subregions. Again, random sampling without replacement was used to choose one administrative subregion within each administrative region already chosen, yielding a total of 100 administrative subregions. The local administrative office (Junta de Freguesia) of each administrative subregion was the site where potential respondents would be selected because these local offices are accessible and used by the local population in Portugal for a wide variety of public services that are necessary and frequently used by adults, all in one place. Specifically, the local administrative office is the place where such activities as obtaining internet access, licenses (e.g., for animals or hunting), photocopy authentication, legal advice, social support services, tutoring (academic support), support for being unemployed, and – in some local offices – postal services are available. It is also the place where people attend various citizen meetings or workshops organized by the offices, register to vote, and cast ballots in elections. As such, a wide range of the population in terms of age, sex, occupation, education, income level, and health status would regularly go into the offices. The third of the three-stage cluster probability sampling scheme comprised the actual respondent identification and questionnaire distribution. Staff at each local administrative office (representing each of the 100 administrative subregions) selected one male and one female within each of three age groups: 18–24 yr, 25–64 yr, and 65 yr or older to be included as potential respondents. In summary, the random sampling procedure would represent 100 administrative subregions (taken from five administrative regions, one from each of 20 districts) and would yield 600 potential respondents (300 males and 300 females). One third of the males and females would be in each of the three age ranges. The first author made a list of the local administrative offices in each of the 100 administrative regions through a web search and then contacted those that were selected randomly in the second stage. The first contact, carried out via telephone and/or email explained the purposes of the study, explained the random procedure to select suitable persons to fill out the POSHA–S questionnaires, and asked permission to distribute questionnaires. When a contact person of the local office declined to assist in the study, the first author contacted the next local office of the same administrative subregion and followed the same procedure. Of the 100 local administrative offices contacted, the initial compliance rate was 70/100 or 70%. Proceeding to the next local administrative office after one declined generated a compliance rate of 100%. The contact person, typically a staff employee, at each local office actually made the final selection of respondents (a male and female in each of three age groups). It was requested that the staff person ask the first six persons entering the office to complete the questionnaire who would complete the inclusion criteria, i.e., that they lived in the subregion, that they were able to read and write, and that they were male or female in one of the age ranges. For statistical analysis, the administrative regions randomly chosen were clustered using the Nomenclature of Territorial Units for Statistics (NUTS level II, hereinafter referred to as “Region”), which is a hierarchical system that divides the country based on existing administrative units and population size (EUROSTAT, 2011). The 100 administrative regions were distributed through seven NUTS level II regions, that is, five divisions on Portugal's mainland (North, Central, Lisbon, Alentejo, and Algarve) and two island regions (Madeira and Azores), as shown in Fig. 1 . The region percentages of the NUTS II data are also represented in Fig.1. 2.3 Data analysis The first purpose of the study was to ascertain the feasibility of the probability sampling countrywide. This was carried out in two ways. First, we compared selected POSHA–S demographic results with available Portuguese census data. The extent to which the probability sampling scheme generated results that approximated the census data would be an index of the extent the survey results were representative of Portugal's population. Second, we compared the results of the Portuguese stuttering attitudes with those from around the world generated from the POSHA–S. Specifically, we compared mean ratings for each POSHA–S component, subscore, and the OSS with the lowest, highest, and median sample mean values of the POSHA–S database, which contained 141 samples representing 11383 public respondents from 42 countries and 26 languages (circa March, 2016). Percentile ranks of the mean ratings for POSHA–S items, components, subscores and OSS for the Portuguese sample derived from all 141 database samples were calculated. The percentage of ratings falling in the 1st quartile (0–25th percentiles), interquartile range (25th–75th percentiles) and the 4th quartile (75th–100th percentiles) were used to determine if the attitudes of the Portuguese sample were close to the median or more/less positive than those in the POSHA–S total sample. It must be recalled that “average” adult attitudes toward stuttering are characterized by stereotype and stigma, and more similarities than differences have characterized POSHA–S samples around the world (St. Louis, 2015a, 2015b). Accordingly, another way of conceptualizing the percentile comparisons is that, within the POSHA–S ratings of the numerous populations sampled, some items typically reflect accurate or empathic attitudes while others do not. Thus, actual mean ratings must be interpreted within the context of percentiles relative to all the samples that have been analyzed rather than relative to their absolute −100 to +100 values. For the second purpose, predicting POSHA–S summary ratings (stuttering subscores and the OSS), eight demographic variables were targeted for their predictive potential for stuttering attitudes: Age group, regions in country, completed school levels, working situation, sex, marital status, parenthood, and number of languages known. As a first step, eight multivariate analysis of variance (MANOVA) procedures were run in IBM SPSS Statistics 22.00 to assess the overall influence of each of these predictive variables on the Beliefs subscore, the Self Reactions subscore, and the OSS with a Bonferroni correction such that alpha level for significance was set at p ≤0.00625 (.05/8). Roy's largest root was chosen as the discriminant function variate because this statistic typically generates the most powerful results on MANOVA comparisons (Field, 2013). The second step involved identifying the predictor variables that revealed statistically significant impact using univariate ANOVAs for their influence on the stuttering subscores and the OSS. Again, a Bonferroni correction was implemented, resulting in a criterion for significance of p ≤0.0168 (.05/3). As a third and final step, Gabriel post-hoc pairwise comparisons were run between means in all variables for which the ANOVAs were significant. Gabriel post-hoc tests were chosen since they can accommodate differences in sample sizes (Field, 2013). 3 Results 3.1 Demographic 3.1.1 Respondents From a total of 600 persons given a POSHA–S through the three-stage sampling procedure described above, a total of 311 questionnaires were returned, generating a return rate of 52%. Babbie (2006) asserts that a response rate of at least 50% is considered acceptable for analysis in a social science research survey. Table 1 presents absolute and relative frequencies of demographic information for the respondents according to demographic categories. Eight of these were evaluated as predictor variables (see below). Data related to respondents’ acquaintance with or self-identification as stuttering – as well as the four other anchor attributes on the POSHA–S (obesity, mental illness, left handedness, and intelligence) – are also listed. Wherever available, information from the 2011 Portuguese census (INE, 2011) is shown for the sake of comparing the probability sample obtained for this study to the entire population. Nine out of 10 respondents were from Portugal's mainland, and 3 out of 10 were from the center of the country. Nearly 40% of the Portuguese respondents who completed questionnaires were in the middle 25–64 age group, with approximately 30% in either the younger or older age groups. Respondents were about evenly split female to male, i.e., 51–48%. For educational achievement, the largest subgroup of respondents had completed high school (nearly 30%). Similarly, for current work status, the largest subgroup (45%) was currently working. Sixty percent of the sample was married, slightly over half had children, and about 45% knew only one language, i.e., European Portuguese. It can be seen that for sex, school level completed, working status, and marital status, census data indicate that the Portuguese sample is generally aligned with the population of the country (INE, 2011). By virtue of the individuals who visited the administrative offices, the younger, 18–24 group was over-represented, the middle, 25–64 group was under-represented, and the older, 65+ group was slightly over-represented. Also, the Center and Alentejo regions were over-represented while the North and Lisbon region were under-represented. More than half (55%) of the respondents reported having an acquaintance who stuttered. Only five people (less than 2%) identified themselves as individuals who stutter (which did not disqualify him/her as a respondent), and fewer than 1% as mentally ill. One quarter reported not knowing anyone who stuttered. More than one-third (36%) of the respondents reported knowing no one who was mentally ill, which represented the least familiarity with the five attributes. Only 1 in 6 of the Portuguese respondents regarded themselves as being intelligent. 3.1.2 Demographic and related ratings POSHA–S results for demographic ratings (converted to the −100 to +100 scale) relating to respondents’ relative income, self-rating of health and abilities, life priorities, and completion time are presented in Supplementary Dataset 1. The table also includes ratings for the two attributes not included in POSHA–S summary scores, i.e., left handedness and intelligence, and thus are treated as demographic variables. In this table, means (converted to the −100 to +100 scale) are followed by the POSHA–S database medians (based on 141 samples around the world), and the rank-order or percentile of the Portuguese data relative to those 141 samples. Relative income was scored well below average of the POSHA–S total database samples, i.e., −22 versus 0 on the −100 to +100 scale or at the 6th percentile. Self-ratings of health and abilities were also rated much lower than the average sample in the database, with percentiles ranging from the lowest observed heretofore for physical health (0 percentile) to ability to speak (13th percentile). Hypotheses related to why these values were rated so low are discussed in Section 4. Except for spending time alone, ratings of life priorities were within the approximate average interquartile range (25th–75th percentile) relative to the 141 samples in the database. 3.2 Comparison of the Portuguese results with POSHA–S database POSHA–S studies have typically been summarized in radial graphs that include components and subscores, with more positive scores closer to the periphery and more negative ratings closer to its center (St. Louis, 2011, 2012a, 2012b, 2015a, 2015b). The Overall Stuttering Score (OSS) of the Portuguese sample was 19 or only two units higher than the database average. Compared to all the samples in the database, this was at the 65th percentile relative to 141 previously analyzed samples from 42 countries, or slightly above the median at the 50th percentile. Component and subscore ratings are compared to the lowest, highest and median sample means from the POSHA–S database. The Portuguese comparisons can be seen clearly in Fig. 2 where mean values parallel the median database value quite closely but reflect more positive attitudes for the Potential and Social Distance/Sympathy components (which were in the 4th quartile) and less positive than average attitudes for the Help From component (which falls into the 1st quartile). Portuguese respondents also indicated knowing considerably less than the median database value for the combined Amount Known about obesity and mental illness (1st quartile). Overall, however, Fig. 2 shows graphically that the Portuguese respondents, chosen according to a careful probability sampling procedure, generated mean stuttering attitudes ratings that were similar to the medians from the POSHA–S database. Supplementary Dataset 2 provides all of the mean ratings of the Portuguese sample scored in the POSHA–S (items, components, subscores, and the OSS), along with the median database values and percentiles. It is important to recall that the percentiles compare the Portuguese to all other samples; they do not address the absolute positivity or negativity of particular attitudes (see Section 3.3). In comparison to previously analyzed samples, the 60 sample ratings are distributed as follows: 1st quartile or least positive attitudes, 7%; interquartile range or average attitudes, 73%; and 4th quartile of most positive attitudes, 20%. The mean percentile value was 54. Taken together, the Portuguese attitudes obtained through the probability sampling procedure in this study were mostly average but with a trend for slightly more positive than average ratings. Selected items that reflected more positive than average attitudes (i.e., in the 4th quartile) were: Agreeing that people who stutter can hold any job they want, rejecting that they should hide their stuttering; not feeling impatient while a conversational partner is stuttering; not being concerned if their doctor, a sibling, or the respondents themselves stuttered; wanting to stutter themselves. More negative than average attitudes (i.e., in the 1st quartile) were reported for three items: Accepting that a medical doctor should help a person who stutters and rejecting that others who stutter should do so and not agreeing that stuttering is caused by genetic inheritance. 3.3 POSHA–S predictors variables of Portuguese stuttering attitudes The predictor demographic variables were analyzed with multivariate analysis of variance (MANOVA) for the Beliefs and Self Reactions subscores and the OSS. Table 2 shows values for Beliefs, Self Reactions, and OSSs of the POSHA–S for subcategories in each of the eight predictor variables and Supplementary Dataset 3 provides detailed statistical results for each variable. The highest or most positive mean values were observed for the 25–64 age group (23), males, respondents living in Azores, those with 4-yr university degrees, students, unmarried respondents, non-parents, and persons knowing three languages. Results of MANOVA and univariate ANOVA analyses for each of the eight predictor variables revealed that five variables were statistically significant for OSSs: age (F(2,299)=13.853, p =0.004), region (F(6, 298)=2.580, p =0.019), school level completed (F(6, 290)=3.258, p =0.004), working situation (F(4, 301)=4.783, p =0.001), and number of languages known (F(3, 302)=4.055, p =0.008). Three variables did generate significant effects: Sex, marital status, and parental status. Considering the Self Reactions subscore, age, region, school level completed, working situation, and number of languages were significantly different. Only the age group variable significantly influenced the Beliefs subscore. Gabriel post-hoc multiple comparisons revealed significant differences between the 18–24 and ≥65 age groups (M =14.966, p <0.001) and also between the 25–64 and ≥65 age groups (M =14.831, p <0.001) for Self-Reactions. For Beliefs, the 25–64 age group held significantly more positive attitudes than the ≥65 group (M =8.068, p =0.014). And for OSS, the 18–24 and 25–64 age groups differed significantly from the older age group (M =11.065, p <0.001, and M =11.450, p <0.001, respectively). Post-hoc comparisons for the region variable revealed that respondents from the Azores island region held more positive Self Reactions in comparison with Central region (M =21.58, p =0.046), Lisbon (M =30.46, p =0.004), Alentejo (M =26.16, p =0.008), and Algarve (M =33.45, p =0.011). Self-Reactions of respondents who completed secondary school or a 4-yr university degree were also more positive than those with only a primary school education (M =−14.245, p =0.006 and M =−15.493, p =0.041, respectively). The same was true for the OSS comparisons (M =−9.765, p =0.010 and M =−13. 222, p =0.005, respectively). Working people held significantly higher Self Reactions subscores and OSS values when compared with retired people (M =15.640, p =0.000 and M =9.380, p =0.001, respectively). Students and unemployed people also had higher OSSs than retired people did (M =9.671, p =0.048 and M =10.267, p =0.016, respectively). We carried out additional ANOVAs to identify factors that might explain the lower scores of elderly people. The amount known about stuttering reported by the ≥65-yr age group was lower (although not significantly so) than the amount known by the younger age groups. Nevertheless, Post-hoc comparisons within the ≥65 age group revealed that the amount known influenced negatively the Self Reactions subscore [F(4, 84)=3.865, p =0.006]. Accordingly, we submit that misinformation or lack of information can be a reason for significantly negative ratings of older adults compared with younger adults. Post-hoc comparisons for the number of languages known was associated with significantly more positive attitudes for respondents who spoke three languages versus one language (M =−15.96, p <0.001) and also between two languages and three languages spoken (M =−13.30, p =0.017) for the Self Reactions subscore. OSSs were significantly higher for people who knew three languages in comparison with people knew only one language (M =−8.23, p =0.024). 4 Discussion 4.1 Summary The present study analyzed the public attitudes of the Portuguese population toward people who stutter through a representative sample of the entire country based on a Portuguese translation of the POSHA–S. Mean attitudes on the POSHA–S using a three-stage cluster sampling procedure, with final recruitment of respondents accomplished by staff at widely-used local administrative offices were commensurate with median of the 141 previously analyzed samples from 42 countries around the world. To the extent that the median represents “average” adult stuttering attitudes, the results of this country-wide sampling procedure were approximately “average,” with trends toward slightly “more positive than average” attitudes. With the methodological innovations employed, we submit that the detailed probability sampling not only generated a representative sample from which to generalize about Portugal's adult stuttering attitudes but also a solid baseline against which future samples can be compared. Given the careful stratification of the sample, the variables that predicted more positive versus less positive stuttering attitudes can be regarded as important for future investigations. Respondents’ age, home region, educational achievement, employment/student status, and number of languages known all were significant predictors. By contrast, respondents’ sex, marital status, or parental status were not significant predictors of stuttering attitudes. 4.2 Portuguese attitudes toward stuttering Fig. 2 confirms that the measured attitudes toward stuttering of the Portuguese population were visibly very similar to the median tracing of all the sample means in the POSHA–S database. Their Beliefs about stuttering were 34, their Self Reactions, 5, and their OSS, 19. Their Obesity/Mental Illness ratings were −34. As noted, these ratings were average to slightly more positive than average. Consistent with the database sample ratings, fully 73% of the percentiles shown in Supplementary Dataset 2 for each Portuguese POSHA–S rating are in the interquartile range, with 7% and 20%, respectively, in the 1st and 4th quartiles. 4.3 Feasibility of the probability sampling scheme The over-arching purpose of this study was to carry out a study of public attitudes toward stuttering that would be representative of the entire country of Portugal. Specifically, one goal was to determine the feasibility of using a local administrative office-based method of respondent recruitment in the country-wide probability sample. Results indicated that the sampling procedure, in general, generated respondents who were representative of the Portuguese population. With a few exceptions, the samples obtained at the 100 local administrative offices were aligned to the expected percentages based on data from the official Portuguese census. Most notably, the sample was almost equally balanced for males and females and was parallel to the population percentages for school achievement, work status, and marital status. Additionally, the fact that 2% of the respondents stuttered is close to prevalence rates of stuttering around the world (Bloodstein & Ratner, 2008). The relative income rating (combined from ratings of one's income relative to both friends and family as well as all the people in one's country) of −22 was considerably lower than the POSHA–S database median of 0 on the −100 to +100 scale, placing it at the 6th percentile. This was also lower than all five countries/areas in the St. Louis, Sønsterud, et al. (2016) study, where mean ratings ranged from −9 in Bosnia & Herzegovina to 15 in Germany. These means, as are most in the POSHA–S database, were generated from convenience sampling. Özdemir et al. (2011a) found that the relative incomes of two probability samples of adults in Turkey were also much lower than those of adults from a convenience sample in the same city, i.e., −7 and −12 versus 9. It is likely that most previous POSHA–S investigators, representing moderate income levels, tend to recruit respondents more similar to their own incomes than do probability sampling strategies. Although not comparable to any available census data, it was puzzling that the Portuguese sample regarded themselves much lower than average on the demographic self-ratings for physical health, mental health, ability to learn, and ability to speak (0–13th percentiles relative to the POSHA–S database samples) (Supplementary Dataset 1). Moreover, only 16% regarded themselves as intelligent (18th percentile). These are commensurate with some other cultural samples analyzed wherein respondents apparently do no not wish to “brag” about themselves, e.g., Poland (Przepiórka et al., 2013) and Hong Kong or Mainland China (Ip, St. Louis, Myers, & An Xue, 2012) where rank orders were all in the 1st quartile relative to the database and most below the 10th percentile. Apparently, the Portuguese population is not predisposed to rate themselves highly on characteristics that might appear to be “bragging.” Public attitudes toward stuttering in Portugal, in comparison to other database samples around the world that used the POSHA–S, were also roughly “average.” Importantly, however, in comparison to the most relevant study of European attitudes (St. Louis, Sønsterud, et al., 2016), Portuguese attitudes were substantially more positive than measured attitudes in Italy (OSS =−3), slightly more positive than those in Germany (OSS =15), slightly lower than Bosnia & Herzegovina or the combined English/Irish samples (OSS =23), and substantially lower than the combined Norway/Sweden samples (OSS =34). Additionally, the present probability sample also confirmed that regions within the Portugal mainland held similar attitudes, confirming what has been showed in three different regions of Bosnia & Herzegovina, Italy, and Norway (St. Louis, Sønsterud, et al., 2016). The authors of the European study acknowledged that variation in sampling schemes may have influenced their results; however, it is extremely unlikely that the large differences (i.e., between the Scandinavian countries and Italy) were due to sampling differences. Given that demographic variables such as sex, age, SES did not predict the rank orders of ratings among the five countries or areas, national identity was suggested as a likely predictor variable. The authors did not speculate on how national identity might affect attitudes, i.e., why the Italian attitudes were substantially less positive than the other four countries and why the Scandinavian attitudes were substantially more positive. The current study does not address the question either; yet, it further brings into focus the need to include a measure of national identity (e.g., the International Social Survey [Rusciano, 2003]) in public attitude studies in different countries or perhaps measures of identity within countries. Comparing to other samples within countries, Portuguese attitudes were similar to the four tribal groups of American Indians (Beste-Guldborg et al., 2015 wherein OSSs ranged from 17 to 24. They were also similar to attitudes of adults sampled in six different regions of Poland (OSS =18) (Przepiórka et al., 2013). As noted, most studies utilizing the POSHA–S have employed convenience sampling methodology. Only one study in Turkey compared probability sampling of adults using a public school-based cluster sampling scheme with a previous study using convenience sampling in Eskişehir, Turkey (Özdemir et al., 2011a, 2011b). Whereas OSSs were similar, the profiles of the various components and subscores were markedly different using the different sampling methods, leading the authors to conclude that probability sampling was the preferred procedure. Comparing the Portuguese results to adults in the two different probability samples (Özdemir et al., 2011b), summary stuttering attitudes for Portugal (OSS =19) were more positive than those for Turkey (OSS =−2 and OSS =4). Of course, the Turkish studies were not attempting to generalize to an entire country, but demographic difference were likely important determinants for the differences observed from the current study. School-based samples are likely effective and efficient strategies to generate probability samples in specified areas, but country differences in public versus private schools, socio-economic influences on school populations, sizes and grade level included in school, and other factors such as access to schools in an increasingly dangerous world limit their use. By contrast, the current study confirms that in countries such as Portugal where adults are obliged to visit various local governmental offices for a wide variety of necessary life functions, a local administrative office-based sampling model provides an attractive, relatively inexpensive strategy to carry out probability sampling of adults in an entire country where these or similar government offices exist. The results of this study can be compared to results of three items of the Van Borsel et al. (1999), Pereira et al. (2008), and Xing Ming et al. (2001) studies in Belgium, Brazil, and China related to knowing a person who stutter and the cause of stuttering. Compared to 82% of the Flemish respondents, 85% of the Chinese respondents, and 68% of the Brazilian respondents who had heard of or met a person who stutters, 79% of the Portuguese respondents identified an acquaintance, close friend, relative, or someone else who stuttered. Nearly half (45%) of the Flemish respondents believed the cause of stuttering to be psychogenic, compared to 57% of the Brazilians but only 15% of the Chinese. Forty-four percent of the Portuguese respondents marked “yes” that stuttering was caused by a very frightening event. By contrast, for genetic etiology, 70% of the Belgium respondents, 69% of the Brazilian respondents, and 77% of the Chinese respondents thought that stuttering was not hereditary. This corresponds to a “no” answer to the question for 63% of the Portuguese respondents. The results suggest that the Portugal local office-based sampling procedure yielded reasonably similar results to the face-to-face interviews on the street in three cities in other countries. Taken together, the comparisons of the current respondents with Portuguese census data and the comparison of Portuguese attitudes with other studies of stuttering attitudes around the world indicate that the administrative office-based sampling scheme is an effective way to sample attitudes in an entire country. As such, the POSHA–S results for Portugal can be considered to be the most representative profile of public attitudes toward stuttering available for any country to date and arguably a “gold standard” estimate for Portuguese beliefs and self reactions regarding stuttering. 4.4 Demographic predictors of stuttering attitudes Numerous studies have attempted to explain differences in attitudes toward stuttering related to various demographic variables. In a detailed review of potential predictors (or correlates) of POSHA–S-measured attitudes, St. Louis (2015a,b) considered such variables as familiarity with stuttering, sex, age, socio-economic status (mostly likely manifested as education, occupation, and income), geography (continent or country), language of the questionnaire, and religion. Geography, education, familiarity with stuttering appeared to emerge the most frequently from published and unpublished POSHA–S studies. The current study did document that respondents characterized by younger or middle age, university education, living in the island regions of Portugal, not being retired, and speaking at least three different languages were all associated with more positive attitudes. By contrast, respondents’ sex, marital status, and parental status were not. It should be noted that sex of the respondent has been mentioned often as a predictor of stuttering attitudes, perhaps because one of the first studies to consider it found a significant difference (Burley & Rinaldi, 1986). In fact, the study sampled only 10 male and 10 female respondents. Like Burley and Rinaldi (1986), some studies have shown better attitudes for females than males, especially those with very large sample sizes (e.g., Arnold, Li, & Goltl, 2015; Li & Arnold, 2015). Such studies typically have very small effect sizes, raising questions of how the findings might best be interpreted. Careful studies using the POSHA–S have shown, as the current study did, that sex of the respondent did not make a difference in the attitudes of adults toward stuttering (St. Louis, 2012a; St. Louis, LeMasters, & Poormohammad, 2015). Supporting the lack of relationship between Portuguese parental status and attitudes, a recent study by St. Louis, Weidner, and Mancini (2016) revealed that parents of young children, parents of older children or adult children, and non-parents held very similar attitudes on the Appraisal of the Stuttering Environment (ASE), a clinical instrument that is very similar to the second experimental version of the POSHA–S. More positive stuttering attitudes were associated with achieving higher levels in education, and less positive attitudes were associated with the ≥65yr age group. Comparisons with the two aforementioned probability samples in Turkey using the POSHA–S (Özdemir et al., 2011b), might shed light on these findings. The mean Portuguese age for the 311 respondents was 46 yr compared to 12 yr for the Turkish children, 37 and 38 yr for the parents, 45 and 62 yr for the grandparents/adult relatives (with far more aunts and uncles and far fewer grandparents in the first sample), and 35 and 36 yr for the neighbors. Mean years of school completed in Portugal was 10.3 yr and in Eskişehir, Turkey, 5.0 and 5.0 yr (children), 7.1 and 7.3 yr (parents), 4.8 and 7.0 yr (grandparents/adult relatives), and 7.6 and 8.2 yr (neighbors). It would be reasonable to assume that the differences in education would explain the much less positive attitudes in Eskişehir, Turkey compared to Portugal. However, the lack of large differences in attitudes as a function of age in the Turkish sample suggests that age, per se, might not be a universal predictor of stuttering attitudes. Our analyses suggested that less knowledge of stuttering was an important factor in the older Portuguese age group, but the weighted POSHA–S item for personal experience with stuttering of the groups was −86 for Portugal in comparison to −87 to −92 for Eskişehir, Turkey, or not much different. Speaking more than one language positively influenced the attitudes toward people who stutter in Portugal. Comparisons across samples in the POSHA–S database have not been carried out, so at this point we cannot explain why multilingualism appears to be associated with more positive stuttering attitudes. Though only significant for one versus three languages known, the means in Table 2 suggest that Self Reactions were most different between one or two languages known versus three or four. Different results have also been reported. St. Louis and Roberts (2010) compared Canadian and Cameroonian respondents taking an experimental version of the POSHA–S either in English or French. Importantly, both are official languages in Canada and Cameroon. A control group of monolingual USA respondents taking the POSHA–S English held attitude ratings much more similar to the Canadians than the Cameroonians, irrespective of the latter groups’ knowledge and use of other languages. As it was mentioned in Section 4.1, the current study showed that stuttering attitudes in the Portuguese mainland regions were quite similar. However, statistical significance of the region variable related to the better attitudes in the small island regions of Azores suggest that different factors could have influenced a higher score of the Self Reactions to people who stutter in this region which accounts for less than 5% of the country's population. These predictor findings suggest that future studies of public attitudes adults in circumscribed regions consider age, education, work status, and number of languages known as covariates. Additionally, this study adds support to previous research showing that respondents’ sex, parental status, or marital status are not consistent predictors of better or worse attitudes. 4.5 Strengths, limitations, and future research We have suggested that the care and controls employed in this study which employed a three-stage cluster probability study of the entire country of Portugal arguably have generated the most valid estimate of stuttering attitudes in any single country to date. This is supported by the generally similar percentages of adults in the study versus in the population census summaries. Accordingly, the study's results have substantial potential value in efforts to improve attitudes in Portugal as well as in validation of results from a host of convenience samples in other countries. The methodology of the study can serve as a model for future studies as well. In spite of these strengths, limitations or cautions must be mentioned. First, whereas the return rate was determined to be satisfactory (Babbie, 2006), nearly one half of the individuals handed a questionnaire by staff members at the local administrative offices did not return them. It is possible that those who did not fill them out would have held attitudes different than those who did. If so, then the generalizability would be limited the “typical” individual who not only avails him or herself to the functions of the office but also those who would be likely to fill out a questionnaire that they did not expect to receive. This is similar to questions that could be raised about virtually any study. For example, were the persons on one main street on a heavy shopping day in Flanders, Shanghai, and Rio de Janiero representative of the average adult in their respective countries (Van Borsel et al., 1999; Pereira et al., 2008; Xing Ming et al., 2001)? A follow-up mixed-method study with interviews of a number of potential respondents who did and did not complete the questionnaire would be one way to estimate the effect of such potential selection bias. Additionally and possibly related to the same sampling issue, the alignment of the percentages of respondents in this study with Portuguese census, although generally close, is far from perfect. The regions of Alentejo and Center regions of the country are somewhat over-represented while the North and Lisbon regions are under-represented. Similarly, the 18–24 age group is over-represented, and the 25–64 group is under-represented. This is likely not a serious issue given that the only significant differences which occurred between age groups were between these two younger groups and the ≥65 age group (with this older age group holding the more negative attitudes). It is not clear whether these differences are due to factors related to whether or not potential respondents filled out questionnaires or to who would be more or less likely to visit their local administrative office. We suspect that the latter explanation is the most tenable. Results of the current study suggest several research projects that should be carried out. First, a similar, though not necessarily identical probability sampling procedure should be carried out consistently in several different countries to determine the extent to which probability sampling can distinguish differences between countries as convenience sampling has. If Portugal, Italy, and a Scandinavian country could be included, along with a carefully selected measure of national (or regional) identity, the reasons behind the differences that have been observed between countries might be elucidated. In this process, schemes for probability sampling, beyond the local administrative offices scheme in Portugal and randomly selected schools scheme in Turkey, could be advanced and tested. It is possible that the population of Portugal is more homogeneous than populations of some other countries, such as the USA. If so then yet-to-be tested schemes for probability sampling of stuttering attitudes might be more appropriate in such countries. Second, in probability or convenience sampling with substantial sample sizes, additional predictors of positive and negative stuttering attitudes should be sought. Knowledge of and acquaintance with stuttering is one such predictor that past research has shown to be ambiguous. Third, smaller, convenience samples in Portugal of the general public, or specific occupational groups, should be carried out and compared with the results of the current study to determine when and where probability sampling is required or not required. Fourth, studies should be undertaken in Portugal that attempt to improve public attitudes. Finally, considering the large number of studies that have documented negativity in public attitudes toward stuttering (see reviews by Boyle & Blood, 2015; Hughes, 2015; St. Louis, 2015a,b), one can wonder if additional studies add meaningful information. Agreeing with St. Louis, Sønsterud, et al. (2016) and St. Louis, Weidner, and Mancini (2016), we submit that so long as unexplained, disparate findings are forthcoming, as in differences in attitudes in Italy versus other European countries, continued search for relevant predictor variables are warranted. Acknowledgements This research was partially funded by National Funds through FCT (Foundation for Science and Technology) in the context of the projects UID/MAT/04106/2013, UID/CEC/00127/2013 and Incentivo/EEI/UI0127/2014. It was also partly supported by a doctoral grant (SFRH/BD/78311/2011) from FCT to the first author. The authors are grateful to Ana Félix, Cristiana Silva, Daniela Perdigão, Elisabete Sousa, Maria Ercília Fernandes, Raquel Silva, Susana Rodrigues and Teresa Carvalho to their exceptional contribution to this research study. Appendix A Supplementary data Supplementary data associated with this article can be found, in the online version, at Appendix A Supplementary data The following are the supplementary data to this article: References Al-Khaledi et al., 2009 M. Al-Khaledi M. Lincoln P. McCabe A. Packman T. Alshatti The attitudes, knowledge and Beliefs of Arab parents in Kuwait about stuttering Journal of Fluency Disorders 34 2009 44 59 Arnold et al., 2015 H.S. Arnold J. Li K. Goltl Beliefs of teachers versus non-teachers toward people who stutter Journal of Fluency Disorders 43 2015 28 39 Aydın, 2008 Ç. Aydın Kekemeliğe yönelik toplumsal farkındalığın belirlenmesi [Determining awareness toward stuttering] M.Sc. thesis 2008 Anadolu University Eskişehir, Turkey unpublished Babbie, 2006 E. Babbie The practice of social research 11th ed. 2006 Wadsworth Publishing Belmont Beaton et al., 1998 Beaton, D. E., Bombardier, C., Guillemin, F., & Ferraz, M. B. (1998). Recommendations for the Cross-Cultural Adaptation of Health Status Measures. Rosemont: American Academy of Orthopedaedic Surgeons and Institute for Work & Health. Beste-Guldborg et al., 2015 A.M. Beste-Guldborg K.O. St. Louis N. Campanale American Indian perceptions of stuttering K.O. St. Louis Stuttering meets stereotype, stigma, and discrimination: An overview of attitude research. 2015 West Virginia University Press Morgantown, WV 133 145 Bloodstein and Ratner., 2008 O. Bloodstein N. Ratner A Handbook on Stuttering 6th ed. 2008 O. Delmar Learning Clifton Park, NY Boyle, 2013 M.P. Boyle Assessment of stigma associated with stuttering: Development and evaluation of the Self-Stigma of Stuttering Scale (4S) Journal of Speech, Language and Hearing Research 56 2013 1517 1529 Boyle and Blood, 2015 M.P. Boyle G.W. Blood Stigma and stuttering: Conceptualizations, applications, and coping K.O. St. Louis Stuttering meets stereotype, stigma, and discrimination: An overview of attitude research 2015 West Virginia University Press Morgantown, WV 43 71 Burley and Rinaldi, 1986 P.M. Burley W. Rinaldi Effects of sex of listener and of stutterer on ratings of stuttering speakers Journal of Fluency Disorders 17 1986 329 333 Cooper and Cooper, 1996 E.B. Cooper C.S. Cooper Clinician attitudes towards stuttering: Two decades of change Journal of Fluency Disorders 21 1996 119 135 Çoşkun, 2006 M. Çoşkun Kekemelik ve hızlı-bozuk konuşma hakkında farkındalığın betimlenmesi [Describing awareness about stuttering and cluttering] 2006 Anadolu University Eskişehir, Turkey Crowe and Cooper, 1977 T.A. Crowe E.B. Cooper Parental attitudes toward and knowledge of stuttering Journal of Communication Disorders 10 1977 343 357 Crowe and Cooper, 1983 T.A. Crowe E.B. Cooper Vocational rehabilitation counselors’ attitudes toward stuttering Journal of Fluency Disorders 8 1983 13 27 Crowe and Walton, 1981 T.A. Crowe J.H. Walton Teacher attitudes toward stuttering Journal of Fluency Disorders 6 1981 163 174 Daly and Leahy, 2014 C. Daly M. Leahy Public attitudes towards stuttering: An epidemiological study of an Irish population 2014 European Symposium on Fluency Disorders Antwerp, Belgium Doody et al., 1993 I. Doody J. Kalinowski J. Armson A. Stuart Stereotypes of stutterers and nonstutterers in three rural communities in Newfoundland Journal of Fluency Disorders 18 1993 363 373 Dorsey and Guenther, 2000 M. Dorsey R.K. Guenther Attitudes of professors and students toward college students who stutter Journal of Fluency Disorders 25 2000 77 83 Evans et al., 2008 D. Evans E.C. Healey N. Kawai S. Rowland Middle School students’ perceptions of a peer who stutter Journal of Fluency Disorders 33 2008 203 219 Field, 2013 A. Field Discovering statistics using IBM SPSS Statistics 4th ed. 2013 Sage Publications London Flynn and St. Louis, 2011 T.W. Flynn K.O. St. Louis Changing adolescent attitudes toward stuttering Journal of Fluency Disorders 36 2011 110 121 Goffman, 1963 E. Goffman Stigma: Notes on management of a spoiled identity 1963 Prentice-Hall Englewood Cliff, NJ Griffin and Leahy, 2007 M. Griffin M.M. Leahy Young children's (3–5 year old) perceptions of a dysfluent speaker J. Au-Yeung M.M. Leahy Proceedings of fluency disorders 2007 The International Fluency Association Dublin, Ireland 217 222 Guillemin et al., 1993 F. Guillemin C. Bombardier D.E. Beaton Cross-cultural adaptation of health-related quality of life measures: literature review and proposed guidelines Journal of Clinical Epidemiology 46 12 1993 1417 1432 Hartford and Leahy, 2007 E. Hartford M.M. Leahy The perceptions of primary school children of a person who stutters J. Au-Yeung M.M. Leahy Proceedings of fluency disorders 2007 The International Fluency Association Dublin, Ireland 217 222 Hughes, 2015 S. Hughes Attitudes toward stuttering: An annotated bibliography K.O. St. Louis Stuttering meets stereotype, stigma, and discrimination: An overview of attitude research 2015 West Virginia University Press Morgantown, WV 310 350 Ip et al., 2012 M.L. Ip K.O. St. Louis F.L. Myers S. An Xue Stuttering attitudes in Hong Kong and Mainland China International Journal of Speech-Language Pathology 14 2012 543 556 Junuzović-Žunić et al., 2015 L. Junuzović-Žunić M.E. Weidner I.K. Reichel S. Cook K.O. St. Louis M.B. Ware Effects of fluency disorders coursework on students’ stuttering attitudes in two countries K.O. St. Louis Stuttering meets stereotype, stigma, and discrimination: An overview of attitude research 2015 West Virginia University Press Morgantown, WV 226 242 Kirsch, 2006 D.I. Kirsch Adolescent perceptions of their peers who stutter. 2006 University of Oregon Eugene Unpublished Ph.D. Thesis Lass et al., 1989 N.J. Lass D.M. Ruscello M. Pannbacker J.F. Schmitt D.S. Everly-Myers Speech-language pathologists’ perceptions of child and adult female and male stutterers Journal of Fluency Disorders 14 1989 127 134 Lass et al., 1994 N.J. Lass D.M. Ruscello M. Pannbacker J.F. Schmitt A.M. Kiser A.M. Mussa P. Lockhart School administrators’ perceptions of people who stutter Language, Speech, and Hearing Services in Schools 25 1994 90 93 Lass et al., 1992 N.J. Lass D.M. Ruscello J.F. Schmitt M.D. Pannbacker M.B. Orlando K.A. Dean J.C. Rusizka K.H. Bradshaw Teachers’ perceptions of stutterers Language, Speech, and Hearing Services in Schools 23 1992 78 81 Li and Arnold, 2015 J. Li H. Arnold Reactions of teachers versus non-teachers toward people who stutter Journal of Communication Disorders 56 2015 8 18 MacKinnon et al., 2007 S.P. MacKinnon S. Hall P.D. MacIntyre Origins of the stuttering stereotype: Stereotype formation through anchoring-adjustment Journal of Fluency Disorders 32 2007 297 309 Nillson and Wetterling, 2013 S. Nillson T. Wetterling Try to relax” – A survey study in Sweden among native Swedes and Arabic immigrants concerning views on stuttering M.Sc. thesis 2013 Lund University Lund, Sweden unpublished Özdemir et al., 2011a R.S. Özdemir K.O. St. Louis S. Topbaş Public attitudes toward stuttering in Turkey: Probability versus convenience sampling Journal of Fluency Disorders 36 2011 262 267 Özdemir et al., 2011b R.S. Özdemir K.O. St. Louis S. Topbaş Stuttering attitudes among Turkish family generations and neighbors from representative samples Journal of Fluency Disorders 36 2011 318 333 Pereira et al., 2008 M.M.B. Pereira J.P. Rossi J.V. Borsel Public awareness and knowledge of stuttering in Rio de Janeiro Journal of Fluency Disorders 33 2008 24 31 Przepiórka et al., 2013 A. Przepiórka A. Błachnio K.O. St. Louis T. Woźniak Public attitudes toward stuttering in Poland International Journal of Language and Communication Disorders 48 2013 703 714 Ruscello et al., 1994 D.M. Ruscello N.J. Lass J.F. Schmitt M.D. Pannbacker Special educators’ perceptions of stutterers Journal of Fluency Disorders 19 1994 125 132 Rusciano, 2003 F.L. Rusciano The construction of national identity – A 23-nation study Political Research Quarterly 56 2003 361 366 St. Louis, 2011 K.O. St. Louis The Public Opinion Survey of Human Attributes-Stuttering (POSHA-S): Summary framework and empirical comparisons Journal of Fluency Disorders 36 2011 256 261 St. Louis, 2012a K.O. St. Louis Male versus female attitudes toward stuttering Journal of Communication Didorders 45 2012 246 253 St. Louis, 2012b K.O. St. Louis Research and development on a public attitude instrument for stuttering Journal of Communication Didorders 46 2012 129 146 St. Louis, 2012c K.O. St. Louis POSHA–S public attitudes toward stuttering: Online versus paper surveys Canadian Journal of Speech-Language Pathology and Audiology 36 2012 116 122 St. Louis, 2015a K.O. St. Louis Epidemiology of public attitudes toward stuttering K.O. St. Louis Stuttering meets stereotype, stigma, and discrimination: An overview of attitude research 2015 West Virginia University Press Morgantown, WV 7 42 St. Louis, 2015b K.O. St. Louis Worldwide perspectives on public and professional attitudes toward fluency disorders Invited keynote address at the 8th World Congress of the International Fluency Association Lisbon, Portugal 2015 July St. Louis et al., 2005 K.O. St. Louis C.R. de Andrade D. Georgieva F.O. Troudt Experience and personal report about an international cooperation research – Brazil, Bulgaria and Turkey – Attitudes Toward Stuttering Pró-Fono 3 2005 413 416 St. Louis et al., 2015 K.O. St. Louis S.N. LeMasters Poormohammad Public attitudes toward males versus females who stutter: United States and Iran K.O. St. Louis Stuttering meets stereotype, stigma, and discrimination: An overview of attitude research 2015 West Virginia University Press Morgantown, WV 165 177 St. Louis et al., 2009a K.O. St. Louis B.B. Lubker J.S. Yaruss E.F. Aliveto Development of a prototype questionnaire to survey public attitudes toward stuttering: Reliability of the second prototype Contemporary Issues in Communication Science and Disorders 36 2009 101 107 St. Louis et al., 2008 K.O. St. Louis B.B. Lukber J.S. Yaruss T.A. Adkins J.C. Pill Development of a prototype questionnaire to survey public attitudes toward stuttering: Principles and methodologies in the first prototype The Internet Journal of Epidemiology 5 2 2008 St. Louis et al., 2014a K.O. St. Louis A.M. Przepiórka A. Beste-Guldborg M.J. Williams A. Błachnio J. Guendouzi I.K. Reichel M.B. Ware Stuttering attitudes of students: Professional, intracultural, and international comparisons Journal of Fluency Disorders 39 2014 34 50 St. Louis et al., 2009b K.O. St. Louis I. Reichel J.S. Yaruss B.B. Lubker Construct and concurrent validity of a prototype questionnaire to survey public attitudes toward stuttering Journal of Fluency Disorders 34 2009 11 28 St. Louis and Roberts, 2010 K.O. St. Louis P.M. Roberts Measuring attitudes toward stuttering: English-to-French translations in Canada and Cameroon Journal of Communication Disorders 43 2010 361 377 St. Louis et al., 2014b K.O. St. Louis H. Sønsterud E.J. Carlo R.R. Heitmann H. Kvenseth Public attitudes toward—and identification of—cluttering and stuttering in Norway and Puerto Rico Journal of Fluency Disorders 42 2014 21 34 St. Louis et al., 2016a K.O. St. Louis H. Sønsterud L. Junuzovic D. Tomaiuoli F. Del Gado E. Caparelli M. Theiling C. Flobakk L.N. Helmen R.R. Heitmann H. Kvenseth S. Nilsson T. Wetterling C. Lundström C. Daly M. Leahy L. Tyrell D. Ward M. Węsierska Public attitudes toward stuttering in Europe: Within-country and between-country comparisons Journal Communication Disorders 62 2016 115 130 St. Louis et al., 2016b K.O. St. Louis M.E. Weidner T.M. Mancini Comparing parents’ and young children's attitudes toward stuttering Journal of Speech Pathology & Therapy 1 2016 104 10.4172/jspt.1000104 St. Louis et al., 2014c K.O. St. Louis M.J. Williams M.B. Ware J. Guendouzi I. Reichel The Public Opinion Survey of Human Attributes–Stuttering (POSHA–S) and Bipolar Adjective Scale (BAS): Aspects of validity Journal of Communication Disorders 50 2014 36 50 Theiling, 2013 M. Theiling Öffentliche Wahrnehmung von Stotternden in Deutschland –Erprobung und Validierung der deutschen Version des POSHA-S [Public perception of people who stutter in Germany – Testing and validation of the German version of the POSHA–S] M.Sc. thesis 2013 RWTH Aachen University Aachen, Germany unpublished Thompson, 2012 Thompson, S. (2012). Sampling. Wiley. Tomaiuloi et al., 2013 D. Tomaiuloi F. Del Gado E. Capparelli K.O. St. Louis Stuttering attitudes in Italy 29th world congress of the International Association of Logopedics and Phoniatrics Turin, Italy 2013 August Tyrrell, 2009 L. Tyrrell A comparison of the attitudes, knowledge and beliefs about stuttering in British university students living in the UK and Syrian university students living in Syria M.Sc. thesis 2009 University of Reading Speech & Language Pathology, Reading, UK unpublished Valente et al., 2015 A.R.S. Valente L.M.T. Jesus M.T. Roberto M.M. Leahy K.O. St. Louis Cross-cultural adaptation of the Public Opinion Survey of Human Attributes–Stuttering (POSHA–S): The European Portuguese (EP) translation and adaptation process as a model D. Santiago Stuttering: Risk factors, public attitudes and impact on psychological well-being 2015 Nova Science Publishers Hauppaguge, NY 93 110 Van Borsel et al., 1999 J. Van Borsel I. Verniers S. Bouvry Public awareness of stuttering Folia Phoniatrica Logopaedica 51 1999 124 132 Węsierska et al., 2015a K. Węsierska A. Błachnio A. Przepiórka K.O. St. Louis Zmiana postaw wobec jąkania w Polsce – wstępne doniesienia z badań [Changing attitudes towards stuttering in Poland: Preliminary study report] Paper presented at the international conference on speech-language therapy: Modern trends in logopaedic diagnosis and therapy Chorzów, Poland 2015 October Węsierska et al., 2015b K. Węsierska M. Węsierska K.O. St. Louis A. Beste-Guldborg A comparison of attitudes towards stuttering between Polish SLPs and SLP students using the POSHA–S K.O. St. Louis Stuttering meets stereotype, stigma, and discrimination: An overview of attitude research 2015 West Virginia University Press Morgantown, WV 216 225 Węsierska and St. Louis, 2014 M. Węsierska K.O. St. Louis Comparison of attitudes towards stuttering among Polish and English university students Chowanna 42 2014 263 284 Xing Ming et al., 2001 J. Xing Ming Z. Jing Z. Yi Wen J. Van Borsel Public awareness of stuttering in Shanghai, China Logopedics Phoniatrics Vocology 26 2001 145 150 Yairi and Williams, 1970 E. Yairi D.E. Williams Speech clinicians’ stereotypes of elementary-school boys who stutter Journal of Communication Disorders 3 1970 161 170 Yeakle and Cooper, 1986 M.K. Yeakle E.B. Cooper Teacher perceptions of stuttering Journal of Fluency Disorders 11 1986 345 359 Ana Rita S. Valente, Ph.D. student at University of Aveiro. Received the M.Sc. degree in speech and hearing sciences in 2009 from the University of Aveiro, Aveiro, Portugal. Her current research interests include the multidimensional assessment of stuttering. Kenneth O. St. Louis, Ph.D., founder of IPATHA (International Project on Attitudes Toward Human Attributes), has conducted research on attitudes of clinicians and the general public toward stuttering and other potentially stigmatizing conditions. He has published and presented widely on aspects of stuttering and cluttering for more than 40 years. Margaret M. Leahy, Associate Professor, Trinity College Dublin, is a fluency specialist. Her current research interests involve the application of Narrative Therapy to stuttering; attitudes and attitude change in stuttering; and the education of therapists. Andreia Oliveira Hall, Ph.D. in Probability and Statistics, is Assistant Professor at the Mathematics Department of the University of Aveiro since 2005. She is interested in Mathematical Education, Mathematics and the Arts, and Statistical Data Analysis. She teaches Mathematics for future Primary School teachers and has given several continuing learning courses for teachers from 1st to 12th grades. She is the local coordinator of the Mathematical Circus Project which promotes the interest in mathematics through shows of mathematical magic. She also collaborates with the School of Health Sciences at the University of Aveiro, mostly in the analysis of sound and speech disorders data. Luis M.T. Jesus received his first degree in 1996 from the University of Aveiro, Portugal, the M.Sc. degree in Speech Coding and Synthesis in 1997 from the University of East Anglia, Norwich, UK, and the Ph.D. degree in Acoustic Phonetics in 2001 from the University of Southampton, UK. Since 2001, he has been lecturing at the School of Health Sciences (ESSUA), University of Aveiro, and has been a member of the Institute of Electronics and Informatics Engineering of Aveiro (IEETA), University de Aveiro, Portugal. His research interests include phonetics, speech production and perception, speech production models, and human communication pathology. He is a member of the The Acoustical Society of America (ASA), International Phonetic Association (IPA) and International Speech Communication Association (ISCA). "
    },
    {
        "doc_title": "Is the Portuguese version of the passage 'The North Wind and the Sun' phonetically balanced?",
        "doc_scopus_id": "84927166075",
        "doc_doi": "10.1017/S0025100314000255",
        "doc_eid": "2-s2.0-84927166075",
        "doc_date": "2015-03-30",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Language and Linguistics",
                "area_abbreviation": "ARTS",
                "area_code": "1203"
            },
            {
                "area_name": "Anthropology",
                "area_abbreviation": "SOCI",
                "area_code": "3314"
            },
            {
                "area_name": "Linguistics and Language",
                "area_abbreviation": "SOCI",
                "area_code": "3310"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© International Phonetic Association.There is no standard phonetically balanced short passage for Portuguese research and clinical practice. This paper presents results of a novel analysis of 'The North Wind and the Sun' (NWS) passage that aims to determine if it is phonetically balanced for European Portuguese (EP) and Brazilian Portuguese (BP), based on new transcriptions resulting from algorithms developed for grapheme-phone transcription in these two varieties of Portuguese. These algorithms (based on standard EP and São Paulo BP varieties) are the same as those used to collect the frequency data, which is central to determining if a text is phonetically balanced. Results showed that neither transcription violates phonotactic rules, i.e. permissible combinations of speech sounds. The NWS is not phonetically balanced for BP if the phonemes are considered individually but is evenly distributed in terms of manner of articulation. The EP version of the NWS passage is a phonetically balanced text for EP.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Cross-cultural adaptation of the public opinion survey of human attributes (posha-s): The European portuguese (EP) translation and adaptation process as a model",
        "doc_scopus_id": "85015640632",
        "doc_doi": null,
        "doc_eid": "2-s2.0-85015640632",
        "doc_date": "2015-01-01",
        "doc_type": "Book Chapter",
        "doc_areas": [
            {
                "area_name": "Medicine (all)",
                "area_abbreviation": "MEDI",
                "area_code": "2700"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© 2015 by Nova Science Publishers, Inc. All rights reserved.Purpose: To describe the cross-cultural adaptation process of the Public Opinion Survey of Human Attributes (POSHA-S) to European Portuguese (EP). The POSHA-S was developed by the International Project on Atitudes Toward Human Attributes (IPATHA) to measure the public attitudes toward stuttering and people who stutter. The POSHA-S was created to be used internationally, through translation into other languages. Method: The EP translation and adaptation process followed five steps: 1) production of two forward translations; 2) synthesis of the translations; 3) production of two back-translations based on the synthesised version; 4) multidisciplinary expert committee review to develop the pre-final version; 5) cognitive debriefing of the new translation. To assess the agreement between the judges during the cognitive debriefing phase, a modified Bland and Altman (1986) method (Jesus, Valente and Hall 2015, pp. 4-5) was used. Results and discussion: Two forward translations were produced and syntesised by the two translators. Two back-translations were produced by two persons with English as mother tongue. The expert commitee revised the documents in terms of semantic and idiomatic content and conceptual equivalence; the level of agreement was high and discrepancies were solved through a decentering technique. Eight discrepancies relating to the POSHA-S instructions and seven discrepancies with regard to the items were solved. The pre-final version of the POSHA-S in EP was filled in by five native speakers of the translated language and similar to the target population of the assessment tool. Five individuals completed a questionnaire relating to relevance, clarity, simplicity and accuracy of instructions and items, using a visual analogue scale (VAS). The Bland and Altman method revealed that there was one item about which the judges did not agree (simplicity of instructions). The POSHA-S EP version presented good cross-cultural equivalence. Conclusions: The exhaustive traslation and adaptation process of POSHA-S’ original version into EP can be considered a good model to guarantee the equivalence and sensibility of the translated tool, in order to allow comparisons between the attitudes of the general Portuguese public and the total sample of POSHA-S.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Event- and interval-based measurement of stuttering: A review",
        "doc_scopus_id": "84923106509",
        "doc_doi": "10.1111/1460-6984.12113",
        "doc_eid": "2-s2.0-84923106509",
        "doc_date": "2015-01-01",
        "doc_type": "Review",
        "doc_areas": [
            {
                "area_name": "Language and Linguistics",
                "area_abbreviation": "ARTS",
                "area_code": "1203"
            },
            {
                "area_name": "Linguistics and Language",
                "area_abbreviation": "SOCI",
                "area_code": "3310"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            }
        ],
        "doc_keywords": [
            "Behavior Therapy",
            "Child",
            "Humans",
            "Observer Variation",
            "Reproducibility of Results",
            "Speech Production Measurement",
            "Speech Therapy",
            "Stuttering"
        ],
        "doc_abstract": "© 2014 Royal College of Speech and Language Therapists.Background Event- and interval-based measurements are two different ways of computing frequency of stuttering. Interval-based methodology emerged as an alternative measure to overcome problems associated with reproducibility in the event-based methodology. No review has been made to study the effect of methodological factors in interval-based absolute reliability data or to compute the agreement between the two methodologies in terms of inter-judge, intra-judge and accuracy (i.e., correspondence between raters' scores and an established criterion). Aims To provide a review related to reproducibility of event-based and time-interval measurement, and to verify the effect of methodological factors (training, experience, interval duration, sample presentation order and judgment conditions) on agreement of time-interval measurement; in addition, to determine if it is possible to quantify the agreement between the two methodologies Methods & Procedures The first two authors searched for articles on ERIC, MEDLINE, PubMed, B-on, CENTRAL and Dissertation Abstracts during January-February 2013 and retrieved 495 articles. Forty-eight articles were selected for review. Content tables were constructed with the main findings. Main Contribution Articles related to event-based measurements revealed values of inter- and intra-judge greater than 0.70 and agreement percentages beyond 80%. The articles related to time-interval measures revealed that, in general, judges with more experience with stuttering presented significantly higher levels of intra- and inter-judge agreement. Inter- and intra-judge values were beyond the references for high reproducibility values for both methodologies. Accuracy (regarding the closeness of raters' judgements with an established criterion), intra- and inter-judge agreement were higher for trained groups when compared with non-trained groups. Sample presentation order and audio/video conditions did not result in differences in inter- or intra-judge results. A duration of 5 s for an interval appears to be an acceptable agreement. Explanation for high reproducibility values as well as parameter choice to report those data are discussed. Conclusions & Implications Both interval- and event-based methodologies used trained or experienced judges for inter- and intra-judge determination and data were beyond the references for good reproducibility values. Inter- and intra-judge values were reported in different metric scales among event- and interval-based methods studies, making it unfeasible to quantify the agreement between the two methods.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Validity and reliability of the european-portuguese preschool language assessment alpe",
        "doc_scopus_id": "84908173381",
        "doc_doi": "10.1159/000365354",
        "doc_eid": "2-s2.0-84908173381",
        "doc_date": "2014-03-19",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Language and Linguistics",
                "area_abbreviation": "ARTS",
                "area_code": "1203"
            },
            {
                "area_name": "Linguistics and Language",
                "area_abbreviation": "SOCI",
                "area_code": "3310"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            },
            {
                "area_name": "LPN and LVN",
                "area_abbreviation": "NURS",
                "area_code": "2912"
            }
        ],
        "doc_keywords": [
            "Child, Preschool",
            "Female",
            "Humans",
            "Language Development Disorders",
            "Language Tests",
            "Male",
            "Observer Variation",
            "Portugal",
            "Psychology, Child",
            "Reproducibility of Results"
        ],
        "doc_abstract": "© 2014 S. Karger AG, Basel.Background/Aims: To design and standardize the Preschool Language Test (Teste de Linguagem-Avaliação da Linguagem Pré-Escolar, TL-ALPE) which assesses European Portuguese (EP)-speaking children's receptive and expressive language abilities. Methods: To standardize TL-ALPE, data was collected on 817 EP-speaking children aged 3 years and 0 months to 5 years and 12 months. The standardization, validity and reliability procedures of TL-ALPE followed the standard recommendations. Results: TL-ALPE presented a strong cohesion (internal consistency, >80%) and strong inter- and intrajudge reliability (>90%). The content validity was verified by the description of instrument domain and the items. The construct validity of TL-ALPE was confirmed by the proportional increase in mean score values with age for both receptive and expressive abilities. The results of concurrent validity revealed strong correlations between TL-ALPE and other EP preschool language tests for expressive and total language scores. Conclusion: TL-ALPE is a valid and reliable instrument to assess language skills of EP-speaking preschool children.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Phonological and articulation treatment approaches in Portuguese children with speech and language impairments: A randomized controlled intervention study",
        "doc_scopus_id": "84874884090",
        "doc_doi": "10.1111/j.1460-6984.2012.00191.x",
        "doc_eid": "2-s2.0-84874884090",
        "doc_date": "2013-03-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Language and Linguistics",
                "area_abbreviation": "ARTS",
                "area_code": "1203"
            },
            {
                "area_name": "Linguistics and Language",
                "area_abbreviation": "SOCI",
                "area_code": "3310"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            }
        ],
        "doc_keywords": [
            "Articulation Disorders",
            "Child",
            "Child, Preschool",
            "Female",
            "Humans",
            "Language Development Disorders",
            "Language Tests",
            "Language Therapy",
            "Male",
            "Parents",
            "Phonetics",
            "Portugal",
            "Program Evaluation",
            "Speech",
            "Speech Disorders",
            "Speech Therapy",
            "Treatment Outcome"
        ],
        "doc_abstract": "Background In Portugal, the routine clinical practice of speech and language therapists (SLTs) in treating children with all types of speech sound disorder (SSD) continues to be articulation therapy (AT). There is limited use of phonological therapy (PT) or phonological awareness training in Portugal. Additionally, at an international level there is a focus on collecting information on and differentiating between the effectiveness of PT and AT for children with different types of phonologically based SSD, as well as on the role of phonological awareness in remediating SSD. It is important to collect more evidence for the most effective and efficient type of intervention approach for different SSDs and for these data to be collected from diverse linguistic and cultural perspectives. Aims To evaluate the effectiveness of a PT and AT approach for treatment of 14 Portuguese children, aged 4.0-6.7 years, with a phonologically based SSD. Methods & Procedures The children were randomly assigned to one of the two treatment approaches (seven children in each group). All children were treated by the same SLT, blind to the aims of the study, over three blocks of a total of 25 weekly sessions of intervention. Outcome measures of phonological ability (percentage of consonants correct (PCC), percentage occurrence of different phonological processes and phonetic inventory) were taken before and after intervention. A qualitative assessment of intervention effectiveness from the perspective of the parents of participants was included. Outcomes & Results Both treatments were effective in improving the participants' speech, with the children receiving PT showing a more significant improvement in PCC score than those receiving the AT. Children in the PT group also showed greater generalization to untreated words than those receiving AT. Parents reported both intervention approaches to be as effective in improving their children's speech. Conclusions & Implications The PT (combination of expressive phonological tasks, phonological awareness, listening and discrimination activities) proved to be an effective integrated method of improving phonological SSD in children. These findings provide some evidence for Portuguese SLTs to employ PT with children with phonologically based SSD. © 2012 Royal College of Speech and Language Therapists.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Standardization of a phonetic-phonological test for european-portuguese children",
        "doc_scopus_id": "84865836944",
        "doc_doi": "10.1159/000264712",
        "doc_eid": "2-s2.0-84865836944",
        "doc_date": "2012-10-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Language and Linguistics",
                "area_abbreviation": "ARTS",
                "area_code": "1203"
            },
            {
                "area_name": "Linguistics and Language",
                "area_abbreviation": "SOCI",
                "area_code": "3310"
            },
            {
                "area_name": "Speech and Hearing",
                "area_abbreviation": "HEAL",
                "area_code": "3616"
            },
            {
                "area_name": "LPN and LVN",
                "area_abbreviation": "NURS",
                "area_code": "2912"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "Objective: To develop and standardize a phonetic-phonological test (Teste Fontico-Fonolgico-Avaliao da Linguagem Pr-Escolar, TFF-ALPE) for the assessment of European-Portuguese (EP) children's articulation and phonological abilities. Patients and Methods: In order to standardize TFF-ALPE, 768 children aged 3;0-6;11 participated in this study. The standardization, validity and reliability of TFF-ALPE were analyzed. Results: TFF-ALPE presents strong cohesion and has strong inter- and intrajudge reliability. There was also a strong correlation between the TFF-ALPE data and those obtained in other studies. The content validity was demonstrated by the description of the test domain and the items that comprise TFF-ALPE. Conclusion: TFF-ALPE is a valid and reliable phonetic-phonological assessment instrument that speech-language pathologists can use with EP-speaking children. Copyright © 2012 S. Karger AG, Basel.",
        "available": false,
        "clean_text": ""
    }
]