[
    {
        "doc_title": "Deep Learning for Diagnosis of Alzheimer’s Disease with FDG-PET Neuroimaging",
        "doc_scopus_id": "85129799005",
        "doc_doi": "10.1007/978-3-031-04881-4_8",
        "doc_eid": "2-s2.0-85129799005",
        "doc_date": "2022-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Theoretical Computer Science",
                "area_abbreviation": "MATH",
                "area_code": "2614"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Alzheimer",
            "Alzheimer’s disease",
            "Alzheimer’s disease neuroimaging initiative dataset",
            "Convolutional neural network",
            "FDG PET",
            "FDG-PET neuroimaging",
            "Health services",
            "High costs",
            "Number of peoples"
        ],
        "doc_abstract": "© 2022, Springer Nature Switzerland AG.Alzheimer’s Disease (AD) imposes a heavy burden on health services both due to the large number of people affected as well as the high costs of medical care. Recent research efforts have been dedicated to the development of computational tools to support medical doctors in the early diagnosis of AD. This paper is focused into studying the capacity of Deep Learning (DL) techniques to automatically identify AD based on PET neuroimaging. PET images of the cerebral metabolism of glucose with fluorodeoxyglucose (18 F-FGD) were obtained from the Alzheimer’s Disease Neuroimaging Initiative (ADNI) database. Two DL approaches are compared: a 2D Inception V3 pre-trained model and a custom end-to-end trained 3D CNN to take advantage of the spatial patterns of the full FDG-PET volumes. The results achieved demonstrate that the PET imaging modality is suitable indeed to detect early symptoms of AD. Further to that, the carefully tuned custom 3D CNN model brings computational advantages, while keeping the same discrimination capacity as the exhaustively pre-trained 2D Inception V3 model.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Robot anticipation learning system for ball catching",
        "doc_scopus_id": "85118233491",
        "doc_doi": "10.3390/robotics10040113",
        "doc_eid": "2-s2.0-85118233491",
        "doc_date": "2021-12-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Mechanical Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2210"
            },
            {
                "area_name": "Control and Optimization",
                "area_abbreviation": "MATH",
                "area_code": "2606"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Catching flying objects is a challenging task in human–robot interaction. Traditional techniques predict the intersection position and time using the information obtained during the free-flying ball motion. A common pain point in these systems is the short ball flight time and uncertainties in the ball’s trajectory estimation. In this paper, we present the Robot Anticipation Learning System (RALS) that accounts for the information obtained from observation of the thrower’s hand motion before the ball is released. RALS takes extra time for the robot to start moving in the direction of the target before the opponent finishes throwing. To the best of our knowledge, this is the first robot control system for ball-catching with anticipation skills. Our results show that the information fused from both throwing and flying motions improves the ball-catching rate by up to 20% compared to the baseline approach, with the predictions relying only on the information acquired during the flight phase.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Transfer learning for skin lesion classification using convolutional neural networks",
        "doc_scopus_id": "85116683117",
        "doc_doi": "10.1109/INISTA52262.2021.9548455",
        "doc_eid": "2-s2.0-85116683117",
        "doc_date": "2021-08-25",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            },
            {
                "area_name": "Management Science and Operations Research",
                "area_abbreviation": "DECI",
                "area_code": "1803"
            }
        ],
        "doc_keywords": [
            "Convolutional neural network",
            "Deep learning",
            "Ensemble learning",
            "Lesion classification",
            "Performance",
            "Skin imaging",
            "Skin lesion",
            "Skin lesion diagnose",
            "State of the art",
            "Transfer learning"
        ],
        "doc_abstract": "© 2021 IEEE.Recently, deep neural networks achieved state-of-the-art results on the automated diagnosis of skin lesions. Both the availability of bigger and better datasets as well as major advancements in Convolutional Neural Network methodologies represent some of the reasons behind these results. While the former is powered by initiatives like the International Skin Imaging Collaboration (ISIC), the latter is potentiated by developments in CNN architectures and the rise of transfer learning. This paper addresses open research questions related to the effectiveness of transfer learning methods in the context of multi-class skin lesion classification. The results indicate that, depending on the way pre-trained models are re-purposed, recent CNN architectures can bring significant performance boosts on the overall performance of deep learning classifiers. Experiments also highlight the importance of a good dataset to train these models, and how class balancing through data augmentation can help ease this requirement. Furthermore, experimentation with different models shows that ensembles can bring an edge over single-model approaches. Finally, this work presents a competitive single- and multi-model approach to the ISIC 2019 challenge.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Out of training distribution detection for multi-class skin lesion diagnosis",
        "doc_scopus_id": "85116615445",
        "doc_doi": "10.1109/INISTA52262.2021.9548595",
        "doc_eid": "2-s2.0-85116615445",
        "doc_date": "2021-08-25",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Information Systems and Management",
                "area_abbreviation": "DECI",
                "area_code": "1802"
            },
            {
                "area_name": "Management Science and Operations Research",
                "area_abbreviation": "DECI",
                "area_code": "1803"
            }
        ],
        "doc_keywords": [
            "Automated diagnosis system",
            "Convolutional neural network",
            "Decision-making process",
            "Deep learning",
            "Imaging task",
            "Lesion classification",
            "Out-of-training distribution detection",
            "Skin lesion",
            "Skin lesion diagnose",
            "Transfer learning"
        ],
        "doc_abstract": "© 2021 IEEE.Recent years have seen significant advances in automated diagnosis systems for medical imaging tasks aimed to support the decision-making process. More specifically, Convolutional neural networks (CNN) show remarkable performance in tasks such as multi-class skin lesion classification using images. However, concerns remain about the deployment of such models, as real-world test data distribution can significantly differ from the distribution of the training data. In other words, models can classify unknown samples as known classes with high confidence, which could lead to catastrophic mistakes. In line with these concerns, this paper focuses on accessing the current methods to detect out-of-training distribution samples in the context of skin lesion classification. The results contribute towards the understanding of the effectiveness of out-of-distribution detection methods.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Trends of human-robot collaboration in industry contexts: Handover, learning, and metrics",
        "doc_scopus_id": "85107883362",
        "doc_doi": "10.3390/s21124113",
        "doc_eid": "2-s2.0-85107883362",
        "doc_date": "2021-06-02",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Analytical Chemistry",
                "area_abbreviation": "CHEM",
                "area_code": "1602"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Atomic and Molecular Physics, and Optics",
                "area_abbreviation": "PHYS",
                "area_code": "3107"
            },
            {
                "area_name": "Biochemistry",
                "area_abbreviation": "BIOC",
                "area_code": "1303"
            },
            {
                "area_name": "Instrumentation",
                "area_abbreviation": "PHYS",
                "area_code": "3105"
            },
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            }
        ],
        "doc_keywords": [
            "Coordinated actions",
            "Future challenges",
            "Human-robot collaboration",
            "Human-robot communication",
            "Industry contexts",
            "Literature overview",
            "Physical interactions",
            "Task accomplishment",
            "Artificial Intelligence",
            "Benchmarking",
            "Hand Strength",
            "Humans",
            "Industry",
            "Robotics"
        ],
        "doc_abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Repetitive industrial tasks can be easily performed by traditional robotic systems. However, many other works require cognitive knowledge that only humans can provide. Human-Robot Collaboration (HRC) emerges as an ideal concept of co-working between a human operator and a robot, representing one of the most significant subjects for human-life improvement.The ultimate goal is to achieve physical interaction, where handing over an object plays a crucial role for an effective task accomplishment. Considerable research work had been developed in this particular field in recent years, where several solutions were already proposed. Nonetheless, some particular issues regarding Human-Robot Collaboration still hold an open path to truly important research improvements. This paper provides a literature overview, defining the HRC concept, enumerating the distinct human-robot communication channels, and discussing the physical interaction that this collaboration entails. Moreover, future challenges for a natural and intuitive collaboration are exposed: the machine must behave like a human especially in the pre-grasping/grasping phases and the handover procedure should be fluent and bidirectional, for an articulated function development. These are the focus of the near future investigation aiming to shed light on the complex combination of predictive and reactive control mechanisms promoting coordination and understanding. Following recent progress in artificial intelligence, learning exploration stand as the key element to allow the generation of coordinated actions and their shaping by experience.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Automated Diagnosis of Skin Lesions",
        "doc_scopus_id": "85092739271",
        "doc_doi": "10.1109/IS48319.2020.9200090",
        "doc_eid": "2-s2.0-85092739271",
        "doc_date": "2020-08-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Vision and Pattern Recognition",
                "area_abbreviation": "COMP",
                "area_code": "1707"
            },
            {
                "area_name": "Control and Optimization",
                "area_abbreviation": "MATH",
                "area_code": "2606"
            },
            {
                "area_name": "Health Informatics",
                "area_abbreviation": "MEDI",
                "area_code": "2718"
            }
        ],
        "doc_keywords": [
            "Automated diagnosis",
            "Automatic diagnosis",
            "Computer Aided Diagnosis(CAD)",
            "Decision making process",
            "Mobile Technology",
            "Skin lesion",
            "Surveillance technology",
            "Surveillance tools"
        ],
        "doc_abstract": "© 2020 IEEE.Recent years have seen significant progress in the automatic diagnosis of pigmented skin lesions, including advances in self-surveillance technologies accessible to patients and computer-aided diagnosis (CAD) tools for dermatologists. Rapid advances in mobile technologies and applications are playing a central role in providing educational aids and self-surveillance tools for patient use. At the same time, machine learning, specifically, deep learning is a fast-growing field that is being used for multiple medical imaging related problems, such as skin lesions classification. Recent studies based on deep networks produced promising results which have the potential to change the landscape of skin lesion diagnosis. Systems created based on these new advancements aim to provide support for both dermatologists in the decision making process and for patients that do not have access to skin professionals. This paper focuses on the current state of automated skin lesion diagnosis, while also providing a comprehensive view into the challenges and opportunities in dermatology care.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "The role of early anticipations for human-robot ball catching",
        "doc_scopus_id": "85048866150",
        "doc_doi": "10.1109/ICARSC.2018.8374153",
        "doc_eid": "2-s2.0-85048866150",
        "doc_date": "2018-06-06",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Mechanical Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2210"
            },
            {
                "area_name": "Control and Optimization",
                "area_abbreviation": "MATH",
                "area_code": "2606"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© 2018 IEEE.Intention inference from observation of human actions is an essential ability for robots performing interactive tasks. This paper studies the role of early anticipation skills to improve the performance of a robotic system playing ball catching with a human partner. The source of anticipatory information results from the observation of the thrower's motion before the ball is released. For that purpose, a feed-forward neural network is trained to estimate the initial position and velocity of the ball in-flight given a sequence of observations during the throwing phase. The proposed approach outperforms up to 20% the classical methodology in which the generation of predictions solely relies upon the available information during the flight phase. Several simulation results demonstrate the added value of early anticipation skills from the viewpoint of ball catching performance.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A novel wireless instrumented shoe for ground reaction forces analysis in humanoids",
        "doc_scopus_id": "85048865627",
        "doc_doi": "10.1109/ICARSC.2018.8374157",
        "doc_eid": "2-s2.0-85048865627",
        "doc_date": "2018-06-06",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Mechanical Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2210"
            },
            {
                "area_name": "Control and Optimization",
                "area_abbreviation": "MATH",
                "area_code": "2606"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© 2018 IEEE.The measurement of ground reaction forces (GRFs) is crucial in the biomechanical analysis of gait and other motor activities. Current humanoid robots mimic some of the biological adaptation methods found in humans. Therefore, studying the GRFs in these robots allows not only to improve their overall performance, but also to extrapolate possible techniques for human walking rehabilitation. The balance of a humanoid robot may be compromised when it walks and, even more, when it walks across multiple grounds with different frictions. This paper presents a system to be seamlessly installed on a walking humanoid robot to measure normal and tangential ground reaction forces. The proposed solution is a cost-effective, lightweight and wirelessly instrumented shoe (ITshoe) for real-time measuring of the GRFs.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Mobile Robots as a Tool to Teach First Year Engineering Electronics",
        "doc_scopus_id": "85042223965",
        "doc_doi": "10.1007/978-3-319-70836-2_32",
        "doc_eid": "2-s2.0-85042223965",
        "doc_date": "2018-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Engineering curriculum",
            "Higher education institutions",
            "Learning environments",
            "Motivation and engagements",
            "Qualitative - 1. Case study",
            "Quality assurance systems",
            "Telecommunications engineerings",
            "Undergraduate/First year"
        ],
        "doc_abstract": "© Springer International Publishing AG 2018.Engineering degrees require a strong background in Physical Sciences and Mathematics, demanding a high level of conceptualization and abstract reasoning that many students do not possess at the entry level of their high education studies. This can cause students demotivation and dropout, a situation that Higher Education institutions have felt the need to cope with. One methodology to address this problem is to introduce the use of robots in the classes. This tool has unique characteristics that may potentially contribute to increase students’ motivation and engagement, which are key factors on their academic success. This paper presents the rationale, challenges and methodology used to introduce robots as a tool to teach introductory electronics to first year students in a Electronics and Telecommunications Engineering Masters degree. The paper also reports evaluation indicators that result from two different surveys, one generic, carried out in the scope of the Quality Assurance System of the University, and another one developed specifically to evaluate the course. The results confirm that there is a clear and overall positive impact. Particularly significant are the gains on the students motivation and subject comprehension, without a noticeable impact on the course difficulty and required effort. It is also specially relevant that students are strongly in favour of keeping robot’s usage due to its impact on both knowledge and motivation.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Motion Primitives for Human-to-Humanoid Skill Transfer under Balance Constraint",
        "doc_scopus_id": "85010458341",
        "doc_doi": "10.1109/ICARSC.2016.53",
        "doc_eid": "2-s2.0-85010458341",
        "doc_date": "2016-12-12",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Adaptive behavior",
            "Cartesian Space",
            "Dynamic movement primitives",
            "Imitation learning",
            "Modular generation",
            "Motion primitives",
            "Movement primitives",
            "Real world environments"
        ],
        "doc_abstract": "© 2016 IEEE.In order to properly function in real-world environments, the gait of a humanoid robot must be able to adapt to new situations as well as to deal with unexpected perturbations. A promising research direction is the modular generation of movements that results from the combination of a set of basic primitives. Humans seem to be able to adapt their motion in an effortless way and efficient way. In this work we present a methodology to extract a single demonstration signal from a human teacher that can be used in a biped robot to walk in an efficient way and quickly adapt to new situations. Instead of using a normal human gait, the demonstrator walks on a gait we called \"robot-like\". It is our belief that the retargeting task will be more efficient and easier by using this methodology. The acquired signal is then used to train a set of Dynamic Movement Primitives (DMP) that directly retrieves the trajectories of the end effector in the Cartesian space. In previous works we have used this methodology with efficiency in several tasks, e.g., walking over irregularities, overcoming an obstacle. Now, by combining rhythmic DMP with discrete DMP, we show that the adaptability performance to new situations that require precise foot placement is increased.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Motivating first year students for an engineering degree",
        "doc_scopus_id": "85010380078",
        "doc_doi": "10.1109/CISPEE.2016.7777745",
        "doc_eid": "2-s2.0-85010380078",
        "doc_date": "2016-12-07",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Education",
                "area_abbreviation": "SOCI",
                "area_code": "3304"
            },
            {
                "area_name": "Chemical Engineering (miscellaneous)",
                "area_abbreviation": "CENG",
                "area_code": "1501"
            },
            {
                "area_name": "Engineering (miscellaneous)",
                "area_abbreviation": "ENGI",
                "area_code": "2201"
            }
        ],
        "doc_keywords": [
            "Electronic technologies",
            "Engineering degrees",
            "First year students",
            "Portugal",
            "Study plans",
            "Telecommunications engineerings",
            "User perspectives"
        ],
        "doc_abstract": "© 2016 IEEE.When introducing the Bologna model, the University of Aveiro, in Portugal, added a new course to the Electronics and Telecommunications Engineering study plan, aimed at motivating students, both for the degree and for the profession. The course aims at providing new students with an introduction to Electronics and Telecommunications Engineering and to the main activities involved in the profession. For most of the students, the course is the first contact with electronic technology and equipment in a non-user perspective. In the academic year 2011-12, this course suffered a major reorganization. This paper presents the model, underlying assumptions and options followed when developing the new structure for the course. The main challenge was to achieve these goals, using a 'hands-on' approach in a course unit with more than 100 students, making students create useful and working circuits (it is hard to motivate young students based on abstractions), and having a meaningful approach to electronics, avoiding cookbook recipes and effectively creating knowledge for the students. The modifications seem to have been well received by the students, as expressed by the course success rate and the students' responses to the University quality assurance enquiries.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Adaptive Robot Biped Locomotion with Dynamic Motion Primitives and Coupled Phase Oscillators",
        "doc_scopus_id": "84957016680",
        "doc_doi": "10.1007/s10846-016-0336-1",
        "doc_eid": "2-s2.0-84957016680",
        "doc_date": "2016-09-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Mechanical Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2210"
            },
            {
                "area_name": "Industrial and Manufacturing Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2209"
            },
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            }
        ],
        "doc_keywords": [
            "Adaptive behavior",
            "Control architecture",
            "Coupled phase oscillators",
            "Dynamic movement primitives",
            "External disturbances",
            "Movement primitives",
            "Phase resetting",
            "Real world environments"
        ],
        "doc_abstract": "© 2016, Springer Science+Business Media Dordrecht.In order to properly function in real-world environments, the gait of a humanoid robot must be able to adapt to new situations as well as to deal with unexpected perturbations. A promising research direction is the modular generation of movements that results from the combination of a set of basic primitives. In this paper, we present a robot control framework that provides adaptive biped locomotion by combining the modulation of dynamic movement primitives (DMPs) with rhythm and phase coordination. The first objective is to explore the use of rhythmic movement primitives for generating biped locomotion from human demonstrations. The second objective is to evaluate how the proposed framework can be used to generalize and adapt the human demonstrations by adjusting a few open control parameters of the learned model. This paper contributes with a particular view into the problem of adaptive locomotion by addressing three aspects that, in the specific context of biped robots, have not received much attention. First, the demonstrations examples are extracted from human gaits in which the human stance foot will be constrained to remain in flat contact with the ground, forcing the “bent-knee” at all times in contrast with the typical straight-legged style. Second, this paper addresses the important concept of generalization from a single demonstration. Third, a clear departure is assumed from the classical control that forces the robot’s motion to follow a predefined fixed timing into a more event-based controller. The applicability of the proposed control architecture is demonstrated by numerical simulations, focusing on the adaptation of the robot’s gait pattern to irregularities on the ground surface, stepping over obstacles and, at the same time, on the tolerance to external disturbances.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A Beamformer-Particle Filter Framework for Localization of Correlated EEG Sources",
        "doc_scopus_id": "84969913442",
        "doc_doi": "10.1109/JBHI.2015.2413752",
        "doc_eid": "2-s2.0-84969913442",
        "doc_date": "2016-05-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Biotechnology",
                "area_abbreviation": "BIOC",
                "area_code": "1305"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            },
            {
                "area_name": "Health Information Management",
                "area_abbreviation": "HEAL",
                "area_code": "3605"
            }
        ],
        "doc_keywords": [
            "Bayesian estimations",
            "Beam formers",
            "Brain source localization",
            "Eeg inverse problems",
            "Particle Filtering",
            "Adult",
            "Algorithms",
            "Bayes Theorem",
            "Brain-Computer Interfaces",
            "Electroencephalography",
            "Evoked Potentials, Visual",
            "Female",
            "Humans",
            "Male",
            "Signal Processing, Computer-Assisted",
            "Visual Cortex",
            "Young Adult"
        ],
        "doc_abstract": "© 2013 IEEE.Electroencephalography (EEG)-based brain computer interface (BCI) is the most studied noninvasive interface to build a direct communication pathway between the brain and an external device. However, correlated noises in EEG measurements still constitute a significant challenge. Alternatively, building BCIs based on filtered brain activity source signals instead of using their surface projections, obtained from the noisy EEG signals, is a promising and not well-explored direction. In this context, finding the locations and waveforms of inner brain sources represents a crucial task for advancing source-based noninvasive BCI technologies. In this paper, we propose a novel multicore beamformer particle filter (multicore BPF) to estimate the EEG brain source spatial locations and their corresponding waveforms. In contrast to conventional (single-core) beamforming spatial filters, the developed multicore BPF considers explicitly temporal correlation among the estimated brain sources by suppressing activation from regions with interfering coherent sources. The hybrid multicore BPF brings together the advantages of both deterministic and Bayesian inverse problem algorithms in order to improve the estimation accuracy. It solves the brain activity localization problem without prior information about approximate areas of source locations. Moreover, the multicore BPF reduces the dimensionality of the problem to half compared with the PF solution, thus alleviating the curse of dimensionality problem. The results, based on generated and real EEG data, show that the proposed framework recovers correctly the dominant sources of brain activity.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Proprioceptive visual tracking of a humanoid robot head motion",
        "doc_scopus_id": "84978793013",
        "doc_doi": "10.1007/978-3-319-41501-7_56",
        "doc_eid": "2-s2.0-84978793013",
        "doc_date": "2016-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Theoretical Computer Science",
                "area_abbreviation": "MATH",
                "area_code": "2614"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Angular displacement",
            "Angular positions",
            "Humanoid robot",
            "Illumination conditions",
            "Inertial sensor",
            "SURF",
            "Visual feature",
            "Visual Tracking"
        ],
        "doc_abstract": "© Springer International Publishing Switzerland 2016.This paper addresses the problem of measuring a humanoid robot head motion by fusing inertial and visual data. In this work, a model of a humanoid robot head, including a camera and inertial sensors, is moved on the tip of an industrial robot which is used as ground truth for angular position and velocity. Visual features are extracted from the camera images and used to calculate angular displacement and velocity of the camera, which is fused with angular velocities from a gyroscope and fed into a Kalman Filter. The results are quite interesting for two different scenarios and with very distinct illumination conditions. Additionally, errors are introduced artificially into the data to emulate situations of noisy sensors, and the system still performs very well.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Biped walking learning from imitation using dynamic movement primitives",
        "doc_scopus_id": "84952311012",
        "doc_doi": "10.1007/978-3-319-27149-1_15",
        "doc_eid": "2-s2.0-84952311012",
        "doc_date": "2016-01-01",
        "doc_type": "Book Chapter",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Inter-limb coordination",
            "Learning by demonstration",
            "Motion capture",
            "Movement primitives",
            "Non-linear oscillators"
        ],
        "doc_abstract": "© Springer International Publishing Switzerland 2016.Exploring the full potential of humanoid robots requires their ability to learn, generalize and reproduce complex tasks that will be faced in dynamic environments. In recent years, significant attention has been devoted to recovering kinematic information from the human motion using a motion capture system. This paper demonstrates the use of a VICON system to capture human locomotion that is used to train a set of Dynamic Movement Primitives. These DMP can then be used to directly control a humanoid robot on the task space. The main objectives of this paper are: (1) to study the main characteristics of human natural locomotion and human “robot-like” locomotion; (2) to use the captured motion to train a DMP; (3) to use the DMP to directly control a humanoid robot in task space. Numerical simulations performed on V-REP demonstrate the effectiveness of the proposed solution.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Bimanual haptics for humanoid robot teleoperation using ROS and V-REP",
        "doc_scopus_id": "84933060015",
        "doc_doi": "10.1109/ICARSC.2015.27",
        "doc_eid": "2-s2.0-84933060015",
        "doc_date": "2015-05-04",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            }
        ],
        "doc_keywords": [
            "Computational learning",
            "Degree of complexity",
            "Haptics",
            "Humanoid robot teleoperation",
            "Humanoid robotics",
            "Kinesthetic teachings",
            "Robot teleoperation",
            "Simulated model"
        ],
        "doc_abstract": "© 2015 IEEE.The high degree of complexity associated with humanoid robotic platforms significantly hinders the definition of accurate models. Robot learning based on human teleoperation provides suitable ways and means of meeting this challenge. Teleoperating the robot in different motion and balance tasks through a haptic interface, endows the user with the ability to \"feel\" the dynamics of the system and react to it, taking actions to maintain the robot's balance. The data collected during the demonstrations can then be used on computational learning algorithms to teach the robot how to move, balance, and walk on its own. However, the complexity of real platforms makes the control and data gathering during the teleoperation an intricate task. In order to enhance the user's control over the teleoperation, a dual haptic joystick configuration is introduced, which is first tested in a simulated model of the real platform in V-REP. This paper presents a setup solution to implement the bimanual teleoperation of a humanoid robot, based on a distributed ROS network that bridges the haptic devices and the simulator. Data gathering during several balancing tasks has shown to be possible, and the simulation's behavior is reliable enough to support the development of an infrastructure to operate the real robot based on this approach.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Adaptation of robot locomotion patterns with dynamic movement primitives",
        "doc_scopus_id": "84933036813",
        "doc_doi": "10.1109/ICARSC.2015.9",
        "doc_eid": "2-s2.0-84933036813",
        "doc_date": "2015-05-04",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            }
        ],
        "doc_keywords": [
            "Continuous modulation",
            "Dynamic movement primitives",
            "Forward velocity",
            "Locomotion patterns",
            "Motor primitives",
            "movement adaptation",
            "On-line adaptation",
            "Walking movements"
        ],
        "doc_abstract": "© 2015 IEEE.Functional locomotion requires continuous modulation of coordination within and between legs to flexibly accommodate demands of real-word environments. In this context, dynamic movement primitives (DMP) is a powerful tool for motion planning based on demonstrations, being used as a compact policy representation well-suited for robot learning. In this work, we study on-line adaptation of robot biped locomotion patterns when employing DMP as trajectory representations. Here, the adaptation of learned walking movements is obtained from a single demonstration. The goal is to demonstrate and evaluate how new movements can be generated by simply modifying the parameters of rhythmic DMP learned in task space. The formulation in task space allows recreating new movements such that the DMP's parameters directly relate to task variables, such as step length, hip height, foot clearance and forward velocity. Several experiments are conducted using the V-REP robotics simulator, including the adaptation of the robot's gait pattern to irregularities on the ground surface and stepping over obstacles.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Modulation of dynamic movement primitives for biped locomotion",
        "doc_scopus_id": "84999853133",
        "doc_doi": "10.1142/9789814725248_0048",
        "doc_eid": "2-s2.0-84999853133",
        "doc_date": "2015-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            }
        ],
        "doc_keywords": [
            "Dynamic movement primitives",
            "Foot clearances",
            "Forward velocity",
            "Gait pattern",
            "Ground surfaces",
            "Locomotion patterns",
            "Motor primitives",
            "On-line adaptation"
        ],
        "doc_abstract": "© 2015, World Scientific Publishing Co. Pte Ltd. All rights reserved.In recent years, several studies have suggested that improved performance of modern robots can arise from encoding commands in terms of motor primitives. In this context, dynamic movement primitives (DMP) is a powerful tool for motion planning based on demonstrations, well-suited for robot learning. In this work, we study on-line adaptation of biped locomotion patterns when employing DMP. The goal is to demonstrate and evaluate how new movements can be generated by simply modifying the parameters of rhythmic DMP learned in task space. This formulation allows recreating new movements such that the DMP's parameters directly relate to task variables, such as step length, hip height, foot clearance and forward velocity. Several experiments are conducted using the V-REP simulator, including the adaptation of the robot's gait pattern to irregularities on the ground surface and stepping over obstacles.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Adaptive behavior of a biped robot using dynamic movement primitives",
        "doc_scopus_id": "84945926215",
        "doc_doi": "10.1007/978-3-319-23485-4_46",
        "doc_eid": "2-s2.0-84945926215",
        "doc_date": "2015-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Theoretical Computer Science",
                "area_abbreviation": "MATH",
                "area_code": "2614"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Adaptive behavior",
            "Coupled phase oscillators",
            "Dynamic movement primitives",
            "External perturbations",
            "Interlimb coordination",
            "Movement primitives",
            "Phase resetting",
            "Sensory information"
        ],
        "doc_abstract": "© Springer International Publishing Switzerland 2015.Over the past few years, several studies have suggested that adaptive behavior of humanoid robots can arise based on phase resetting embedded in pattern generators. In this paper, we propose a movement control approach that provides adaptive behavior by combining the modulation of dynamic movement primitives (DMP) and interlimb coordination with coupled phase oscillators. Dynamic movement primitives (DMP) represent a powerful tool for motion planning based on demonstration examples. This approach is currently used as a compact policy representation well-suited for robot learning. The main goal is to demonstrate and evaluate the role of phase resetting based on foot-contact information in order to increase the tolerance to external perturbations. In particular, we study the problem of optimal phase shift in a control system influenced by delays in both sensory information and motor actions. The study is performed using the V-REP simulator, including the adaptation of the humanoid robot’s gait pattern to irregularities on the ground surface.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Towards an adaptive brain-computer interface – An error potential approach",
        "doc_scopus_id": "84927940957",
        "doc_doi": "10.1007/978-3-319-14899-1_12",
        "doc_eid": "2-s2.0-84927940957",
        "doc_date": "2015-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Theoretical Computer Science",
                "area_abbreviation": "MATH",
                "area_code": "2614"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "© Springer International Publishing Switzerland 2015.In this paper a new adaptive Brain Computer Interface (BCI) architecture is proposed that allows to autonomously adapt the BCI parameters in malfunctioning situations. Such situations are detected by discriminating EEG Error Potentials and when necessary the BCI mode is switched back to the training stage in order to improve its performance. First, the modules of the adaptive BCI are presented, then the scenarios for identification of the user reaction to intentionally introduced errors are discussed and finally promising preliminary results are commented. The proposed concept has the potential to increase the reliability of BCI systems.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Statistical approach for reconstruction of dynamic brain dipoles based on EEG data",
        "doc_scopus_id": "84908491264",
        "doc_doi": "10.1109/IJCNN.2014.6889663",
        "doc_eid": "2-s2.0-84908491264",
        "doc_date": "2014-09-03",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            }
        ],
        "doc_keywords": [
            "Eeg datum",
            "Eeg inverse problems",
            "Head geometry",
            "Neuronal activities",
            "Particle filter",
            "Statistical approach"
        ],
        "doc_abstract": "© 2014 IEEE.In this paper, we propose a statistical approach to reconstruct the brain neuronal activity based only on recorded EEG data. The brain zones with the strongest activity are expressed at a macro level by a few number of active brain dipoles. Normally, for solving the EEG inverse problem, fixed dipole locations are assumed, independently of the different stimuli that excite the brain. The proposed particle filter (PF) framework presents a shift in the current paradigm by estimating dynamic brain dipoles, which may vary from one location to another in the brain depending on internal/external stimuli that may affect the brain. Also, in contrast to previous solutions, the proposed PF algorithm estimates simultaneously, the number of the active dipoles, their moving locations and their respective oscillations in the three dimensional head geometry.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "EEG signal processing for brain-computer interfaces",
        "doc_scopus_id": "85017007845",
        "doc_doi": "10.1007/978-3-642-30574-0_46",
        "doc_eid": "2-s2.0-85017007845",
        "doc_date": "2014-01-01",
        "doc_type": "Book Chapter",
        "doc_areas": [
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Eeg inverse problems",
            "EEG signal processing",
            "Electroencephalogram signals",
            "Inverse modeling",
            "Mobile robot control",
            "Sequential Monte Carlo methods",
            "Source localization",
            "Spatial filterings"
        ],
        "doc_abstract": "© Springer-Verlag Berlin Heidelberg 2014.This chapter is focused on recent advances in electroencephalogram (EEG) signal processing for brain computer interface (BCI) design. A general overview of BCI technologies is first presented, and then the protocol for motor imagery noninvasive BCI for mobile robot control is discussed. Our ongoing research on noninvasive BCI design based not on recorded EEG but on the brain sources that originated the EEG signal is also introduced. We propose a solution to EEG-based brain source recovering by combining two techniques, a sequential Monte Carlo method for source localization and spatial filtering by beamforming for the respective source signal estimation. The EEG inverse problem is previously studded assuming that the source localization is known. In this work for the first time the problem of inverse modeling is solved simultaneously with the problem of the respective source space localization.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Motion generalization with dynamic primitives",
        "doc_scopus_id": "85007286962",
        "doc_doi": "10.1142/9789814623353_0026",
        "doc_eid": "2-s2.0-85007286962",
        "doc_date": "2014-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            }
        ],
        "doc_keywords": [
            "Dynamic motions",
            "Generalization performance",
            "Human like",
            "Human motion capture data",
            "Motion generalization",
            "Reaching movements",
            "Task space"
        ],
        "doc_abstract": "© 2014 by World Scientific Publishing Co. Pte. Ltd.Although considerable research has been done on motion planning based on demonstrated examples, the ability to generalize from few examples is still an open problem. In this paper, we examine the ability of reproduction and generalization of human-like movements based on the paradigm of dynamic motion primitives (DMPs). The purpose of the current study is to accurately portray the characteristics and generalization performance of this approach, both using simulated and human motion capture data. To this aim, we consider discrete movements that require reach actions toward a target. The adaptation of learnt movements to new situations is performed in the joint and the task spaces. The generalization performance is evaluated and the feasibility of the approach is discussed for this study of reaching movements.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A kinect-based motion capture system for robotic gesture imitation",
        "doc_scopus_id": "84924557551",
        "doc_doi": "10.1007/978-3-319-03413-3_43",
        "doc_eid": "2-s2.0-84924557551",
        "doc_date": "2014-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "3D pose estimation",
            "Articulated structures",
            "Constraint optimizations",
            "Correction method",
            "Dynamic environments",
            "Gesture imitation",
            "Kinematic information",
            "Motion capture system"
        ],
        "doc_abstract": "© Springer International Publishing Switzerland 2014.Exploring the full potential of humanoid robots requires their ability to learn, generalize and reproduce complex tasks that will be faced in dynamic environments. In recent years, significant attention has been devoted to recovering kinematic information from the human motion using a motion capture system. This paper demonstrates and evaluates the use of a Kinectbased capture system that estimates the 3D human poses and converts them into gestures imitation in a robot. The main objectives are twofold: (1) to improve the initially estimated poses through a correction method based on constraint optimization, and (2) to present a method for computing the joint angles for the upper limbs corresponding to motion data from a human demonstrator. The feasibility of the approach is demonstrated by experimental results showing the upper-limb imitation of human actions by a robot model.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Motion generalization from a single demonstration using dynamic primitives",
        "doc_scopus_id": "84905024225",
        "doc_doi": "10.1109/ICARSC.2014.6849807",
        "doc_eid": "2-s2.0-84905024225",
        "doc_date": "2014-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            }
        ],
        "doc_keywords": [
            "Dynamic movement primitives",
            "Generalization performance",
            "Geometric invariance",
            "Human motion capture data",
            "Imitation learning",
            "Incremental process",
            "Motion generalization",
            "Motor commands"
        ],
        "doc_abstract": "In recent years, several studies have suggested that improved performance of modern robots can arise from encoding motor commands in terms of dynamic primitives. In this context, dynamic movement primitives (DMPs) have been proposed as a powerful tool for motion planning based on demonstrated examples. In this work, we focus on generalizing discrete and periodic movements from a single demonstration. Here, we argue that geometric invariance in itself may be useful to provide an initial representation of movements in an incremental process of learning from experience. The purpose of the current study is to portray the generalization performance of this approach, both using simulated and human motion capture data. The generalization performance is evaluated and the feasibility of the approach is discussed. © 2014 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Bayesian tracking and multi-core beamforming for estimation of correlated brain sources",
        "doc_scopus_id": "84902665576",
        "doc_doi": "10.1049/cp.2014.0522",
        "doc_eid": "2-s2.0-84902665576",
        "doc_date": "2014-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            }
        ],
        "doc_keywords": [
            "Bayesian tracking",
            "Deterministic approach",
            "Eeg inverse problems",
            "Multi core",
            "Particle Filtering",
            "Statistical approach",
            "Statistical inverse problems",
            "Temporal correlations"
        ],
        "doc_abstract": "The main contribution of this paper is the general framework, termed multi-core Beamformer Particle Filter (multi-core BPF), for solving the ill-posed EEG inverse problem. The method combines a particle filter (statistical approach) for reconstruction of the brain source spatial locations and a multi-core Beamformer (deterministic approach) for estimation of the corresponding dipole waveforms in a recursive way The intuition behind is to benefit from the advantages of both deterministic and statistical inverse problem solvers in order to improve the estimation accuracy without increasing the complexity and the computational cost. Our simulations show that the proposed algorithm can reconstruct reliably the few most active (the dominant) brain sources that have generated the registered EEG measurements. The main advantage of the method is that in contrast to conventional (single-core) Beamforming spatial filters, the proposed Multi-core Beamformer explicitly takes into consideration the potential temporal correlation between the dipoles.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Bayesian approach for reconstruction of moving brain dipoles",
        "doc_scopus_id": "84884470706",
        "doc_doi": "10.1007/978-3-642-39094-4_64",
        "doc_eid": "2-s2.0-84884470706",
        "doc_date": "2013-09-26",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Theoretical Computer Science",
                "area_abbreviation": "MATH",
                "area_code": "2614"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Brain imaging",
            "Equivalent current dipole",
            "ILL-posed inverse problem",
            "Inverse modeling",
            "Particle filter",
            "Reconstruction techniques",
            "Recursive Bayesian estimation",
            "Source reconstruction"
        ],
        "doc_abstract": "EEG source reconstruction is a challenging task and several methods have been applied to this ill-posed inverse problem. Most of the reconstruction techniques rely on imaging models, where the neural activity is described by a dense set of current dipoles. On the other hand, the point source models, which employ a small number of equivalent current dipoles, has received less attention. While both approaches (imaging versus current dipoles) have their own issues, the main advantage of the dipole models is that they approximate summaries of evoked responses or helpful first approximations. In this paper, we use a recursive Bayesian estimation technique, known as Particle Filter (PF), to simultaneously reconstruct the spatial locations within the head and the corresponding waveforms of the most active dipoles that originated the EEG sensor data. Normally, in EEG source reconstruction, fixed dipole locations are assumed. The proposed PF framework presents a shift in the current paradigm by estimating moving EEG sources, which may vary from one location to another in the brain reflecting the underlying brain activity. Our computer simulations, based on generated and real EEG data, show that the proposed PF approach estimates the dynamic EEG sources with high fidelity. © 2013 Springer-Verlag.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Reproduction of human arm movements using Kinect-based motion capture data",
        "doc_scopus_id": "84898833907",
        "doc_doi": "10.1109/ROBIO.2013.6739574",
        "doc_eid": "2-s2.0-84898833907",
        "doc_date": "2013-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Biotechnology",
                "area_abbreviation": "BIOC",
                "area_code": "1305"
            }
        ],
        "doc_keywords": [
            "Artificial systems",
            "Human arm movements",
            "Human demonstrations",
            "Human motion capture",
            "Imitation learning",
            "Kinematics modeling",
            "Motion capture data",
            "Parallel mechanisms"
        ],
        "doc_abstract": "Transferring skills from humans to robots is an appealing way for teaching artificial systems to perform a variety of different tasks. In this context, imitation learning appears as an important approach for teaching robots due to the generation of human-like movements and the ease of teaching new tasks. This paper addresses the use of a Kinect-based human motion capture system and the reproduction of arm movements in an upper-body humanoid robot. The objectives are threefold: (1) to deal with the lack of a kinematics model that assure coherence in the recorded 3D human poses; (2) to explore the inclusion of a shoulder complex based on a parallel mechanism; and (3) to demonstrate and evaluate how two robot models can be used to reproduce the human demonstrations. Several experimental results are included showing the upper-limb reproduction of human arm movements. © 2013 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "MNSM-inspired method for the motion control of dual-arm robot",
        "doc_scopus_id": "84898814213",
        "doc_doi": "10.1109/ROBIO.2013.6739651",
        "doc_eid": "2-s2.0-84898814213",
        "doc_date": "2013-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Biotechnology",
                "area_abbreviation": "BIOC",
                "area_code": "1305"
            }
        ],
        "doc_keywords": [
            "Arbitrary trajectories",
            "Dual-arm robot",
            "Mirror-neuron system",
            "Motion planners",
            "Motor neurons",
            "Movement mechanism",
            "Speech stimuli",
            "Symmetrical actions"
        ],
        "doc_abstract": "This work presents a MNSM (Mirror Neuron System Mechanism) inspired method to control the motion of a dual-arm robot. The new symmetrical action can be classified as instinct-following arbitrary trajectory and goal-based motion; they are planned by the dual-arm robot planner, and implemented by the dual-arm robot within a master/slave protocol. The master arm uses a motion planner to generate corresponding signal for the motor neuron. Then the motor neuron controls the motor to move the joint of the robot. The activities of motor neuron can also fire the MNSSL (Mirror Neuron System of Symmetry Limb) and it will generate the code about the movement and pass it to the receiver of the MNS (Mirror Neuron System) in the slave arm. The MNS of the slave arm will decode the information to generate the corresponding signal of the motor neuron to drive the motor to move the joints. The effective symmetrical motions are also linked with different vocabularies, and all these are stored in the memory as knowledge. High level mirror activities fired by high level neuron command, speech stimulus, etc will use the knowledge in the memory to control the dual-arm robot to realize different symmetrical motions. This study provides not only a new method for the dual-arm robot to realize some given motion task, but also firstly a way by robot motion demonstration to understand the mirror movement mechanism between human's symmetrical limbs. © 2013 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A sequential Monte Carlo approach for brain source localization",
        "doc_scopus_id": "84867643170",
        "doc_doi": "10.1007/978-3-642-28696-4_5",
        "doc_eid": "2-s2.0-84867643170",
        "doc_date": "2013-01-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "In this chapter we propose a solution to the Electroencephalography (EEG) inverse problem combining two techniques, which are the Sequential Monte Carlo (SMC) method for estimating the coordinates of the first two non-correlated dominative brain zones (represented by their respective current dipoles) and spatial filtering which is done by beamforming based on EEG data. Beamforming (BF) gives estimates of the respective source moments. In order to validate this novel approach for brain source localization, EEG data from dipoles with known locations and known moments are generated and artificially corrupted with noise. The noise represents the overall influence of other brain sources but they are not brain disturbances. When the power of the EEG signal due to the main brain sources is higher than the summed effect of all other secondary sources, the estimation of the localization of the leading sources is reliable and repetitive over a number of Monte Carlo runs. © 2013 Springer-Verlag Berlin Heidelberg.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A COP-based controller for adaptive motion planning of a single-legged robot",
        "doc_scopus_id": "84876462364",
        "doc_doi": "10.1109/ROBIO.2012.6490941",
        "doc_eid": "2-s2.0-84876462364",
        "doc_date": "2012-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Biotechnology",
                "area_abbreviation": "BIOC",
                "area_code": "1305"
            }
        ],
        "doc_keywords": [
            "Adaptive motion",
            "Centre of gravity",
            "Centre of pressure",
            "Ground reaction forces",
            "Inverse kinematics algorithms",
            "Planning and control",
            "Reaction forces",
            "Single-legged robots"
        ],
        "doc_abstract": "This paper presents a motion planning and control method for determining the joint velocities of a single-legged robot based on the desired Centre of Pressure (COP) motion, the Centre of Mass (COM) dynamics and the ground reaction forces. A closed-loop inverse kinematics algorithm is implemented using the Centre of Gravity (COG) Jacobian, while the control system relies on the reaction force data to estimate the real COP. The main idea is to manipulate the dynamics of the COM such as the COP shows a desired behavior. The implementation of the COP-based controller is described to demonstrate the possibility of keeping a single-legged robot in balance, while adapting to unexpected changes in a slope surface or during execution of a specified motion task. Simulation results are illustrated throughout the paper to validate the proposed controller. © 2012 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Brain machine interface IEETA case study",
        "doc_scopus_id": "84869776574",
        "doc_doi": "10.1109/IS.2012.6335164",
        "doc_eid": "2-s2.0-84869776574",
        "doc_date": "2012-11-28",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            }
        ],
        "doc_keywords": [
            "Brain machine interface",
            "EEG signal processing",
            "Feature extraction and classification",
            "Features extraction",
            "Mobile robot control",
            "Motor imagery",
            "Telematics"
        ],
        "doc_abstract": "The goal of the present paper is to report the recent advances in Electroencephalogram (EEG)-based Brain Machine Interface (BMI) developed at the Institute of Electrical Engineering and Telematics of Aveiro (IEETA). First, a short overview of the most successful BMI technologies is presented and then our ongoing research and protocol for motor imagery noninvasive BMI for a mobile robot control is discussed. The main EEG signal processing challenges as filtering, feature extraction and classification are also considered. © 2012 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Mechatronic design of a new humanoid robot with hybrid parallel actuation",
        "doc_scopus_id": "84868005545",
        "doc_doi": "10.5772/51535",
        "doc_eid": "2-s2.0-84868005545",
        "doc_date": "2012-10-10",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            }
        ],
        "doc_keywords": [
            "Bio-inspired",
            "Distributed architecture",
            "Humanoid robotics",
            "Hybrid actuation",
            "Modular hardware",
            "Multimodal perception"
        ],
        "doc_abstract": "Humanoid robotics is unquestionably a challenging and long-term field of research. Of the numerous and most urgent challenges to tackle, autonomous and efficient locomotion may possibly be the most underdeveloped at present in the research community. Therefore, to pursue studies in relation to autonomy with efficient locomotion, the authors have been developing a new teen-sized humanoid platform with hybrid characteristics. The hybrid nature is clear in the mixed actuation based on common electrical motors and passive actuators attached in parallel to the motors. This paper presents the mechatronic design of the humanoid platform, focusing mainly on the mechanical structure, the design and simulation of the hybrid joints, and the different subsystems implemented. Trying to keep the appropriate human proportions and main degrees of freedom, the developed platform utilizes a distributed control architecture and a rich set of sensing capabilities, both ripe for future development and research. © 2012 Santos et al.;.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "A brief survey of commercial robotic arms for research on manipulation",
        "doc_scopus_id": "84864248186",
        "doc_doi": "10.1109/ISRA.2012.6219361",
        "doc_eid": "2-s2.0-84864248186",
        "doc_date": "2012-07-30",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            }
        ],
        "doc_keywords": [
            "Comparative analysis",
            "Functional capacity",
            "Light weight",
            "manipulation",
            "Research objectives",
            "State of the art"
        ],
        "doc_abstract": "Presently a vast variety of robust robotic arms are available commercially, some of which are extremely reliable in precision and repeatability. This makes them an ideal tool for research focused on manipulation. However, there is a lack of an easily accessible comparative analysis that can assist researchers in choosing an arm that fits their research objectives. With an objective to provide such an analysis, this paper provides a comparative survey of the state of the art in commercial robotic arms - classified based on their price, performance and suitability for research on manipulation. These arms are categorized into four classes: cheap educational arms, low price industrial arms, research oriented arms and modular light weight arms. Within each classification, some typical robotic arms are analyzed in detail to provide an overview of the functional capacities of the arms in that particular class. © 2012 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Development of a hybrid humanoid platform and incorporation of the passive actuators",
        "doc_scopus_id": "79952935767",
        "doc_doi": "10.1109/ROBIO.2010.5723408",
        "doc_eid": "2-s2.0-79952935767",
        "doc_date": "2010-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Biotechnology",
                "area_abbreviation": "BIOC",
                "area_code": "1305"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            }
        ],
        "doc_keywords": [
            "Advanced control",
            "Commercial availability",
            "Design and Development",
            "Elastic element",
            "Initial design",
            "Mechanical response",
            "Mechanical stiffness",
            "Motion tasks",
            "Passive actuators",
            "Power efficiency",
            "Saving energy",
            "Simulation environment",
            "Simulation result"
        ],
        "doc_abstract": "This paper describes the design and development of a new hybrid humanoid platform conceived to use both active and passive actuators. Power efficiency and mechanical response capability of the robot were the main concerns driving this development. Maintaining the use of off-the-shelf RC servomotors, due to their limited cost and commercial availability, the platform was nonetheless custom-designed for lightness, mechanical stiffness and prone to vast sensorial enrichment for future advanced control. Low-cost actuators may degrade and perform poorly and erroneously in demanding conditions; therefore, one major inspiration for this work relies on the potential energy storage mechanism, using elastic elements to overcome the motors limitation, avoiding their operation near the limits, while saving energy and wearing, and also obtain faster responses of the overall platform in various motion schemes and gaits. A standard simulation environment allows the initial design and future tuning of the passive actuators for several joints in motion tasks. The early simulation results show that the elastic elements approach indeed eases the actuators tasks and is a must in the future development of the new platform now presented. © 2010 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Advances in EEG-based biometry",
        "doc_scopus_id": "77955351275",
        "doc_doi": "10.1007/978-3-642-13775-4_29",
        "doc_eid": "2-s2.0-77955351275",
        "doc_date": "2010-08-13",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Theoretical Computer Science",
                "area_abbreviation": "MATH",
                "area_code": "2614"
            },
            {
                "area_name": "Computer Science (all)",
                "area_abbreviation": "COMP",
                "area_code": "1700"
            }
        ],
        "doc_keywords": [
            "Data base",
            "EEG signals",
            "Health disorders",
            "Human brain",
            "Mental tasks",
            "Person identification",
            "Potential applications",
            "Radial basis functions",
            "Static classification"
        ],
        "doc_abstract": "This paper is focused on proving the concept that the EEG signals collected during a perception or mental task can be used for discrimination of individuals. The viability of the EEG-based person identification was successfully tested for a data base of 13 persons. Among various classifiers tested, Support Vector Machine (SVM) with Radial Basis Function (RBF) exhibits the best performance. The problem of static classification that does not take into account the temporal nature of the EEG sequence was considered by an empirical post classifier procedure. The algorithm proposed has an effect of introducing a memory into the classifier without increasing its complexity. Control of a classified access into restricted areas security systems, health disorder identification in medicine, gaining more understanding of the cognitive human brain processes in neuroscience are some of the potential applications of EEG-based biometry. © 2010 Springer-Verlag.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Ieeta brain computer interface :Towards a rapid prototyping and Multi-Application system",
        "doc_scopus_id": "67650644935",
        "doc_doi": null,
        "doc_eid": "2-s2.0-67650644935",
        "doc_date": "2009-07-22",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Signal Processing",
                "area_abbreviation": "COMP",
                "area_code": "1711"
            },
            {
                "area_name": "Biomedical Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2204"
            },
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            }
        ],
        "doc_keywords": [
            "Brain-computer interface",
            "Brain-machine interfaces",
            "Communication channel",
            "EEG signals",
            "Electroencephalogram signals",
            "Experimental strategy",
            "Hand movement",
            "Motor imagery",
            "Motor imagery tasks",
            "Mu rhythms",
            "Multi-application systems",
            "Multi-purpose",
            "Operating modes",
            "Output devices"
        ],
        "doc_abstract": "Recent advances in computer hardware and signal processing assert that controlling certain functions by thoughts may represent a landmark in the way we interact with many output devices. This paper exploits the possibility of achieving a communication channel between the brain and a mobile robot through the modulation of the electroencephalogram (EEG) signal during motor imagery tasks. A major concern was directed towards designing a generalized and multi-purpose framework that supports rapid prototyping of various experimental strategies and operating modes. Preliminary results of brain-state estimation using EEG signals recorded during a self-paced left/right hand movement task are also presented. The user successfully learned to operate the system and how to better perform the motor-related tasks based on outcomes produced by its mental focus.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Towards a human-robot interface based on the electrical activity of the brain",
        "doc_scopus_id": "63549114506",
        "doc_doi": "10.1109/ICHR.2008.4755936",
        "doc_eid": "2-s2.0-63549114506",
        "doc_date": "2008-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Vision and Pattern Recognition",
                "area_abbreviation": "COMP",
                "area_code": "1707"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            }
        ],
        "doc_keywords": [
            "Communication channels",
            "EEG signals",
            "Electrical activities",
            "Electro-encephalogram signals",
            "Hand movements",
            "Human-robot interfaces",
            "Motor imagery tasks",
            "Multi purpose",
            "Operating modes",
            "Output devices"
        ],
        "doc_abstract": "Recent advances in computer hardware and signal processing assert that controlling certain functions by thoughts may represent a landmark in the way we interact with many output devices. This paper exploits the possibility of achieving a communication channel between the brain and a mobile robot through the modulation of the electroencephalogram (EEG) signal during motor imagery tasks. A major concern was directed towards designing a generalized and multi-purpose framework that supports rapid prototyping of various experimental strategies and operating modes. Preliminary results of brain-state estimation using EEG signals recorded during a self-paced left/right hand movement task are also presented. The user successfully learned to operate the system and how to better perform the motor-related tasks based on outcomes produced by its mental focus. © 2008 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Visual tracking on an autonomous self-contained humanoid robot",
        "doc_scopus_id": "84886942471",
        "doc_doi": "10.1142/9789812835772_0152",
        "doc_eid": "2-s2.0-84886942471",
        "doc_date": "2008-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            }
        ],
        "doc_keywords": [
            "Distributed control architectures",
            "Embedded controllers",
            "Hardware and software",
            "Local controllers",
            "Onboard components",
            "Sensor monitoring",
            "Vision capability",
            "Visual Tracking"
        ],
        "doc_abstract": "This paper describes the hardware and software setups that allow a humanoid robot developed from scratch to perform visual tracking based exclusively on onboard components. The robot which was started on earlier projects was finally given its full autonomy in what concerns perception and vision capabilities. An embedded PCI04-based controller running Linux is now able to interface a IEEE1394 color camera and, using the OpenCV library, can now perform visual tracking of some objects moving on its neighborhood. This embedded controller, besides being responsible for image acquisition and processing, serves as an interface between external monitoring and the distributed control architecture based on a master-multi-slave CAN bus of local controllers for joint actuation and sensor monitoring. Copyright © 2008 by World Scientific Publishing Co. Pte. Ltd.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Local-level control of a humanoid robot prototype with force-driven balance",
        "doc_scopus_id": "67649674678",
        "doc_doi": "10.1109/ICHR.2007.4813925",
        "doc_eid": "2-s2.0-67649674678",
        "doc_date": "2007-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Computer Vision and Pattern Recognition",
                "area_abbreviation": "COMP",
                "area_code": "1707"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            }
        ],
        "doc_keywords": [
            "Adaptive behaviour",
            "Advanced control algorithms",
            "Coordinated motion",
            "Distributed architecture",
            "Force interaction",
            "Hardware experiment",
            "Humanoid robotics",
            "Level controllers"
        ],
        "doc_abstract": "The recent trend of humanoid robotics research has been deeply influenced by concepts such as distributed architectures, local control, force interaction and emergence of coordinated motions. A hypothesis is that feedback control from several sensors, such as force sensors and inertial devices, and more advanced control algorithms will be a key issue for the next developments. In this paper, we discuss how these concepts have been applied to a custom low-cost humanoid platform developed for research purposes. The humanoid robot is equipped with a rich set of sensors enabling the evaluation of simple feedback rules used online to control the robot. A great focus has been given to a force-driven controller based on the Jacobian transpose. A kind of intermediate local-level controller is implemented based on force sensing, providing robust and adaptive behaviour. The proposed ideas and concepts are introduced and validated in several hardware experiments. © 2008 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Online hierachical control for legged systems based on the interaction forces",
        "doc_scopus_id": "77954076028",
        "doc_doi": null,
        "doc_eid": "2-s2.0-77954076028",
        "doc_date": "2006-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computer Vision and Pattern Recognition",
                "area_abbreviation": "COMP",
                "area_code": "1707"
            },
            {
                "area_name": "Information Systems",
                "area_abbreviation": "COMP",
                "area_code": "1710"
            },
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            }
        ],
        "doc_keywords": [
            "Biped Robot",
            "Control methodology",
            "Degrees of freedom",
            "External perturbations",
            "Hierarchical structures",
            "Interaction forces",
            "Legged robots",
            "Moving platform",
            "Non-linear",
            "On-line planning",
            "Simulation analysis",
            "Tangential reaction force",
            "Underlying principles"
        ],
        "doc_abstract": "This paper presents a motion planning and control method with application in the field of legged robots. The general aim is to explore a set of simple underlying principles that govern balance of posture and gait of biped robots, and to develop control methodologies for such a highly unstable and non linear plants. The proposed controller reflects a hierarchical structure based on the interaction forces between the foot and ground and simple feedback rules used online. The algorithms are applied to a simulated 3-D leg model with five degrees of freedom (DOF). The simulation analyses demonstrate the capability of the control system to keep balance when the leg executes different tasks. To validate the proposed method several aspects are investigated, such as the posture robustness on the level ground when subject to external perturbations, the adaptation when standing in a moving platform and the improvements introduced by the compensation of the tangential reaction forces.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Design and low-level control of a humanoid robot using a distributed architecture approach",
        "doc_scopus_id": "33751556042",
        "doc_doi": "10.1177/1077546306070592",
        "doc_eid": "2-s2.0-33751556042",
        "doc_date": "2006-12-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Automotive Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2203"
            },
            {
                "area_name": "Materials Science (all)",
                "area_abbreviation": "MATE",
                "area_code": "2500"
            },
            {
                "area_name": "Aerospace Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2202"
            },
            {
                "area_name": "Mechanics of Materials",
                "area_abbreviation": "ENGI",
                "area_code": "2211"
            },
            {
                "area_name": "Mechanical Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2210"
            }
        ],
        "doc_keywords": [
            "Distributed control",
            "Humanoid robots",
            "Modular architectures",
            "Servomotor control"
        ],
        "doc_abstract": "This article describes methods and strategies used to develop a humanoid robot with a distributed architecture approach where centralized and local control co-exist and concur to provide robust full monitoring and efficient control of a complex system with 22 DOF. A description of the hardware is given before introducing the architecture, since that greatly influences the methods implemented for the control systems and helps in understanding the general decisions. The platform is still undergoing improvement, but the results are very promising, mainly because many potential approaches and research issues have presented themselves and will provide opportunities to test distributed control systems with possibilities that go far beyond the classical control of robots. Some practical issues of servomotor control are also considered since that turned out to be necessary before implementing higher levels of control-these are, in turn, addressed in the last part the article, which gives an example to demonstrate the possibility of keeping a humanoid robot in an upright balanced position using only local control after reaction forces on the ground. © 2006 SAGE Publications.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Development of a low-cost humanoid robot: Components and technological solutions",
        "doc_scopus_id": "84881164437",
        "doc_doi": "10.1007/3-540-26415-9_50",
        "doc_eid": "2-s2.0-84881164437",
        "doc_date": "2006-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Human-Computer Interaction",
                "area_abbreviation": "COMP",
                "area_code": "1709"
            },
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            }
        ],
        "doc_keywords": [
            "Autonomous platforms",
            "Distributed control",
            "Distributed control architectures",
            "Engineering methods",
            "Force sensor",
            "Humanoid robot",
            "Off-the-shelf technologies",
            "Technological solution"
        ],
        "doc_abstract": "The paper presents a set of solutions to build a humanoid robot at reduced costs using off-the-shelf technology, but still aiming at a fully autonomous platform for research. The main scope of this project is to have a working prototype capable of participating in the RoboCup humanoid league, and to offer opportunities for under and pos-graduate students to apply engineering methods and techniques in such an ambitious and overwhelming endeavor. The most relevant achievements on this implementation include the distributed control architecture, based on a CAN network, and the modularity at the system level. These features allow for localized control capabilities, based both on global and local feedback from several sensors, ranging from joint position monitoring to force sensors. Force sensors on the feet were designed and integrated using strain gauges properly calibrated and electrically conditioned. Although some issues are yet to be completed, the stage of development is already enough for practical experiments and to obtain positive conclusions about the solutions proposed. © 2006 Springer-Verlag Berlin Heidelberg.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Motion planning and control strategies for a distributed architecture humanoid robot",
        "doc_scopus_id": "80051583080",
        "doc_doi": "10.3182/20060906-3-it-2910.00129",
        "doc_eid": "2-s2.0-80051583080",
        "doc_date": "2006-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            }
        ],
        "doc_keywords": [
            "Biped walking",
            "Control parameters",
            "Distributed architecture",
            "Distributed control architectures",
            "Force interaction",
            "Fractional-order controllers",
            "Legged robots",
            "Trajectory Planning"
        ],
        "doc_abstract": "This paper describes motion-control algorithms for a humanoid robot based on distributed control architecture. Towards its implementation, two different approaches based on positional and force control algorithms are revisited. At the same time, a new design procedure is proposed that consists of a fractional-order controller combined with a genetic algorithm for optimal tuning of the control parameters. The control algorithms are tested through several computer simulations and its robustness is discussed. Copyright © 2006 IFAC.",
        "available": true,
        "clean_text": "serial JL 314898 291210 291718 291882 291883 31 IFAC Proceedings Volumes IFACPROCEEDINGSVOLUMES 2016-04-23 2016-04-23 2016-04-23 2016-04-23 2016-04-23T09:02:33 S1474-6670(16)38608-6 S1474667016386086 10.3182/20060906-3-IT-2910.00129 S350 S350.1 HEAD-AND-TAIL 2022-05-30T11:56:57.326567Z 0 0 20060101 20061231 2006 2016-04-23T09:18:07.111766Z rawtext articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate isbn isbns isbnnorm isbnsnorm issfirst issn issnnorm issuelist itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype ssids alllist content subj tomb vol volfirst volissue volumelist yearnav affil articletitle auth authfirstini authfull authkeywords authlast primabst ref 1474-6670 14746670 978-3-902661-16-6 9783902661166 false 39 39 15 15 Volume 39, Issue 15 129 773 778 773 778 2006 2006 2006-01-01 2006-12-31 2006 8th IFAC Symposium on Robot Control article fla Copyright © 2006 IFAC. Published by Elsevier Ltd. All rights reserved. MOTIONPLANNINGCONTROLSTRATEGIESFORADISTRIBUTEDARCHITECTUREHUMANOIDROBOT PUGA J HIRAI 1998 1321 1326 K YAMAGUCHI 1999 368 374 J PARK 2000 3353 3358 J SUGIHARA 2002 1404 1409 T KAJITA 2003 1644 1650 S VUKOBRATOVIC 1990 M BIPEDLOCOMOTIONDYNAMICSSTABILITYCONTROLAPPLICATION KAJITA 1996 13 19 S FUJIMOTO 1998 2030 2035 Y PARK 2001 870 882 J OLDHAM 1974 K FRACTIONALCALCULUS MILLER 1993 K INTRODUCTIONFRACTIONALCALCULUSFRACTIONALDIFFERENTIALEQUATIONS TENREIRO 1997 107 122 J PUGAX2006X773 PUGAX2006X773X778 PUGAX2006X773XJ PUGAX2006X773X778XJ item S1474-6670(16)38608-6 S1474667016386086 10.3182/20060906-3-IT-2910.00129 314898 2016-04-23T04:18:07.111766-04:00 2006-01-01 2006-12-31 true 2019772 MAIN 6 53810 849 656 IMAGE-WEB-PDF 1 MOTION PLANNING AND CONTROL STRATEGIES FOR A DISTRIBUTED ARCHITECTURE HUMANOID ROBOT José R. T. Puga1, Filipe M. T. Silva2, Vítor M. F. Santos3, (1) Polytechnic Institute of Porto, 4200-072, Porto, Portugal (2,3) University of Aveiro, 3810-193 Aveiro, Portugal, Abstract: This paper describes motion-control algorithms for a humanoid robot based on distributed control architecture. Towards its implementation, two different approaches based on positional and force control algorithms are revisited. At the same time, a new design procedure is proposed that consists of a fractional-order controller combined with a genetic algorithm for optimal tuning of the control parameters. The control algorithms are tested through several computer simulations and its robustness is discussed. Copyright © 2006 IFAC Keywords: 5­10 Legged robots, biped walking, trajectory planning, COG control, force interaction control. 1. INTRODUCTION Nowadays, there is an enormous interest around the world in humanoid robots, both from the industry and the academic communities. Much work has been conducted in the past to formulate planning and control algorithms for biped walking. Current works in motion generation fall largely into two groups: trajectory replaying and realtime generation. The former is characterised by pre-planned trajectories that are then played back during walking and modified online through feedback (K. Hirai et al, 1999; J-I. Yamaguchi et al, 1999; J.H. Park, 2000). By contrast, the later generates a trajectory in realtime, feeding back the present state of the system in accordance with the pre-provided goal of the motion (T. Sugihara, 2002; S. Kajita, et al, 2003). With this method, planning and control are executed in a unified way, although requiring a larger amount of computation power. One of the most prominent schemes used to enhance trajectory tracking controllers and to analyse their stability is the socalled Zero Moment Point (ZMP) criterion (M. Vukobratovic et al, 1990). Instead of these timedependent algorithms, other research groups use timeinvariant control schemes based on heuristics and simple feedback rules (J. Pratt and G. Pratt, 1998; S. Kajita, K. Tani, 1996). This paper focuses on the realtime motion generation and the application of a localised fractional order controller for biped locomotion. The most relevant feature of this implementation includes the distributed architecture in which independent and self-contained control units may allow for localized control based on feedback from several sensors. The question is how to implement the local controllers in order to achieve both high mobility and stability. The approach followed in this paper consists of studying a simple model, but keeping enough complexity to allow a comparative evaluation of two distinctive control principles. One algorithm based on the COG Jacobian and other based on the ground reaction forces with a fractional-order controller tuned using a genetic algorithm are studied. Section 2 describes the design and the technological solutions in building the humanoid platform. Section 3 presents the planning and control algorithms. Section 4 proposes the application of fractional-order controllers to enhance the system's performance. Section 5 compares how the principles of previous sections afford the tradeoffs between mobility and stability. Section 6 concludes the paper and outlines the perspectives towards future research. 2. FRAMEWORK: THE HUMANOID PLATFORM The main goal of the project beneath this paper has been the development of a small-size humanoid platform to carry out research on control, navigation and perception in such an ambitious and overwhelming endeavour. Moreover, the authors sought a platform with enhanced flexibility, namely at the level of the system control. 2.1 Mechanical Design The platform has 22 DOF with 12 of them dedicated to the legs, which represent the most challenging part both for designing and control. The structure is made essentially of aluminium and steel for axles and other small components, weights about 6 kg and is about 60 cm tall. Fig. 1 shows the platform. units of sensing, processing and acting capabilities play a key role to allow for localized control based on feedback from several sensors, ranging from joint position monitoring to force sensors. Fig. 2 shows a generic diagram of the architecture control units. Main control Sensorial data Control signals dt MASTER SLAVES Arm Hip SCU6 SCU2 SCU7 SCU3 Ankle and knee SCU4 SCU5 Foot sensors Fig. 2. Simplified diagram of the distributed control architecture. Without loss of generality, some motion joints have been grouped (e.g., entire foot and knee) by vicinity criteria and they are controlled locally by a dedicated board based on a PIC microcontroller. A detailed description of the technical and engineering solutions can be found elsewhere (V. Santos, F. Silva, 2005). 3. PLANNING AND CONTROL: A LOCAL APPROACH Fig. 1. Front view of the humanoid robot. 2.2 Actuators and Sensors Currently, the system actuators are 22 servomotors of three different types according to torque requirements of the several joints: more power on legs and less power on neck and arms. The advantageous trade-off involving cost, power, dimensions and availability explain the option for servomotors. However, dedicated motor control boards proved essential to achieve an accurate control (position, velocity and torque). Perception assumes also a major role in all systems intended to be autonomous. For this platform several perception devices was planned: joint position; joint motor current; force sensors on the feet; inclination of some links; angular velocity of some links and a vision unit. Up to now, only vision has not yet been approached. The remainder sensors were addressed with different levels of accuracy, but all potentially usable with current hardware. 2.3 Computing System The most relevant feature of this implementation include the distributed architecture, based on a CAN bus, in which independent and self-contained control units may allow either a cooperative or a standalone operation. The integration in these simpler control Biped robots exhibit complex dynamic phenomena that make difficult their analysis and control. One solution is to closely relate the motion planning and control problems. In this section, two commonly used approaches are revisited: balance control by manipulating the CoM and control based on the interaction forces (direct force control). A dominant theme of work in realtime motion generation is their flexibility in the sense of both strong tunability and multi-functionality. We raise the question to what extent the control algorithms formalised below are able to absorb and compensate disturbances and to what extent the disturbances act on the movement dynamics. The open challenge is to allow local controllers to perform actuator control based on sensor feedback and a general directive. As it appears, it is up to the degrees of freedom nearest to the ground ­ ankle and knee ­ to assure the mobility and stability of the system, and to the degrees of freedom more distant from the ground ­ hip and trunk ­ the main role of compensation. For instance, supposing that the global order is to keep balance in an upright position, although all actuators can intervene, the ankle and knee joints have a relevant role to keep balance. It is important to point out that sensory feedback to the central unit may play a role in this process, and it is not surprising that the system shows most strongly a level of movement planning that is little affected by disturbances. 3.1 Simple Model For the present purposes, we restrict our attention to a simple model that keeps enough complexity by considering the unilateral constraints forces at the foot. The robot model attempted is a kinematics chain consisting of a planar two-DOF leg with a maximum height of L = 33cm and a total mass of M = 5kg (see Table I). Table I ­ Robot and environment parameters. Robot Link Thigh Shank Foot Mass (kg) 4.0 0.6 0.4 Length li (m) 0.165 0.165 0.12 ri (m) 0.09 0.12 0.04 Spring-damper model Kx (N/m) 50.0×103 Ky (N/m) 200.0×10 3 T position of the COG, respectively, the matrix J G is the transpose of the COG Jacobian, and K G is a constant positive gain. Second, it is possible to define a desired joint trajectory that gives rise to the following term: Jref = K J ( ref - ) ref (2) Bx (Ns/m) 1000.0 By (Ns/m) 250.0 and are the reference and the real joint where position, respectively. K J is a constant positive gain. The last equations integrate in a hierarchical way the dynamics associated with the COG and with the desired joint trajectories, such as: ref ref = COG + Jref e ref - K h COG (3) Robotic System It is, also, assumed the existence of two actuators (ankle and knee) and two contact points where the force sensors are inserted. The contact of the foot with the constraint surface is modelled through a linear spring-damper system in the horizontal and vertical directions (Fig. 3). Further, the friction is assumed to be large enough to avoid any foot's slippage. mt force sensor y x Task Description CoM Balance Control Joint Motion References + Motion Goals: - Joint trajectory - CoM trajectory Position Controller Biped Robot CoG Motion References Fig. 4. Blocks diagram of the COG Balance Control. lt force sensor support foot Bx Kx 3.3 Force Interaction Control The difficult relation between planning and stability has justified a different line of thought where the skill of locomotion emerges from the physical interaction between the machine and the environment itself (Y. Fujimoto et al, 1998; J. Park, 2001). In the following, we propose a control algorithm based on simple motion goals taking into account the interaction forces between the foot and the ground (Fig. 5). The relevant aspect of the proposed algorithm is the consideration of the ground reaction forces as control inputs for regulating the desired motion goals. Here, the two variables to be controlled are the normal reaction forces across the heel and at the toe. The reference signals are generated automatically in result of the imposed motion goals. For the present purposes, the desired normal force is calculated from the errors in the vertical hip pose using a linear controller: d d f nd = BW + K pf yhip - yhip + K vf yhip - yhip Bx By ground Ky Ky By Kx Detailed view of the foot-ground contact model ms ls Y X lf Fig. 3. Planar 2-dof foot-leg model and constraint surface. 3.2 COG Balance Control A question that may bring up is to know how to conciliate two imperatives ­ mobility and stability ­ that in many circumstances are contradictories. On one hand, whenever the mobility goals can be achieved, it is advantageous to maximize the stability. On the other hand, it may be necessary to sacrifice the mobility goals (general directives) to assure the dynamic stability. In this line of thought, the other algorithm can be divided in two steps ( Fig. 4). First, the COG Jacobian is used to obtain a relation between the velocity of the centre of gravity, COG , and the joint velocities, . In order to reduce the computation time, this relation is written using the transpose of the Jacobian, as follows: (1) x G are the reference and the real and ref COG ( ) ( ) (4) and K vf where BW is the total system's weight, f Kp are appropriate constant feedback gains. On the other hand, the desired location of the centre of pressure (COP) is calculated as function of the horizontal centre of gravity (COG), xG , as follows: ref ref COP d = K COP xG - xG + KvCOP xG - xG p = J KG x T G ( ref G - xG ) ( ) ( ) (5) where ref xG This means that the reference COP is actively used to calculate the distribution of the total reaction force along the extremities of the support foot. These are the variables that some force control algorithm must follow. Finally, the output signals obtained for each extremity of the foot are then transformed into joint torques by using the transpose of the Jacobian matrices. In other words, the stance leg \"feels\" the forces while the controller distributes them as driving torques in order to regulate the desired high level directive. This view has important consequences because the system is able to adapt its behaviour in face of changing conditions (e.g., environment parameters or additional load) and under perturbation (e.g., external forces). Task Description Force Interaction Control ref ref f heel , f toe The central contribution of this paper emerges when answering two questions. The first is related with the basic control actions: why not to extend them in a continuous way? Most of the time-dependent algorithms involve the tracking of some computed trajectories using a PID control law. It is important to realize that all these types of controllers are particular cases of the PI D µ controller. In general form, its transfer function is given by: H ( s ) = K + K s + K µ s µ (9) Robotic System where the pair ( K i , i ) represents the control gain and the non-integer order. The central idea behind the use of a fractional controller is illustrated in Fig. 6. For the present purposes, the control laws are designed independently: (i) a fractional order controller is selected for the inner control loop; and (ii) position control for the outer control loops consist of PD laws whose parameters are selected by trialand-error. In the present study the design procedure involves the parameters of a fractional controller with three terms: C P = K Motion Goals: - Hip trajectory - CoM trajectory Force Virtual References Force Controller Biped Robot f heel , f toe Force Sensor/ Environment Fig. 5. Blocks diagram of the Force Interaction Control. 4. FRACTIONAL-ORDER CONTROLLER Fractional calculus is a collection of relatively little-known mathematical results concerning the generalization of the ordinary differentiation and integration to non-integer order. While the subject dates back to the origins of calculus, they have until recently found little application as a scientific and engineering tool. This situation is beginning to change and there are a growing number of research areas that employ fractional calculus, such as: biology; electronics; signal processing; modelling and control theory (K.B. Oldham et al, 1974; K.S. Miller; J.A. Tenreiro Machado 1997). First, we give an overview of the fundamentals of fractional calculus and its application in control. Based on these results, we present a non-integer order controller and its tuning by a genetic algorithm. One of the several definitions of non-integer order derivatives is due to the work of Grünwald and Letnikoff: D f (t ) = lim k =0 ( K , ) ( K µ , µ ) (10) Given the additional fit parameter, the second question remains: how to select the scheme and the parameters of the controller? It can be expected that fractional order controllers may achieve better performance and robustness results when compared with conventional ones. However, the selection and tuning of the parameters (i.e., control gains and noninteger orders) is not always straightforward. In this paper, a genetic algorithm was preferred over other randomized search methods (F. Silva, V. Santos, 2005). µ PID PD 1 PI -1 P O 1 h ( -1 ) k ( + 1 ) f ( t - k h ) , ( k + 1 ) ( - k + 1 ) (6) k =0 + Fig. 6. Generalisation of a PID controller. where ( ) is the gamma function. In order to compute a non-integer order derivative of a sampled signal, definition (6) can be approximated such that the total sum is truncated after a finite number of terms and the time-step h is approximated by the sampling time T ( t = n T ): D f (t ) 1 T 5. SIMULATION RESULTS In order to verify the effectiveness of the proposed controllers several simulations are carried out. The results displayed below are all based on the following path: the double inverted pendulum is standing, moves down and up again to the initial posture. The initial state is set to ( xhip , yhip ) = ( -0.039, 0.31) and the desired xG should be zero along the motion. In the following, we discuss the controller's design, the properties and relationship between both control strategies, as well as the behaviour of the system under perturbation. f (t - k T ) k k =0 n (7) n where the coefficients k can be calculated iteratively using the expression: 0 =1 k = 1 - +1 k -1 , k = 1, 2,3, k (8) 5.2 Behaviour under Perturbation The controller's performance is evaluated by applying two unpredicted perturbations. The first perturbation corresponds to a horizontal force of +10 N applied at the hip during 20 ms. Another common disturbance experienced by a walking robot is a change on body mass. An external virtual load of 10% of the body mass is add instantaneously on the hip at a predefined instant of time (4.25 s). For comparative purposes, the simulation results for level ground include the control approaches proposed in Section 3. The present paper restricts the attention to the single support phase, but ignoring the impact and the transfer of support. From the results presented in Fig. 8 and Fig. 9, a few remarks ought to be made. First, the results obtained provide an intuitive understanding of the postural recovery. The results illustrate the capability of the system to adapt to external forces and to changes in the body mass. The second observation is that the system's behaviour is similar. The force and the COG controllers are effectives to generate the desired motion, while the COP remains inside the support covered by the stance foot. Further, the controllers achieve the desired height profile, while maintaining an adaptive control solution in face of external disturbances. At this stage, the trade-off for each implementation resumes to the feedback information needed. However, it must be pointed out the apparent differences between position control and force control remains for unknown terrain profiles and whenever impacts occur. In conclusion, the proposed algorithms seem to be well-adapted to the regulation of the basic requirements proposed above. Fig. 7. Snapshots of the computer simulation. 5.1 Controller's Optimization We first consider the controller's design and discuss how the fractional order controller enhances the overall performance. In the simulations below, it was decided to adopt the control parameters obtained by taking the tracking errors (position or force). No effort has been made to optimise the fit of the parameters of other sub-controllers (outer loops). The optimization algorithm produced optimal solutions for the following cases: an integer-order PI controller, a fractional PI controller and a fractional PI D µ controller. Table II shows the performance of the best controllers found by the genetic algorithm considering the force interaction approach. From the view point of tracking errors, the improvements are clear when evolving from the integer-order PI to the fractional controller. More generally, however, an attempt to reduce the overshoot or the settling time implies an increase of the tracking errors, and vice-versa. This issue clearly deserves further experimentation. Table II ­ Control parameters optimised by GA. K 0.0 0.0 0.0 K -1.0 -0,82 Kµ µ - Force Errors (N) PI PI µ 17.5 120.0 50.0 3000.0 -740 2500.0 - 0.53 0.41 0.32 PI D -1.04 580.0 -0.55 (a) (b) (c) Fig. 8. COG Balance Control ­ temporal evolution of the: (a) hip motion; (b) normal ground reaction forces; (c) joint torques (up); centre of pressure COP and vertical projection of the COG (down). (a) (b) (c) Fig. 9. Force Interaction Control ­ temporal evolution of the: (a) hip motion; (b) normal ground reaction forces; (c) joint torques (up); centre of pressure COP and vertical projection of the COG (down). 6. CONCLUSIONS In this paper, two control algorithms are proposed to allow for localized control of humanoids based on feedback, ranging from joint position to force sensors. The simulation results give some intuitive understanding of the capability to explore the disturbance adaptation. The paper also demonstrates by simulation the application of a fractional-order controller in the tracking of the desired trajectories. The use of a genetic algorithm helps to find an adequate selection of the control parameters and, therefore, to enhance the overall performance. Besides the obvious necessary extension to the physical robot, there are a number of issues to be investigated. Ongoing research focuses the main directions to: i) extend to the lateral motion; ii) the complete robot model, incorporating the trunk and swing leg; and iii) address the challenging issues of impact and smooth transfer of support. In this sense, it seems essential to combine the proposed control methods with more advanced algorithms such as adaptive and learning strategies. ACKNOWLEDMENTS The first author would like to acknowledge FCT, FEDER, POCTI, POSI, POCI, POSC and ISEP for their support to R&D Projects and GECAD Unit. REFERENCES K. Hirai et al., The Development of Honda Humanoid Robot, Proc. IEEE Int. Conf. on R&A, pp. 1321-1326, 1998. J-I. Yamaguchi et al., Development of a Bipedal Humanoid Robot ­ Control Method of Whole Body Cooperative Dynamic Biped Walking. Proc. IEEE Int. Conf. Robotics & Automation, pp. 368-374, 1999. J.H. Park, H.C. Cho, An On-line Trajectory Modifier for the Base Link of Biped Robots to Enhance Locomotion Stability, Proc. IEEE Int. Conf. Robotics & Automation, pp. 3353-3358, 2000. T. Sugihara, Y. Nakamura, H. Inoue, Realtime Humanoid Motion Generation Through ZMP Manipulation Based on Inverted Pendulum Control, Proc. IEEE Int. Conf. Robotics & Automation, pp. 1404-1409, 2002. S. Kajita, et al., Resolved Momentum Control: Humanoid Motion Planning Based on the Linear Angular Momentum, Proc. IEEE Int. Conf. Intelligent Robots and Systems, pp. 1644-1650, 2003. M. Vukobratovic et al., Biped Locomotion ­ Dynamics, Stability, Control and Application, Springer-Verlag, 1990. J. Pratt and G. Pratt, Intuitive Control of a Planar Bipedal Walking Robot, Proc. IEEE Int. Conf. on R&A, pp. 20142021, 1998. S. Kajita, K. Tani, Experimental Study of Biped Dynamic Walking, IEEE Control Systems, vol. 16, n. 1, pp. 13-19, 1996. V. Santos, F. Silva, Development of a Low-Cost Humanoid Robot: Components and Technological Solutions, Proc. Int. Conf. on Climbing and Walking Robots, CLAWAR05, 12-15 Sept., London, 2005. Y. Fujimoto, A. Kawamura, Robust Biped Walking with Active Interaction Control between Foot and Ground, Proc. IEEE Int. Conf. on R&A, pp. 2030-2035, 1998. J. Park, Impedance Control for Biped Robot Locomotion, IEEE Trans. on Robotics & Automation, vol. 17, n. 6, pp. 870-882, 2001. K.B. Oldham and J. Sparier, The Fractional Calculus, Academic Press, New York, 1974. K.S. Miller and B. Ross, An Introduction to the Fractional Calculus and Fractional Differential Equations, Wiley, New York, 1993. J.A. Tenreiro Machado, Analysis and Design of FractionalOrder Digital Control Systems, Journal of System Analysis-Modeling-Simulation, 27, 107-122, 1997. F.M. Silva, V.M Santos, \"Towards an Autonomous SmallSize Humanoid Robot: Design Issues and Control Strategies\", Proc. on Computational Intelligence in Robotics and Automation, CIRA2005, Espoo, Finland, 2005. (N) PI PI µ 17.5 120.0 50.0 3000.0 -740 2500.0 - 0.53 0.41 0.32 PI D -1.04 580.0 -0.55 (a) (b) (c) Fig. 8. COG Balance Control ­ temporal evolution of the: (a) hip motion; (b) normal ground reaction forces; (c) joint torques (up); centre of pressure COP and vertical projection of the COG (down). (a) (b) (c) Fig. 9. Force Interaction Control ­ temporal evolution of the: (a) hip motion; (b) normal ground reaction forces; (c) joint torques (up); centre of pressure COP and vertical projection of the COG (down). 6. CONCLUSIONS In this paper, two control algorithms are proposed to allow for localized control of humanoids based on feedback, r IPV 38608 S1474-6670(16)38608-6 10.3182/20060906-3-IT-2910.00129 IFAC MOTION PLANNING AND CONTROL STRATEGIES FOR A DISTRIBUTED ARCHITECTURE HUMANOID ROBOT José R.T. Puga 1 Filipe M.T. Silva 2 Vítor M.F. Santos 3 1 Polytechnic Institute of Porto, 4200-072, Porto, Portugal Polytechnic Institute of Porto Porto 4200-072 Portugal 2 University of Aveiro, 3810-193 Aveiro, Portugal University of Aveiro Aveiro 3810-193 Portugal 3 University of Aveiro, 3810-193 Aveiro, Portugal University of Aveiro Aveiro 3810-193 Portugal This paper describes motion-control algorithms for a humanoid robot based on distributed control architecture. Towards its implementation, two different approaches based on positional and force control algorithms are revisited. At the same time, a new design procedure is proposed that consists of a fractional-order controller combined with a genetic algorithm for optimal tuning of the control parameters. The control algorithms are tested through several computer simulations and its robustness is discussed. Keywords 5-10 Legged robots biped walking trajectory planning COG control force interaction control References Hirai, 1998 K. Hirai The Development of Honda Humanoid Robot Proc. IEEE Int. Conf. on R&A 1998 1321 1326 Yamaguchi, 1999 J.-I. Yamaguchi Development of a Bipedal Humanoid Robot – Control Method of Whole Body Cooperative Dynamic Biped Walking. Proc IEEE Int. Conf. Robotics & Automation 1999 368 374 Park and Cho, 2000 J.H. Park H.C. Cho An On-line Trajectory Modifier for the Base Link of Biped Robots to Enhance Locomotion Stability Proc. IEEE Int. Conf. Robotics & Automation 2000 3353 3358 Sugihara et al., 2002 T. Sugihara Y. Nakamura H. Inoue Realtime Humanoid Motion Generation Through ZMP Manipulation Based on Inverted Pendulum Control Proc. IEEE Int. Conf. Robotics & Automation 2002 1404 1409 Kajita, 2003 S. Kajita Resolved Momentum Control: Humanoid Motion Planning Based on the Linear Angular Momentum Proc. IEEE Int. Conf. Intelligent Robots and Systems 2003 1644 1650 Vukobratovic, 1990 M. Vukobratovic Biped Locomotion – Dynamics, Stability, Control and Application 1990 Springer-Verlag Pratt and Pratt, 1998 J. Pratt and G. Pratt, Intuitive Control of a Planar Bipedal Walking Robot, Proc. IEEE Int. Conf. on R&A, pp. 2014- 2021, 1998. Kajita and Tani, 1996 S. Kajita K. Tani Experimental Study of Biped Dynamic Walking IEEE Control Systems 16 1 1996 13 19 Santos and Silva, 2005 V. Santos, F. Silva, Development of a Low-Cost Humanoid Robot: Components and Technological Solutions, Proc. Int. Conf. on Climbing and Walking Robots, CLAWAR05, 12-15 Sept., London, 2005. Fujimoto and Kawamura, 1998 Y. Fujimoto A. Kawamura Robust Biped Walking with Active Interaction Control between Foot and Ground, Proc. IEEE Int. Conf. on R&A 1998 2030 2035 Park, 2001 J. Park Impedance Control for Biped Robot Locomotion, IEEE Trans Robotics & Automation 17 6 2001 870 882 Oldham and Sparier, 1974 K.B. Oldham J. Sparier The Fractional Calculus 1974 Academic Press New York Miller and Ross, 1993 K.S. Miller B. Ross An Introduction to the Fractional Calculus and Fractional Differential Equations 1993 Wiley New York Tenreiro and Machado, 1997 J.A. Tenreiro Machado Analysis and Design of Fractional-Order Digital Control Systems Journal of System Analysis-Modeling-Simulation 27 1997 107 122 Silva and Santos, 2005 F.M. Silva, V.M Santos, “Towards an Autonomous Small-Size Humanoid Robot: Design Issues and Control Strategies”, Proc. on Computational Intelligence in Robotics and Automation, CIRA2005, Espoo, Finland, 2005. "
    },
    {
        "doc_title": "Towards an autonomous small-size humanoid robot: Design issues and control strategies",
        "doc_scopus_id": "28444472385",
        "doc_doi": null,
        "doc_eid": "2-s2.0-28444472385",
        "doc_date": "2005-12-12",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Computational Mathematics",
                "area_abbreviation": "MATH",
                "area_code": "2605"
            }
        ],
        "doc_keywords": [
            "Distributed control",
            "Fractional calculus",
            "Humanoid robot"
        ],
        "doc_abstract": "This paper presents the design considerations of a small-size humanoid robot. The design process has revealed much about the several problems, challenges and tradeoffs imposed by biped locomotion. Among them, we here focus on the control of a single leg and its behaviour when assuming a forward motion. The controller is based on simple motion goals taking into account the reaction forces between the feet and the ground. A new method is proposed which appears to be well adapted to the class of problem considered: the use of a fractional-order controller combined with a genetic algorithm for optimal tuning of the control parameters. The control algorithm is tested through several simulations and its robustness is discussed. © 2005 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Engineering solutions to build an inexpensive humanoid robot based on a distributed control architecture",
        "doc_scopus_id": "33846634997",
        "doc_doi": "10.1109/ICHR.2005.1573550",
        "doc_eid": "2-s2.0-33846634997",
        "doc_date": "2005-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Humanoid robots",
            "Mechanical design",
            "Modular architectures"
        ],
        "doc_abstract": "Building a humanoid robot is a formidable engineering task requiring the combination of mechanical, electrical and software technologies. This paper presents the main steps to design a low cost fully autonomous humanoid platform and the set of solutions proposed. The main scope of the project beneath this paper is to carry out research on control, navigation and perception, whilst offering opportunities for under and pos-graduate students to apply engineering methods and techniques. The main features of the 22 degrees-of-freedom robot include the distributed control architecture, based on a CAN bus, and the modularity at the system level. Although some issues are yet to be addressed, the stage of development is already mature for practical experiments and to obtain the first conclusions on the potential of the proposed solutions. © 2005 IEEE.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Towards force interaction control of biped walking robots",
        "doc_scopus_id": "14044273691",
        "doc_doi": null,
        "doc_eid": "2-s2.0-14044273691",
        "doc_date": "2004-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Biped walking robots",
            "Bipedal systems",
            "Force control algorithms",
            "Learning strategies"
        ],
        "doc_abstract": "This paper addresses the problem of modelling and control of a biped robot by combining Cartesian-based position and force control algorithms. The walking cycle is divided in two phases: single support, in which one leg is in contact with the ground and the other leg swings forward, and double support, in which the forward leg absorbs the impact and gradually accepts the robot's weight The contact of the foot with the constrained surface is modelled through nonlinear spring-damper systems. The proposed control approach is based on simple motion goals taking into account the reaction forces between the feet and the ground. The control algorithm is tested through several experiments and its robustness is discussed.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Goal-oriented biped walking based on force interaction control",
        "doc_scopus_id": "0034865721",
        "doc_doi": "10.1109/ROBOT.2001.933262",
        "doc_eid": "2-s2.0-0034865721",
        "doc_date": "2001-01-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "This paper addresses the problem of modelling and control of a biped robot by combining Cartesian-based position and force control algorithms. The walking cycle is divided in two phases: single support, in which one leg is in contact with the ground and the other leg swings forward, and double support, in which the forward leg absorbs the impact and gradually accepts the robot's weight. The contact of the foot with the constrained surface is modelled through linear and nonlinear spring-damper systems. The proposed control approach is based on simple motion goals taking into account the reaction forces between the feet and the ground. The control algorithm is tested through several experiments and its effectiveness and robustness is discussed.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Position/force control of biped walking robots",
        "doc_scopus_id": "0034497688",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0034497688",
        "doc_date": "2000-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Hardware and Architecture",
                "area_abbreviation": "COMP",
                "area_code": "1708"
            }
        ],
        "doc_keywords": [
            "Biped robots",
            "Cartesian coordinates",
            "Walking cycles",
            "Walking robots"
        ],
        "doc_abstract": "This paper addresses the problem of modelling and control of a biped robot by combining Cartesian-based position and force control algorithms. The complete walking cycle is divided in two phases: i) single support - in which it is studied the trajectory controllability based on simple motion goals and ii) exchange of support - in which the forward leg absorbs the impact and then gradually accept the robot's weight. The contact of the foot with the constrained surface is modelled through linear spring-damper systems. The system's controllability is enhanced through the insertion of a dynamic selection matrix that modifies the actuating profile in each phase. The control algorithms are simulated and their effectiveness and robustness are discussed.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Controllability analysis of biped walking robots",
        "doc_scopus_id": "0034482340",
        "doc_doi": "10.1109/amc.2000.862946",
        "doc_eid": "2-s2.0-0034482340",
        "doc_date": "2000-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Modeling and Simulation",
                "area_abbreviation": "MATH",
                "area_code": "2611"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            }
        ],
        "doc_keywords": [
            "Biped walking robots",
            "Controllability analysis"
        ],
        "doc_abstract": "The focus of this paper is the problem of modelling and control of a biped robot by combining Cartesian-based position and force control algorithms. The complete walking cycle is divided in two phases: i) a single support phase, in which it is studied the trajectory controllability based on simple motion goals and ii) an exchange of support phase, in which the forward leg should absorb the impact and then gradually accept the robot's weight. The contact of the foot with the constrained surface is modelled through linear spring-damper systems both in the vertical and horizontal directions. The system's controllability is enhanced through the insertion of a dynamic selection matrix that modifies the actuating profile in each phase. The control algorithms are simulated and their effectiveness and robustness are discussed.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Energy analysis during biped walking",
        "doc_scopus_id": "0032641031",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0032641031",
        "doc_date": "1999-01-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Artificial Intelligence",
                "area_abbreviation": "COMP",
                "area_code": "1702"
            },
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            }
        ],
        "doc_keywords": [
            "Biped walking",
            "Energy analysis",
            "Foot clearance",
            "Hip height",
            "Hip offset",
            "Hip ripple",
            "Step length"
        ],
        "doc_abstract": "This paper describes the dynamic analysis of biped locomotion systems. A planar biped is modelled and studied focusing on the problem of energy efficiency. First, the motion of the system is characterised in terms of a set of locomotion variables, namely: step length, hip height, hip ripple, hip offset, foot clearance and link lengths. Afterwards, three cost functions related to energy are proposed: absolute power, power dispersion and power lost. The aim is to understand the influence of these locomotion variables on the energy flow. The performance measures are discussed and the results compared with those observed in nature.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Towards efficient biped robots",
        "doc_scopus_id": "0032309346",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0032309346",
        "doc_date": "1998-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Computer Vision and Pattern Recognition",
                "area_abbreviation": "COMP",
                "area_code": "1707"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "This paper presents the energy analysis of a bipedal walking system. The main goal is to understand the movement strategies in walking and to search for the optimal locomotion variables that minimize a cost function related to energy. Three different indices are proposed: mean absolute power, mean power dispersion and mean power lost. In order to accomplish this goal, in the description and analysis of the motion it is used a set of locomotion variables, namely: step length, hip height, hip ripple, hip offset, foot clearance and link lengths. Based on these variables and their influence on the energy flow, the performance measures are discussed and the results compared with those observed in nature.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Dynamic performance of biped locomotion systems",
        "doc_scopus_id": "0032304349",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0032304349",
        "doc_date": "1998-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Modeling and Simulation",
                "area_abbreviation": "MATH",
                "area_code": "2611"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            },
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "This paper presents the energy analysis of a bipedal walking system. The main goal is to understand the movement strategies in walking and to search for the optimal locomotion variables that minimize the energy consumption. In order to accomplish this goal, a set of locomotion variables is used in the description and analysis of motion. The locomotion variables considered are the following: step length, hip height, hip ripple, hip offset, foot clearance, link lengths and link masses. Based on these variables and their influence on the energy flow, the performance is discussed and the results are compared with those observed in nature.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "On the Statistical/Harmonic Modelling of Mechanical Manipulators",
        "doc_scopus_id": "0032157041",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0032157041",
        "doc_date": "1998-09-01",
        "doc_type": "Article",
        "doc_areas": [
            {
                "area_name": "Medicine (all)",
                "area_abbreviation": "MEDI",
                "area_code": "2700"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "A new approach to the analysis and design of robot manipulators is presented. The novel feature resides on a nonstandard formulation to the modelling problem. Usually, system descriptions are based on a set of differential equations which, in general, require laborious computations and may be difficult to analyze. These facts motivate the need of alternative models based on different mathematical concepts. The proposed statistical approach to the Fourier modelling gives clear guidelines towards the optimization of the robot kinematics and point out structural characteristics of the trajectory planning algorithms.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Kinematic analysis of artificial biped locomotion systems",
        "doc_scopus_id": "0031377613",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0031377613",
        "doc_date": "1997-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            },
            {
                "area_name": "Materials Science (all)",
                "area_abbreviation": "MATE",
                "area_code": "2500"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "This paper presents the kinematic study of robotic biped locomotion systems. The main purpose is to determine the kinematic characteristics and the system performance during walking. For that objective, the prescribed motion of the biped is completely characterized in terms of five locomotion variables: step length, hip height, maximum hip ripple, maximum foot clearance and link lengths. In this work, we propose three methods to quantitatively measure the performance of the walking robot: locomobility measure, perturbation analysis, and lowpass frequency response. These performance measures are discussed and compared in determining the robustness and effectiveness of the resulting locomotion.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Kinematic aspects of robotic biped locomotion systems",
        "doc_scopus_id": "0031348204",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0031348204",
        "doc_date": "1997-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Control and Systems Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2207"
            },
            {
                "area_name": "Software",
                "area_abbreviation": "COMP",
                "area_code": "1712"
            },
            {
                "area_name": "Computer Vision and Pattern Recognition",
                "area_abbreviation": "COMP",
                "area_code": "1707"
            },
            {
                "area_name": "Computer Science Applications",
                "area_abbreviation": "COMP",
                "area_code": "1706"
            }
        ],
        "doc_keywords": [
            "Planar biped model",
            "Walking robots"
        ],
        "doc_abstract": "This paper presents the kinematic study of robotic biped locomotion systems. The main purpose is to determine the kinematic characteristics and the system performance during walking. For that objective, the prescribed motion of the biped is completely characterized in terms of five locomotion variables: step length, hip height, maximum hip ripple, maximum foot clearance and link lengths. In this work, we propose three methods to quantitatively measure the performance of the walking robot: locomobility measure, perturbation analysis, and lowpass frequency response. These performance measures are discussed and compared in determining the robustness and effectiveness of the resulting locomotion.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Biped locomotion systems: A kinematic point of view",
        "doc_scopus_id": "0031337232",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0031337232",
        "doc_date": "1997-12-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Electrical and Electronic Engineering",
                "area_abbreviation": "ENGI",
                "area_code": "2208"
            }
        ],
        "doc_keywords": [],
        "doc_abstract": "This paper presents the kinematic study of robotic biped locomotion systems. The main purpose is to determine the kinematic characteristics and the system performance daring walking. For that objective, the prescribed motion of the biped is completely characterized in terms of five locomotion variables: step length, hip height, maximum hip ripple, maximum foot clearance and link lengths. In this work, we propose three methods to quantitatively measure the performance of the walking robot: perturbation analysis, lowpass frequency response and locomobility measure. These performance measures are discussed and compared in determining the robustness and effectiveness of the resulting locomotion.",
        "available": false,
        "clean_text": ""
    },
    {
        "doc_title": "Kinematic evaluation of robotic biped locomotion systems",
        "doc_scopus_id": "0030688845",
        "doc_doi": null,
        "doc_eid": "2-s2.0-0030688845",
        "doc_date": "1997-01-01",
        "doc_type": "Conference Paper",
        "doc_areas": [
            {
                "area_name": "Engineering (all)",
                "area_abbreviation": "ENGI",
                "area_code": "2200"
            }
        ],
        "doc_keywords": [
            "Hip height",
            "Maximum foot clearance",
            "Maximum hip ripple",
            "Robotic biped locomotion systems",
            "Step length"
        ],
        "doc_abstract": "This paper presents the kinematic study of robotic biped locomotion systems. The main purpose is to determine the kinematic characteristics and the system performance during walking. For that objective, the prescribed motion of the biped is completely characterized in terms of five locomotion variables: step length, hip height, maximum hip ripple, maximum foot clearance and link lengths. In this work, we propose three methods to quantitatively measure the performance of the walking robot: perturbation analysis, lowpass frequency response and locomobility measure. These performance measures are discussed and compared in determining the robustness and effectiveness of the resulting locomotion.",
        "available": false,
        "clean_text": ""
    }
]