{"scopus-eid": "2-s2.0-85098456035", "originalText": "serial JL 271150 291210 291870 291901 31 90 Computers in Biology and Medicine COMPUTERSINBIOLOGYMEDICINE 2020-12-18 2020-12-18 2020-12-22 2020-12-22 2021-02-18T04:42:31 1-s2.0-S0010482520305114 S0010-4825(20)30511-4 S0010482520305114 10.1016/j.compbiomed.2020.104180 S300 S300.1 FULL-TEXT 1-s2.0-S0010482520X0014X 2021-04-08T04:29:49.090165Z 0 0 20210301 20210331 2021 2020-12-18T01:57:37.637417Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid fundingbodyid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight oauserlicense openaccess openarchive pg pgfirst pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder sponsoredaccesstype srctitle srctitlenorm srctype ssids alllist content oa subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body affil articletitle auth authfirstini authfull authkeywords authlast footnotes grantnumber grantsponsor highlightsabst orcid primabst ref 0010-4825 00104825 UNLIMITED FCT true 130 130 C Volume 130 5 104180 104180 104180 202103 March 2021 2021-03-01 2021-03-31 2021 Regular Articles article fla © 2020 The Authors. Published by Elsevier Ltd. ASEMIAUTOMATICMETHODOLOGYFORANALYSINGDISTRIBUTEDPRIVATEBIOBANKS ALMEIDA J 1 Introduction 2 Genomics interoperability 3 Methodology 3.1 The Genomics Catalogue 3.2 The genomics and proteomics toolkit 3.3 The workflow manager 3.4 Overview 4 Results 5 Research application 5.1 Study example: SARS-CoV-2 5.2 Validation 6 Discussion 7 Conclusions References JOHNSTON 2018 S2 S6 J KAYE 2012 415 431 J JALILI 2017 90 109 V COPPOLA 2019 172 L LITTON 2018 233 241 J LIU 2015 55 68 A BIOBANKINGIN21STCENTURY BIOBANKINGFORPERSONALIZEDMEDICINE AMORIM 2020 102333 A LANGHOF 2017 293 300 H KULYNYCH 2017 94 132 J CLAES 2014 P MCLAREN 2016 814 822 P GRISHIN 2019 1115 1117 D MASSEROLI 2016 3 11 M ALMEIDA 2019 466 473 J PROCEEDINGS12THINTERNATIONALJOINTCONFERENCEBIOMEDICALENGINEERINGSYSTEMSTECHNOLOGIESVOLUME5HEALTHINFHEALTHINF STRATEGIESACCESSPATIENTCLINICALDATADISTRIBUTEDDATABASES GAZIANO 2016 214 223 J SUDLOW 2015 C HOSSEINI 2019 146 148 M TOPPINEN 2020 102353 M CHO 2018 547 551 H IOANNIDIS 2006 609 614 J SHRINGARPURE 2015 631 646 S 2012 57 74 2015 68 74 SILVA 2018 33 42 L OLIVEIRA 2019 J ALMEIDA 2020 100535 J PRATAS 2020 D LIEW 2017 66 C HOLL 2014 352 362 S WOLSTENCROFT 2013 W557 W561 K GOECKS 2010 R86 J ALMEIDA 2019 121 J WU 2020 265 269 F HEENEY 2011 17 25 C PRATAS 2018 1177 1181 D 201826THEUROPEANSIGNALPROCESSINGCONFERENCEEUSIPCO METAGENOMICCOMPOSITIONANALYSISSEDIMENTARYANCIENTDNAISLEWIGHT PRATAS 2018 445 D ZIELEZINSKI 2019 144 A HUANG 2011 593 594 W LIN 2004 Z PRATAS 2020 D VAYENA 2016 e1001937 E HRIPCSAK 2015 574 G BOS 2018 64 I TKACHENKO 2018 221 235 O PROCEEDINGS2018ASIACONFERENCECOMPUTERCOMMUNICATIONSSECURITY LARGESCALEPRIVACYPRESERVINGSTATISTICALCOMPUTATIONSFORDISTRIBUTEDGENOMEWIDEASSOCIATIONSTUDIES GOLDREICH 1998 O KANNAN 2016 603 615 L HUFSKY 2020 F HOFFMANN 2020 M SCHAFFER 2020 1 23 A ALMEIDAX2021X104180 ALMEIDAX2021X104180XJ Full 2020-12-17T17:09:46Z FundingBody Portugal Institutes http://creativecommons.org/licenses/by-nc-nd/4.0/ 2021-12-22T00:00:00.000Z 2021-12-22T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license. © 2020 The Authors. Published by Elsevier Ltd. 2020-12-17T17:04:36.024Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/eoas IMI Innovative Medicines Initiative http://data.elsevier.com/vocabulary/SciValFunders/501100010767 http://sws.geonames.org/6695072 FCT Fundação para a Ciência e a Tecnologia http://data.elsevier.com/vocabulary/SciValFunders/501100001871 http://sws.geonames.org/2264397 item S0010-4825(20)30511-4 S0010482520305114 1-s2.0-S0010482520305114 10.1016/j.compbiomed.2020.104180 271150 2021-04-08T04:29:49.090165Z 2021-03-01 2021-03-31 UNLIMITED FCT 1-s2.0-S0010482520305114-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/MAIN/application/pdf/d8b53214632352a572c43d12e265067e/main.pdf main.pdf pdf true 1912409 MAIN 8 1-s2.0-S0010482520305114-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/PREVIEW/image/png/fdddd0d92a052327de220c1ec5cf04d8/main_1.png main_1.png png 55182 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0010482520305114-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr1/DOWNSAMPLED/image/jpeg/00482cf64105acfd82327350efc26f96/gr1.jpg gr1 gr1.jpg jpg 102992 240 388 IMAGE-DOWNSAMPLED 1-s2.0-S0010482520305114-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr2/DOWNSAMPLED/image/jpeg/89e62231392f53efb48b99395856ce97/gr2.jpg gr2 gr2.jpg jpg 91558 263 535 IMAGE-DOWNSAMPLED 1-s2.0-S0010482520305114-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr3/DOWNSAMPLED/image/jpeg/d431995422efd09bf2441b62404f1740/gr3.jpg gr3 gr3.jpg jpg 115255 352 535 IMAGE-DOWNSAMPLED 1-s2.0-S0010482520305114-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr4/DOWNSAMPLED/image/jpeg/0bb560f95f48ad42fa2c324510bc7f81/gr4.jpg gr4 gr4.jpg jpg 115141 254 535 IMAGE-DOWNSAMPLED 1-s2.0-S0010482520305114-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr1/THUMBNAIL/image/gif/439e86cfc056f0becd710cb394772f1d/gr1.sml gr1 gr1.sml sml 76156 135 219 IMAGE-THUMBNAIL 1-s2.0-S0010482520305114-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr2/THUMBNAIL/image/gif/31ca849ffe6f14bf9270fd5f23f9d6f2/gr2.sml gr2 gr2.sml sml 70900 107 219 IMAGE-THUMBNAIL 1-s2.0-S0010482520305114-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr3/THUMBNAIL/image/gif/93a837c31f14ad42f70fe0f0652d532f/gr3.sml gr3 gr3.sml sml 76244 144 219 IMAGE-THUMBNAIL 1-s2.0-S0010482520305114-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr4/THUMBNAIL/image/gif/e5e3c1cd93891744e82953f532e5193f/gr4.sml gr4 gr4.sml sml 75175 104 219 IMAGE-THUMBNAIL 1-s2.0-S0010482520305114-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr1/HIGHRES/image/jpeg/ba1fa21111bacc6881c4902d9eaeb4dc/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 251665 1064 1721 IMAGE-HIGH-RES 1-s2.0-S0010482520305114-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr2/HIGHRES/image/jpeg/116d65595f99ec681681702bc8f649bf/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 265461 1163 2370 IMAGE-HIGH-RES 1-s2.0-S0010482520305114-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr3/HIGHRES/image/jpeg/e20efc6f2965c77b552974edd3b8d758/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 434092 1559 2369 IMAGE-HIGH-RES 1-s2.0-S0010482520305114-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0010482520305114/gr4/HIGHRES/image/jpeg/74241d5214b3656586ba46f55ce4f248/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 373059 1125 2370 IMAGE-HIGH-RES 1-s2.0-S0010482520305114-am.pdf am am.pdf pdf 1762750 AAM-PDF https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:10M4G3NTWF6/MAIN/application/pdf/b8aedf841974e0418dcd260702a3b611/am.pdf CBM 104180 104180 S0010-4825(20)30511-4 10.1016/j.compbiomed.2020.104180 The Authors Fig. 1 The main actors involved in each study: Researcher (R), Study Manager (SM), and the Data Owners (DO). Fig. 1 Fig. 2 The Genomics Catalogue showing the demo repositories and the first stage of the study request. Fig. 2 Fig. 3 The TASKA workflow manager with an example study to analyse the complexity profile region in genomics data. Fig. 3 Fig. 4 Overview of the proposed methodology involving the three main actors and their responsibilities. Fig. 4 Table 1 The five most representative reference sequences according to the RS (Relative Similarity). ID stands for the order of the top output, length for the size of the reference genome, and GID for the sequence global identifier. Table 1 ID Length RS (%) Reference GID Virus name 1 124884 96.2539 NC_001348.1 HHV3 2 29903 95.4904 NC_045512.2 SARS-CoV-2 3 16568 78.2749 NC_012920.1 MT 4 5028 1.3435 NC_004295.1 HEVv9 5 162114 0.0000 NC_000898.1 HHV 6 Table 2 The twenty most representative SARS-CoV-2 genome sequences according to the RS (Relative Similarity). ID stands for the order of the top output, length for the size of the reference genome, and GID for the sequence global identifier. Table 2 ID Length RS (%) GID 1 29893 97.6044 MT007544.1 2 29854 97.4854 MN996530.1 3 29862 97.4833 MT192759.1 4 29833 97.4813 MT039873.1 5 29881 97.4744 MN988669.1 6 29881 97.4744 MN988668.1 7 29903 97.4724 MN908947.3 8 29903 97.4724 NC_045512.2 9 29891 97.4720 MN996528.1 10 29890 97.4720 MT019532.1 11 29860 97.4695 MT093631.2 12 29825 97.4668 MN996527.1 13 29883 97.4646 MN994468.1 14 29811 97.4619 MT072688.1 15 29882 97.4599 MT184907.2 16 29882 97.4599 MT184909.2 17 29882 97.4599 MT184912.1 18 29882 97.4599 MT159711.2 19 29882 97.4599 MT159714.2 20 29882 97.4599 MT159719.2 ☆ This work has received support from the EU/EFPIA Innovative Medicines Initiative 2 Joint Undertaking under grant agreement No 806968. J.R. Almeida is funded by the National Science Foundation (FCT), under the grant SFRH/BD/147837/2019. D. Pratas is funded by national funds through FCT, I.P., under the Scientific Employment Stimulus - Institutional Call - CI-CTTI-94-ARH/2019 A semi-automatic methodology for analysing distributed and private biobanks João Rafael Almeida a b ∗ Diogo Pratas a c José Luís Oliveira a ∗∗ a DETI/IEETA, University of Aveiro, Aveiro, Portugal DETI/IEETA University of Aveiro Aveiro Portugal DETI/IEETA, University of Aveiro, Aveiro, Portugal b Department of Computation, University of A Coruña, A Coruña, Spain Department of Computation University of A Coruña A Coruña Spain Department of Computation, University of A Coruna, A Coruna, Spain c Department of Virology, University of Helsinki, Helsinki, Finland Department of Virology University of Helsinki Helsinki Finland Department of Virology, University of Helsinki, Helsinki, Finland ∗ Corresponding author. DETI/IEETA, University of Aveiro, Aveiro, Portugal. DETI/IEETA University of Aveiro Aveiro Portugal ∗∗ Corresponding author. Privacy issues limit the analysis and cross-exploration of most distributed and private biobanks, often raised by the multiple dimensionality and sensitivity of the data associated with access restrictions and policies. These characteristics prevent collaboration between entities, constituting a barrier to emergent personalized and public health challenges, namely the discovery of new druggable targets, identification of disease-causing genetic variants, or the study of rare diseases. In this paper, we propose a semi-automatic methodology for the analysis of distributed and private biobanks. The strategies involved in the proposed methodology efficiently enable the creation and execution of unified genomic studies using distributed repositories, without compromising the information present in the datasets. We apply the methodology to a case study in the current Covid-19, ensuring the combination of the diagnostics from multiple entities while maintaining privacy through a completely identical procedure. Moreover, we show that the methodology follows a simple, intuitive, and practical scheme. Keywords Genomics studies Distributed biobanks Genomics cross-exploration Coronavirus 2 SARS-CoV-2 Secondary use 1 Introduction The continuous evolution of sequencing technology prompted a new step in clinical research, in which it is possible to scan the whole-genome of individual DNA samples at an acceptable cost and time [1,2]. This increasing generation of genomics data also led to big data problems which require the reorganization of current biobank policies [3]. In fact, this can be considered an opportunity to build infrastructures that allow the linkage of existing biobanks and bio clinical projects [4]. Biobanking currently represents a new research field that involves international infrastructures and government agencies requiring the creation of policies to provide ethical and legal guidelines for public health [5]. The need for high-quality and clinically annotated biospecimens for personalized medicine and forensic applications is raising new research challenges [6,7]. However, other major problems have followed this growth, namely the evolution of biobanking in a decentralized way, with heterogeneous procedures for data collection and storage, as well as different legal policies for data access [8]. One of the key challenges is to find the right balance between preserving the privacy of the subjects in the study and the data availability for sharing the results through global research networks [2]. Although genomics datasets are not linked to medical records, which preserves subject identity [9], some authors tried to reverse the process only using the DNA present in the datasets. Claes et al. [10] show it is possible to model a 3D face using genomics data obtaining a similar facial appearance. Privacy issues are one of the main obstructions in health research, including in the area of genomics [11,12]. Answers to biomedical questions may currently be hidden in private data repositories that are not explored due to the lack of methodologies to analyse this data [13]. The problem can be addressed at different levels, from biomedical data discovery to multi-repository analysis, i. e., there are gaps in the way biobanks are exposed to the research community and the methodologies currently available are not designed to simplify the exploration of multiple and private repositories. The idea of distributing research questions over distinct organisations and databases has been applied to allow the secondary use of multiple Electronic Health Records (EHR) [14]. However, no such experience has been proposed in the genomics field, which could help in discovering new disease biomarkers, especially in rare diseases. In short, we can identify three main issues that are currently present in genomics studies: • privacy issues: the genomics dataset can contain private information that allows subject identification, which causes access problems; • data interoperability: the metadata of the private repositories are publicly available following heterogeneous description; • data access: since sharing data will violate privacy issues, the exploration of multiple repositories is currently a poorly explored subject. Therefore, for the success of genomics research, it is essential to create solutions that decrease the impact of these issues. In this paper, we present a methodology that allows the exploration of distributed genomics repositories, without giving researchers direct contact with the data. This ensures data privacy and speeds up the process of exploring multiple datasets, which is imperative to increase the impact of new findings. 2 Genomics interoperability Exploring distributed and private biobanks without compromising ethical regulations is a complex subject already studied by the research community. Almost all sequenced genomes are currently stored in protected repositories with strict access rules or securely encrypted [15–18]. However, accessing those datasets allows analysis of a larger number of subjects in order to identify genetic variants that are statistically correlated [19]. This is essential to detect genetic signals expressed with small effect size or in rare variants [20]. The problem with ensuring subjects’ privacy when analyzing their genomics information is crucial. Cho et al. [19] described an approach for genome-wide association studies, using cryptographic techniques for secure data analysis while maintaining the confidentiality of genotypes and phenotypes. Although they ensure a private and secure environment, the data needs to be shared with the participants involved in each study. This solution is very useful, but this scenario requires that all the institutions follow this architecture. Another technique for genomics data sharing is the use of web services that provide only allele-presence information, designated as “beacon”. This was created in the Beacon Project by the Global Alliance for Genomics & Health (GA4GH) 1 1 https://www.ga4gh.org/#/beacon. where users can perform queries about genomics information in the institutional beacons [21]. However, some authors have already studied the risk of using this technique, where users can perform as many queries as they want, based on the limitations of the services. Shringarpure et al. [21] show through simulations that in a beacon with 1 000 subjects, re-identification was possible with 5 000 queries. With the extraordinary advances in genomics, several consortia have collected and made publicly available some of those data after processing, mainly due to the complexity in sharing genomics data and aiming to explore human genes. The Encyclopedia of DNA Elements (ENCODE) project mapped genomics regions of transcription, transcription factor association, chromatin structure and histone modification [22]. This project aims to identify functional elements in the human genomes. The data collected during the project enabled the assignment of biochemical functions for 80% of the genome [22]. In the ENCODE Portal 2 2 https://www.encodeproject.org/. the data is accessible to the research community. Another project with the goal of studying the human genome is the 1000 Genomes Project. During the project, the genomes of 2 504 individuals from 26 populations [23] were reconstructed. This allowed the establishment of a detailed catalogue of human genetic variations. Other projects aim at genomics data collection and analysis, but focus on specific goals. In these approaches, the reuse of the collected data is complex and privacy assurance can be questionable. Therefore, the goal of this methodology is to create strategies to study the genomics raw data that have been collected over the last decades without compromising any privacy issue or institutional rule. 3 Methodology The proposed methodology simplifies the process of studying genomics data in distributed and private repositories. This approach streamlines the entire process without removing full control of the data from the Data Owners. The data is kept in the Data Owners’ repositories and the analyses are performed locally. At the end, each Data Owner can share the results of the study without ever exposing the data repositories. In each study there are three different roles for the various participants (Fig. 1 ): • the Data Owner (DO): the entity responsible for managing the genomics repositories of each organisation; • the Researcher (R): the entity interested in analysing the data repositories and in performing the study; • the Study Manager (SM): the entity who coordinates the study and the distinct actors in the study. 3.1 The Genomics Catalogue The main purpose of this platform is to simplify genomics data exposure and sharing, without giving access to the data. Besides, the platform contains study management features, where users can select the repositories of interest and make research questions. Fig. 2 shows the platform with several repositories and the creation of a study request, i.e. a brief description of the research question to be tackled. This platform was built on top of Montra Framework [24] which was designed as an general engine to build data catalogues of biomedical databases. This system has a flexible data skeleton used to characterise data entities, and is easy to customise for different purposes. The tool also ensures access control and data privacy, following rule-based access policies that are essential to control what data is visible for the different access levels. Moreover, the data available in the platform only characterise the repositories’ content, which does not expose any sensitive information. The Montra Framework was previously used in other initiatives of biomedical data sharing, such as EMIF-Catalogue. 3 3 https://emif-catalogue.eu/. This web platform, developed in the European Medical Information Framework project (EMIF), 4 4 http://www.emif.eu. allows data owners to share information about their databases at different levels of access [25]. Similar to the Genomics Catalogue, the goal was to share metadata information about private data repositories in order to help researchers to find datasets of interest. 3.2 The genomics and proteomics toolkit The genomics and proteomics data in each repository usually follow standard formats. Therefore, we used GTO, 5 5 https://cobilab.github.io/gto/. a standalone toolkit to unify pipelines operating both at genomic and proteomic levels. This toolkit is composed of applications that allow the creation of workflows for identification of metagenomic composition in FASTQ reads, detection and visualisation of genomic rearrangements, mapping and visualisation of variation, localisation of low complexity regions, simulation of sequences with specific SNP and structural variant rates, among many other features [26]. GTO is open-source and written in a low-level language (e.g. C language) without external dependencies, built for ultra-fast computations and flexible integrations. The advantage of using open-source tools is the possibility to compile the code locally and have deep knowledge of how the tools are operating over the data. This allows technical teams from the DOs’ institutions to make sure there are no information leaks while maintaining faster computations. The toolkit supports Unix-like pipelines for easy integration of the available tools, which allows the creation of multiple processing workflows to answer research questions. This feature allows using a chain of processes, which can be easily shared between the DOs and executed locally, as shown in the following example: tool_1 < input | tool_2 | tool_3 > output To take full advantage of the GTO tools, end-users need to have basic shell script knowledge in order to build the analytic scripts. Therefore, script construction and validation is the responsibility of the SM, not invalidating the possibility of this being provided by the researcher. Several validated examples of pipelines built using this toolkit are currently available at https://github.com/cobilab/gto and have been used in many projects, for example, in a component of the development and integration of TRACESPipe [27]. 3.3 The workflow manager Studies have been simplified through the use of scientific workflow systems, which allow the combination and execution of computational processes, in cascade and over distributed environments [28,29]. One popular system is Taverna, 6 6 https://taverna.apache.org. an open-source scientific workflow management system used to facilitate computer simulation of repeatable scientific experiments [30]. Galaxy 7 7 https://galaxyproject.org. is another commonly used scientific workflow management system, with a user-friendly web interface that allows collaborative discussion of results and studies’ replication [31]. However, in our proposal, the study workflow can be coordinated independently of the solution chosen. In previous work, we developed TASKA, 8 8 https://bioinformatics.ua.pt/taska. which is a task/workflow management system designed as a modular web platform to facilitate studies' execution, team coordination, task scheduling and researcher collaboration [32]. In our pipeline, the study's coordination and monitoring were performed through this system, which contains different types of tasks essential for managing genomic studies: • a Simple task, where instructions are provided about what must be done. For instance, running a script attached to the task when there is no direct connection to execute it automatically in the repository. • a Form task, which allows the construction of a simple online questionnaire (text, multiple choices, etc.) which is then completed by assigned users. This task is used in our proposal for the DOs to indicate their availability to provide answers in each study or answer the research question based on the script execution. • a Processing task, designed to execute operations automatically without user interaction. For instance, running a pipeline built using the GTO toolkit over the data, when a direct connection is available (i.e., when the repository has a public API). The SM conducting the study is responsible for task assignment, scheduling management, and results compilation at the end. Fig. 3 shows a simple workflow to run a study aiming to analyse the complexity profile region in genomics data. The script was attached in the first task, and it will be executed by each DO locally in the second task. Then, the results are uploaded in the third task, when the SM will analyse, compile and answer the question in the final task. 3.4 Overview The proposed methodologies centralise the main information in the Repository Catalogue, which is the portal to present and manage the data available. In this platform, researchers can search for data sources of interest, create study requests and monitor the study status. However, other users with more advanced knowledge about the agents involved in the platform are responsible for managing the study (SM), by contacting and forwarding the request to the DO, and answering the researchers. This procedure is conducted with the support of TASKA, which helps during the monitoring of all tasks involved in the process. The researcher starts by formulating the study request, which can be a simple question or the analysis script if they have more advanced technical knowledge. The request is made in the Genomics Catalogue, where the repositories of interest for the study are also selected. Then, the SM analyses the request, evaluates the suitability of the question and the DO's willingness to participate in this study. During this stage, the SM analyses or builds the script using the GTO tools, and shares it with the DO using TASKA. After receiving all the DO's answers, the SM compiles the information and replies to the researcher. The researcher does not need to know who the Dos are or how to process the genomics data technically using the GTO tools. This is one of the SM's responsibilities. In addition, the SM knows the characteristics of the different repositories and who they need to contact to obtain the information. On the other hand, the DO's responsibilities are running the script provided by the SM locally and determining whether the results can be shared. This methodology gives DOs full control of the data, only sharing the results that do not violate the organisational policy. During this process, administrative issues and governance board approvals are also included in the protocol. These tasks are contemplated and managed in TASKA, where all the participants are able to monitor the study status. 4 Results The proposed methodology can be summarised in Fig. 4 , where the three different actors and their responsibilities in the study are well defined. The goal is to show how each entity can proceed in order to collaborate in the study and provide an answer to a research question. Additionally, in this collaboration, the source data is never exposed and the DOs have full control of what they want to share. The following set of steps reproduces the study feasibility using the proposed methodology. The governance and contractual aspects were ignored in this description, although this can be integrated into this workflow at any time. • Step 1: Creating study request - The methodology starts in the Genomics Catalogue, where the researcher creates a study request. - In this procedure, the researcher fills in a form describing the study objective, the datasets of interest and the research question. - These datasets can be discovered using the platform's search and compare features. - An example of a research question can be “Does a patient sequenced (FASTQ) sample contain SARS-CoV-2?” • Step 2: Feasibility and script definition - The SM is notified about the study request and analyses the feasibility based on the research question. - Assuming that the study request is feasible, the SM builds the analytic script using the tools in the GTO toolkit. - The script can also be created by the researcher, although we are presenting a scenario where this entity's technical knowledge is low. On the other hand, the SM needs to know how to work with these tools as well as how to contact the DO of each repository. - If a research study is not feasible, the workflow ends at this step. • Step 3: Defining and starting the study workflow - In TASKA, the SM creates a workflow of different tasks, in which some of these are assigned to the DO associated with the datasets of interest. - This tool manages the study flow and communications between the SM and the DO, in order to simplify the results. - The use of a workflow system in this step facilitates the tracking of studies in progress and keeps all the information in a centralised platform (i.e., message exchange between the SM and DOs, the status of each task, among others). • Step 4: Running script locally - The script is shared with the DO to be manually executed in the local computational resources. - This allows full control of what is happening with the data and assessing whether the result of the script execution can be shared to the study. - Whenever the repository is publicly available, the SM can also configure a different task in TASKA to execute this automatically. However, this is not the main focus of our methodology. • Step 5: Exporting and sending results - Locally in each DO institution, the script produces the results in different formats (i. e., SVG images showing statistical data, tabular information, small sets of reads, among others). - Before sending the results to the SM, the DOs can decide about how to proceed based on the script output. For example, the DOs can filter part of the results before sharing them with the SM. - The results are attached in TASKA, which notifies the SM about the study progress. • Step 6: Aggregating results - After all DOs complete their tasks, the SM can access the results uploaded in TASKA. - The upload results differ based on the research question. Therefore, when the SM defines the study workflow, this task must be designed according to the DOs' outputs. - The SM then compiles the collected data. In particular cases, for example, in the presence of multiple datasets, the GTO tools can again be used to perform this aggregation task. • Step 7: Results evaluation and reporting - Finally, the researcher receives a notification regarding the study results in the Genomics Catalogue. - In this catalogue, the researcher can access the results, and if required, additional information can be requested. The proposed methodology has supporting tools to manage the execution of genomics research studies over multiple and private biobanks. The possibility of isolating the data analysis locally is essential to preserve privacy rules, which allows the analysis of unexplored datasets, increasing the studies’ dimension. 5 Research application The proposed methodology shows the feasibility of performing distributed research studies over private genomics repositories. To develop this methodology, we use open-source tools in all the study steps, where the goal is to show successful outcomes applied to contemporary problems. Nevertheless, the same structure can be established using other tools. For instance, in this case, we use GTO to perform the study analysis, but this toolkit can use other tools that are not currently available to satisfy the study requirements. The same is true with the study manager. Although we used TASKA, another tool can be used for the study coordination between the SM and DOs. Therefore, using the proposed tools, we create a scenario to validate this methodology. 5.1 Study example: SARS-CoV-2 The proposed scenario to evaluate the feasibility of this methodology is based on the impact of Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) in 2020. SARS-CoV-2 is a positive-sense single-strand RNA virus with a tracked origin to a food market in Wuhan, China, in December 2019 which can cause COVID-19 [33]. The standard diagnostic method is real-time RT-qPCR (Reverse Transcriptase quantitative Polymerase Chain Reaction) applied to sub-regions of SARS-CoV-2. However, when dealing with a human sample, which potentially may contain SARS-CoV-2, privacy issues need careful consideration. Some issues are related to the presence of human genetic material that may reveal the individual's characteristics. Accordingly, to address two questions such as “Does this human sample contain SARS-CoV-2? If yes, what is the closest sequenced genome?” the diagnostic must be followed in accordance with preservation of the host's medical and forensic peculiarities. The problem escalates when different institutions need to report the results without sharing the samples and compromising individual privacy while maintaining identical characteristics of the analysis [34]. The following research application shows how to solve this problem. According to the methodology presented in this paper, a pipeline for SARS-CoV-2 is built using GTO and shared between institutions. Then, each institution runs the shared pipeline on their private server with the corresponding private data. Then the results are communicated to the original source and aggregated. In this subsection, we show in detail how to address this question, namely a description of all the materials used and the associated characteristics. The pipelines used in this task are freely available at https://github.com/cobilab/gto/tree/v1.5.3/pipelines and described as follows: • gto_build_xs_viral_db.sh: Designed to build a viral and human mitogenome dataset (references only). Since this script downloads the FASTA genomes forming the database, the script can be shared with the DO or in more restricted cases, the produced database can be compressed and then sent to the DOs. • gto_create_sars_dataset.sh: Creates a viral dataset considering the following set of ids: “AY386330.1″, “JN561323.2″, “X04370.1″, “MT007544″, “AB041963.1″, “MG921180.1″, “NC_012920.1”. This dataset was used by the SM to validate the processing pipeline, locally. • gto_sars_simulation_detection.sh: Builds a small FASTA database with viral references and human mitogenome. Then, it creates a FASTQ dataset containing SARS-CoV-2 and the human mitogenome (among others) and maps the existence of human mitogenome and viruses. This script has as input the database created with the gto_build_xs_viral_db.sh. • gto_download_sars2.sh: Downloads 93 SARS-CoV-2 genome sequences from the NCBI repositories. In order to avoid multiple calls to NCBI repositories, the result of this script can be compressed and then sent to the DO. • gto_find_best_sars2.sh: It finds the most similar SARS-CoV-2 genome sequences according to the RS (Relative Similarity) in the dataset produced by gto_sars_simulation_detection.sh. The SM with the five described pipelines can evaluate the feasibility of the research question by using synthetic data, and then send the processing pipelines to the DOs. Finally, the DOs run the pipelines in their private repositories and communicate the results. 5.2 Validation The proposed scenario is fully automatic metagenomic identification of viral content using the FASTQ sample that contains a SARS-Cov-2 genome. The pipeline contains filtering, trimming and mapping operations over the reads, and then performs sensitive identification of the most representative genomes followed by a ranking of abundance. This pipeline was validated using a semi-synthetic viral dataset of SARS-CoV-2 genomes with applied degrees of substitutions and block permutations shuffled with noisy synthetic sequences. The intention is to perform a metagenomic analysis on this dataset without informing the program what organisms are contained in the sample since the program needs to infer the results. Then, we compare the results with the ground truth. If the results are similar to the ground truth, then the pipeline is validated and can be shared with the DOs. For this purpose, GTO uses falcon-meta technology [35,36] which relies on assembly-free and alignment-free [37] comparison of each reference according to the whole reads. The dataset was constructed using gto_create_sars_dataset.sh which simulates synthetic reads (uniform distribution) merged with the following genomes and associated modifications: • SARS-CoV-2: one virus without editions (GID: MT007544.1); • MT: one human mitogenome with 1% of random substitutions (GID: NC_012920.1); • B19V: one B19 parvovirus with random permutations of 500 bases (GID: AY386330.1); • HPV: one human papillomavirus with 5% of random substitutions and random permutations of 300 bases (GID: MG921180.1); • HHV3: one human Herpesvirus 3 with permuted blocks of 300 bases (GID: X04370.1); • TTV: one human Torque teno virus with 5% of editions (GID: AB041963.1); • 300,000 bases of pseudo-random DNA simulated with a uniform distribution. After merging all FASTA sequences, ART [38] was used to generate the paired-end FASTQ reads. Meanwhile, another workflow example was used to create the viral and human mitogenome database (gto_build_xs_viral_db.sh) limited to reference sequences. Then, the pipeline (gto_sars_simulation_detection.sh), which uses the previous two pipelines for simulation, performs the metagenomic detection. The results are presented in Table 1 . According to Table 1, the FASTQ sample, among multiple genomes and the human mitogenome, contains a SARS-CoV-2 genome with a similarity match of 95.4% to the reference genome. Notice that the presence of the mitogenome would be a privacy issue that would lead to identification of the individual's forensic and medical characteristics [39]. Nevertheless, since the data is processed in a private machine, this information is not exported to external entities, respecting privacy concerns. The following procedure addresses the question of identifying the closest similar SARS-CoV-2 genome according to the existing sequencing database. Accordingly, we use the gto_download_sars2.sh pipeline to automatically download 93 SARS-CoV-2 genomes. Then, using the same FASTQ dataset (created with gto_create_sars_dataset.sh) and the previous set of 93 SARS-CoV-2 genomes, we perform an analysis of the most similar SARS-CoV-2 genome according to the reads (using gto_find_best_sars2.sh). These results are reported in Table 2 . As can be seen, the highest match is MT007544.1. Despite the well-known similarity between all the SARS-CoV-2 genomes [40], we were able to identify the exact genome from the set, showing the efficiency of this approach. This research application contains a practical and efficient methodology to solve current Covid-19 diagnostic challenges, effectively solving privacy issues that prevent cooperation between many scientific and industrial entities. Although the pipelines presented refer to a specific disease, the purpose of this methodology is easy creation and execution of genomic pipelines in the Dos’ facilities. 6 Discussion The proposed system has the goal of creating a methodology that helps researchers to conduct distributed studies analysing human genomes. The current tools designed for genome analysis typically require direct access to patients’ data, i.e., and researchers need to access data stored in the biobanks. However, this access often raises privacy issues. Our methodology addresses this problem by offering a straightforward workflow that simplifies communication and the exchange of results between all the actors involved in a study. The success of this methodology is due to the combination of several computational tools and algorithms that together provide a collaborative workflow, which can be customised for each research question, while ensuring privacy issues related to the raw data [41]. Therefore, the distributed analysis of private genomics information applied to the proposed scenario can be discussed based on two perspectives: 1) the technical challenges in conducting distributed studies; and 2) methodologies to study the study example (SARS-CoV-2). The idea of performing distributed medical studies is already applied in specific areas or with specific data types. For instance, Observational Health Data Sciences and Informatics (OHDSI) 9 9 http://www.ohdsi.org/. is an international organisation aiming to develop methodologies to support large-scale observational studies in health care data. The data used in these studies contains only the patients' structured information present in the Electronic Health Records (EHR) systems after being anonymised and harmonised into a relational common data model (CDM) [42]. OHDSI has an ecosystem of tools that allows preparation of the data in each data custodian as well as tools to define the study and spread it through the network of data owners [14]. The problem is they are only concerned with performing observational studies using the EHRs’ structured information. The European Medical Information Framework project (EMIF) 10 10 http://www.emif.eu. also had the goal of performing distributed medical studies. One of the tracks in this project aimed to accelerate the discovery and validation of new biomarkers to diagnose Alzheimer's Disease (AD) in the predementia stage, and to predict the rate of decline [43]. In this case, the distributed analysis follows a procedure similar to the OHDSI in the case of the structured information, but the analysis of biomarkers was performed in controlled environments. The proposed solution does not require the researcher to access the data. The previous methodologies are focused on providing strategies to study patients' information without exposing this information. However, both were designed to work with structured information. When the goal is to study human genomic data without violating patients’ privacy, there are different techniques. Tkachenko et al. [44] created a solution aiming for data privacy preservation for Genome-Wide Association Studies (GWAS) based on Secure Multi-Party Computation (SMPC). This cryptographic technique has the potential to enable secure data privacy, since it provides ways for entities to jointly compute a function using their inputs, without exposing these inputs [45]. This is a different way of addressing the distributed analysis of genomic information. However, the strategies that were based on SMPC require that all the entities adopt and implement a cryptographic system. Although considered secure, data owners usually feel more confident keeping the data undisclosed, which is the main goal of our methodology. The GTO toolkit used in the data analysis was chosen due to the richness of its algorithms, but the methodology is flexible enough to incorporate other tools. Another reason for this choice is that GTO also contains external tools. It is important to have a well-defined set of tools in the framework that can be used by all researchers. This practice will allow replication of the genomic pipelines built using those tools as well as confirmation of the results of each study. More importantly, data owners need to feel confident in installing and using those tools in their local environments. Thus, open-source or certified tools are the appropriate option for this step [46]. We focused on using only open-source tools and toolkits to have the full methodology available to the community. The research application was based on data from the COVID-19 pandemic. However, many other studies can be performed to address other research questions related to different diseases and/or genomes. This disease was chosen to prove that, with this methodology, it is possible to simplify the genomic analysis over multiple entities without sharing or exposing the original data. A great advance of our methodology is that it can be used during a pandemic, to obtain timely results, which are often delayed by ethical and legal issues. The only condition is the willing cooperation of researchers and data custodians in respecting data-access policies that may exist in different countries, institutions and groups. Other authors created computational approaches aiming to detect SARS-CoV-2 infections, potential drugs and therapeutic strategies regarding this disease as well as tracking and studying the evolution of the COVID-19 pandemic. Hufsky et al. [47] presented a review of tools with these goals, and each tool presented is currently free to use and available online. The European Virus Bioinformatics Center curates a list of bioinformatics tools specifically for SARS-CoV-2, 11 11 http://evbc.uni-jena.de/tools/coronavirus-tools/. and some of them were also analysed by Hufsky et al. [47]. Moreover, we identified from that list some tools with a similar goal as the pipelines presented in the research application. PriSeT 12 12 https://github.com/mariehoffmann/PriSeT. is a tool for computing SARS-CoV-2 specific primers for RT-PCR tests, enabling the detection of SARS-CoV-2 in a sample [48]. VADR 13 13 https://github.com/nawrockie/vadr. is a tool designed for validation and annotation of SARS-CoV-2 [48]. The annotation system was built based on the analysis of input nucleotide sequences using models created from curated RefSeqs [49]. The advantage of using a toolkit such as GTO is the possibility of building pipelines capable of performing similar tasks to those the tools presented were designed for. Since the goal of this work is to provide a generic solution, it is important to choose flexible software, without invalidating the possibility of integrating others. The results of the study example allowed validation of the toolkit analysis using public datasets. Researchers can perform a similar task, creating the pipelines in the research analysis. These pipelines can be easily shared with the data owners and the outputs do not expose any patient information. In fact, if the pipelines are a risk to patients’ privacy, the data owners can simply refuse to share the results. Therefore, with this methodology, it is possible to conduct studies without disclosing the data present in each location. 7 Conclusions Many private biobanks lack direct and cross-exploration due to privacy issues. Although many analysis pipelines exist, the critical issue of the multiple dimensionalities and sensitivity of the data remains an obstacle. In this paper, we proposed a new methodology that allows the exploration of private genomic and proteomic repositories without exposing their content. The privacy issues associated with sensitive data are solved with this methodology since the DOs have full control of the data, refusing unauthenticated access to the repositories. This methodology allows the exploration of multiple repositories, aggregating the results, and increasing the strength of scientific findings by analyzing higher volumes of data. The proposed methodology is a step forward in the cross-analysis of biobanks because it allows sharing architectural pipelines while preserving data privacy, through a process that is intuitive, simple and practical. References [1] J. Johnston J.D. Lantos A. Goldenberg F. Chen E. Parens B.A. Koenig N. Ethics P.A. Board Sequencing newborns: a call for nuanced use of genomic technologies Hastings Cent. Rep. 48 2018 S2 S6 J. Johnston, J. D. Lantos, A. Goldenberg, F. Chen, E. Parens, B. A. Koenig, N. Ethics, P. A. Board, Sequencing newborns: a call for nuanced use of genomic technologies, Hastings Center Report 48 (2018) S2-S6. [2] J. Kaye The tension between data sharing and the protection of privacy in genomics research Annu. Rev. Genom. Hum. Genet. 13 2012 415 431 10.1146/annurev-genom-082410-101454 J. Kaye, The tension between data sharing and the protection of privacy in genomics research, Annual review of genomics and human genetics 13 (2012) 415-431. doi:10.1146/annurev-genom-082410-101454. [3] V. Jalili M. Matteucci M. Masseroli S. Ceri Indexing next-generation sequencing data Inf. Sci. 384 2017 90 109 10.1016/j.ins.2016.08.085 V. Jalili, M. Matteucci, M. Masseroli, S. Ceri, Indexing next-generation sequencing data, Information Sciences 384 (2017) 90-109. doi:10.1016/j.ins.2016.08.085. [4] L. Coppola A. Cianflone A.M. Grimaldi M. Incoronato P. Bevilacqua F. Messina S. Baselice A. Soricelli P. Mirabelli M. Salvatore Biobanking in health care: evolution and future directions J. Transl. Med. 17 1 2019 172 10.1186/s12967-019-1922-3 L. Coppola, A. Cianflone, A. M. Grimaldi, M. Incoronato, P. Bevilacqua, F. Messina, S. Baselice, A. Soricelli, P. Mirabelli, M. Salvatore, Biobanking in health care: evolution and future directions, Journal of translational medicine 17 (1) (2019) 172. doi:10.1186/s12967-019-1922-3. [5] J.-E. Litton Launch of an infrastructure for health research: BBMRI-ERIC Biopreserv. Biobanking 16 3 2018 233 241 10.1089/bio.2018.0027 J.-E. Litton, Launch of an infrastructure for health research: BBMRI-ERIC, Biopreservation and biobanking 16 (3) (2018) 233-241. doi:10.1089/bio.2018.0027. [6] A. Liu K. Pollard Biobanking for personalized medicine Biobanking in the 21st Century 2015 Springer 55 68 10.1007/978-3-319-20579-3_5 A. Liu, K. Pollard, Biobanking for personalized medicine, in: Biobanking in the 21st Century, Springer, 2015, pp. 55-68. doi:10.1007/978-3-319-20579-3_5. [7] A. Amorim F. Pereira C. Alves O. García Species assignment in forensics and the challenge of hybrids Forensic Sci. Int.: Genetics 48 2020 102333 10.1016/j.fsigen.2020.102333 A. Amorim, F. Pereira, C. Alves, O. Garcia, Species assignment in forensics and the challenge of hybrids, Forensic Science International: Genetics 48 (2020) 102333. doi:10.1016/j.fsigen.2020.102333. [8] H. Langhof H. Kahrass S. Sievers D. Strech Access policies in biobank research: what criteria do they include and how publicly available are they? A cross-sectional study Eur. J. Hum. Genet. 25 3 2017 293 300 10.1038/ejhg.2016.172 H. Langhof, H. Kahrass, S. Sievers, D. Strech, Access policies in biobank research: what criteria do they include and how publicly available are they? A cross-sectional study, European Journal of Human Genetics 25 (3) (2017) 293-300. doi:10.1038/ejhg.2016.172. [9] J. Kulynych H.T. Greely Clinical genomics, big data, and electronic medical records: reconciling patient rights with research when privacy and science collide J. Law Biosci. 4 1 2017 94 132 10.1093/jlb/lsw061 J. Kulynych, H. T. Greely, Clinical genomics, big data, and electronic medical records: reconciling patient rights with research when privacy and science collide, Journal of Law and the Biosciences 4 (1) (2017) 94-132. doi:10.1093/jlb/lsw061. [10] P. Claes D.K. Liberton K. Daniels K.M. Rosana E.E. Quillen L.N. Pearson B. McEvoy M. Bauchet A.A. Zaidi W. Yao Modeling 3D facial shape from DNA PLoS Genet. 10 3 2014 10.1371/journal.pgen.1004224 P. Claes, D. K. Liberton, K. Daniels, K. M. Rosana, E. E. Quillen, L. N. Pearson, B. McEvoy, M. Bauchet, A. A. Zaidi, W. Yao, et al., Modeling 3D facial shape from DNA, PLoS genetics 10 (3) (2014). doi:10.1371/journal.pgen.1004224. [11] P.J. McLaren J.L. Raisaro M. Aouri M. Rotger E. Ayday I. Bartha M.B. Delgado Y. Vallet H.F. Günthard M. Cavassini Privacy-preserving genomic testing in the clinic: a model using HIV treatment Genet. Med. 18 8 2016 814 822 10.1038/gim.2015.167 P. J. McLaren, J. L. Raisaro, M. Aouri, M. Rotger, E. Ayday, I. Bartha, M. B. Delgado, Y. Vallet, H. F. Gunthard, M. Cavassini, et al., Privacy-preserving genomic testing in the clinic: a model using HIV treatment, Genetics in medicine 18 (8) (2016) 814-822. doi:10.1038/gim.2015.167. [12] D. Grishin K. Obbad G.M. Church Data privacy in the age of personal genomics Nat. Biotechnol. 37 10 2019 1115 1117 10.1038/s41587-019-0271-3 D. Grishin, K. Obbad, G. M. Church, Data privacy in the age of personal genomics, Nature biotechnology 37 (10) (2019) 1115-1117. doi:10.1038/s41587-019-0271-3. [13] M. Masseroli A. Kaitoua P. Pinoli S. Ceri Modeling and interoperability of heterogeneous genomic big data for integrative processing and querying Methods 111 2016 3 11 10.1016/j.ymeth.2016.09.002 M. Masseroli, A. Kaitoua, P. Pinoli, S. Ceri, Modeling and interoperability of heterogeneous genomic big data for integrative processing and querying, Methods 111 (2016) 3-11. doi:10.1016/j.ymeth.2016.09.002. [14] J.R. Almeida O. Fajarda A. Pereira J.L. Oliveira Strategies to access patient clinical data from distributed databases Proceedings of the 12th International Joint Conference on Biomedical Engineering Systems and Technologies - Volume 5 HEALTHINF: HEALTHINF 2019 INSTICC, SciTePress 466 473 10.5220/0007576104660473 J. R. Almeida, O. Fajarda, A. Pereira, J. L. Oliveira, Strategies to Access Patient Clinical Data from Distributed Databases, in: Proceedings of the 12th International Joint Conference on Biomedical Engineering Systems and Technologies - Volume 5 HEALTHINF: HEALTHINF, INSTICC, SciTePress, 2019, pp. 466-473. doi:10.5220/0007576104660473. [15] J.M. Gaziano J. Concato M. Brophy L. Fiore S. Pyarajan J. Breeling S. Whitbourne J. Deen C. Shannon D. Humphries Million Veteran Program: a mega-biobank to study genetic influences on health and disease J. Clin. Epidemiol. 70 2016 214 223 10.1016/j.jclinepi.2015.09.016 J. M. Gaziano, J. Concato, M. Brophy, L. Fiore, S. Pyarajan, J. Breeling, S. Whitbourne, J. Deen, C. Shannon, D. Humphries, et al., Million Veteran Program: a mega-biobank to study genetic influences on health and disease, Journal of clinical epidemiology 70 (2016) 214-223. doi:10.1016/j.jclinepi.2015.09.016. [16] C. Sudlow J. Gallacher N. Allen V. Beral P. Burton J. Danesh P. Downey P. Elliott J. Green M. Landray UK biobank: an open access resource for identifying the causes of a wide range of complex diseases of middle and old age PLoS Med. 12 3 2015 10.1371/journal.pmed.1001779 C. Sudlow, J. Gallacher, N. Allen, V. Beral, P. Burton, J. Danesh, P. Downey, P. Elliott, J. Green, M. Landray, et al., UK biobank: an open access resource for identifying the causes of a wide range of complex diseases of middle and old age, PLoS medicine 12 (3) (2015). doi:10.1371/journal.pmed.1001779. [17] M. Hosseini D. Pratas A.J. Pinho Cryfa: a secure encryption tool for genomic data Bioinformatics 35 1 2019 146 148 10.1093/bioinformatics/bty645 M. Hosseini, D. Pratas, A. J. Pinho, Cryfa: a secure encryption tool for genomic data, Bioinformatics 35 (1) (2019) 146-148. doi:10.1093/bioinformatics/bty645. [18] M. Toppinen D. Pratas E. Väisänen M. Söderlund-Venermo K. Hedman M.F. Perdomo A. Sajantila The landscape of persistent human DNA viruses in femoral bone Forensic Sci. Int.: Genetics 48 2020 102353 10.1016/j.fsigen.2020.102353 M. Toppinen, D. Pratas, E. Vaisanen, M. Soderlund-Venermo, K. Hedman, M. F. Perdomo, A. Sajantila, The landscape of persistent human DNA viruses in femoral bone, Forensic Science International: Genetics 48 (2020) 102353. doi:10.1016/j.fsigen.2020.102353. [19] H. Cho D.J. Wu B. Berger Secure genome-wide association analysis using multiparty computation Nat. Biotechnol. 36 6 2018 547 551 10.1038/nbt.4108 H. Cho, D. J. Wu, B. Berger, Secure genome-wide association analysis using multiparty computation, Nature biotechnology 36 (6) (2018) 547-551. doi:10.1038/nbt.4108. [20] J.P. Ioannidis T.A. Trikalinos M.J. Khoury Implications of small effect sizes of individual genetic variants on the design and interpretation of genetic association studies of complex diseases Am. J. Epidemiol. 164 7 2006 609 614 10.1093/aje/kwj259 J. P. Ioannidis, T. A. Trikalinos, M. J. Khoury, Implications of small effect sizes of individual genetic variants on the design and interpretation of genetic association studies of complex diseases, American journal of epidemiology 164 (7) (2006) 609-614. doi:10.1093/aje/kwj259. [21] S.S. Shringarpure C.D. Bustamante Privacy risks from genomic data-sharing beacons Am. J. Hum. Genet. 97 5 2015 631 646 10.1016/j.ajhg.2015.09.010 S. S. Shringarpure, C. D. Bustamante, Privacy risks from genomic data-sharing beacons, The American Journal of Human Genetics 97 (5) (2015) 631-646. doi:10.1016/j.ajhg.2015.09.010. [22] ENCODE Project Consortium and others An integrated encyclopedia of DNA elements in the human genome Nature 489 2012 57 74 10.1038/nature11247 (7414) ENCODE Project Consortium and others, An integrated encyclopedia of DNA elements in the human genome, Nature 489 (7414) (2012) 57-74. doi:10.1038/nature11247. [23] 1000 Genomes Project Consortium and others, A global reference for human genetic variation Nature 526 2015 68 74 10.1038/nature15393 (7571) 1000 Genomes Project Consortium and others, A global reference for human genetic variation, Nature 526 (7571) (2015) 68-74. doi:10.1038/nature15393. [24] L.B. Silva A. Trifan J.L. Oliveira Montra: an agile architecture for data publishing and discovery Comput. Methods Progr. Biomed. 160 2018 33 42 10.1016/j.cmpb.2018.03.024 L. B. Silva, A. Trifan, J. L. Oliveira, Montra: An agile architecture for data publishing and discovery, Computer methods and programs in biomedicine 160 (2018) 33-42. doi:10.1016/j.cmpb.2018.03.024. [25] J.L. Oliveira A. Trifan L.A.B. Silva EMIF Catalogue: a collaborative platform for sharing and reusing biomedical data Int. J. Med. Inf. 2019 10.1016/j.ijmedinf.2019.02.006 J. L. Oliveira, A. Trifan, L. A. B. Silva, EMIF Catalogue: A collaborative platform for sharing and reusing biomedical data, International Journal of Medical Informatics (2019). doi:10.1016/j.ijmedinf.2019.02.006. [26] J.R. Almeida A.J. Pinho J.L. Oliveira O. Fajarda D. Pratas GTO: a toolkit to unify pipelines in genomic and proteomic research SoftwareX 12 2020 100535 10.1016/j.softx.2020.100535 J. R. Almeida, A. J. Pinho, J. L. Oliveira, O. Fajarda, D. Pratas, GTO: A toolkit to unify pipelines in genomic and proteomic research, SoftwareX 12 (2020) 100535. doi:10.1016/j.softx.2020.100535. [27] D. Pratas M. Toppinen L. Pyöriä K. Hedman A. Sajantila M.F. Perdomo A hybrid pipeline for reconstruction and analysis of viral genomes at multi-organ level GigaScience 9 8 2020 10.1093/gigascience/giaa086 giaa086 D. Pratas, M. Toppinen, L. Pyoria, K. Hedman, A. Sajantila, M. F. Perdomo, A hybrid pipeline for reconstruction and analysis of viral genomes at multi-organ level, GigaScience 9 (8) (2020) giaa086. doi:10.1093/gigascience/giaa086. [28] C.S. Liew M.P. Atkinson M. Galea T.F. Ang P. Martin J.I.V. Hemert Scientific workflows: moving across paradigms ACM Comput. Surv. 49 4 2017 66 10.1145/3012429 C. S. Liew, M. P. Atkinson, M. Galea, T. F. Ang, P. Martin, J. I. V. Hemert, Scientific workflows: moving across paradigms, ACM Computing Surveys (CSUR) 49 (4) (2017) 66. doi:10.1145/3012429. [29] S. Holl O. Zimmermann M. Palmblad Y. Mohammed M. Hofmann-Apitius A new optimization phase for scientific workflow management systems Future Generat. Comput. Syst. 36 2014 352 362 10.1016/j.future.2013.09.005 S. Holl, O. Zimmermann, M. Palmblad, Y. Mohammed, M. Hofmann-Apitius, A new optimization phase for scientific workflow management systems, Future generation computer systems 36 (2014) 352-362. doi:10.1016/j.future.2013.09.005. [30] K. Wolstencroft R. Haines D. Fellows A. Williams D. Withers S. Owen S. Soiland-Reyes I. Dunlop A. Nenadic P. Fisher The Taverna workflow suite: designing and executing workflows of Web Services on the desktop, web or in the cloud Nucleic Acids Res. 41 W1 2013 W557 W561 10.1093/nar/gkt328 K. Wolstencroft, R. Haines, D. Fellows, A. Williams, D. Withers, S. Owen, S. Soiland-Reyes, I. Dunlop, A. Nenadic, P. Fisher, et al., The Taverna workflow suite: designing and executing workflows of Web Services on the desktop, web or in the cloud, Nucleic acids research 41 (W1) (2013) W557-W561. doi:10.1093/nar/gkt328. [31] J. Goecks A. Nekrutenko J. Taylor Galaxy: a comprehensive approach for supporting accessible, reproducible, and transparent computational research in the life sciences Genome Biol. 11 8 2010 R86 10.1186/gb-2010-11-8-r86 J. Goecks, A. Nekrutenko, J. Taylor, Galaxy: a comprehensive approach for supporting accessible, reproducible, and transparent computational research in the life sciences, Genome biology 11 (8) (2010) R86. doi:10.1186/gb-2010-11-8-r86. [32] J.R. Almeida R. Gini G. Roberto P. Rijnbeek J.L. Oliveira TASKA: a modular task management system to support health research studies BMC Med. Inf. Decis. Making 19 1 2019 121 10.1186/s12911-019-0844-6 J. R. Almeida, R. Gini, G. Roberto, P. Rijnbeek, J. L. Oliveira, TASKA: A modular task management system to support health research studies, BMC medical informatics and decision making 19 (1) (2019) 121. doi:10.1186/s12911-019-0844-6. [33] F. Wu S. Zhao B. Yu Y.-M. Chen W. Wang Z.-G. Song Y. Hu Z.-W. Tao J.-H. Tian Y.-Y. Pei A new coronavirus associated with human respiratory disease in China Nature 579 2020 265 269 10.1038/s41586-020-2008-3 (7798) F. Wu, S. Zhao, B. Yu, Y.-M. Chen, W. Wang, Z.-G. Song, Y. Hu, Z.-W. Tao, J.-H. Tian, Y.-Y. Pei, et al., A new coronavirus associated with human respiratory disease in China, Nature 579 (7798) (2020) 265-269. doi:10.1038/s41586-020-2008-3. [34] C. Heeney N. Hawkins J. de Vries P. Boddington J. Kaye Assessing the privacy risks of data sharing in genomics Public Health Genom. 14 1 2011 17 25 10.1159/000294150 C. Heeney, N. Hawkins, J. de Vries, P. Boddington, J. Kaye, Assessing the privacy risks of data sharing in genomics, Public health genomics 14 (1) (2011) 17-25. doi:10.1159/000294150. [35] D. Pratas A.J. Pinho Metagenomic composition analysis of sedimentary ancient DNA from the Isle of Wight 2018 26th European Signal Processing Conference (EUSIPCO) 2018 IEEE 1177 1181 10.23919/EUSIPCO.2018.8553297 D. Pratas, A. J. Pinho, Metagenomic composition analysis of sedimentary ancient DNA from the Isle of Wight, in: 2018 26th European Signal Processing Conference (EUSIPCO), IEEE, 2018, pp. 1177-1181. doi:10.23919/EUSIPCO.2018.8553297. [36] D. Pratas M. Hosseini G. Grilo A.J. Pinho R.M. Silva T. Caetano J. Carneiro F. Pereira Metagenomic composition analysis of an ancient sequenced polar bear jawbone from svalbard Genes 9 9 2018 445 10.3390/genes9090445 D. Pratas, M. Hosseini, G. Grilo, A. J. Pinho, R. M. Silva, T. Caetano, J. Carneiro, F. Pereira, Metagenomic Composition Analysis of an Ancient Sequenced Polar Bear Jawbone from Svalbard, Genes 9 (9) (2018) 445. doi:10.3390/genes9090445. [37] A. Zielezinski H.Z. Girgis G. Bernard C.-A. Leimeister K. Tang T. Dencker A.K. Lau S. Röhling J.J. Choi M.S. Waterman Benchmarking of alignment-free sequence comparison methods Genome Biol. 20 1 2019 144 10.1186/s13059-019-1755-7 A. Zielezinski, H. Z. Girgis, G. Bernard, C.-A. Leimeister, K. Tang, T. Dencker, A. K. Lau, S. Rohling, J. J. Choi, M. S. Waterman, et al., Benchmarking of alignment-free sequence comparison methods, Genome biology 20 (1) (2019) 144. doi:10.1186/s13059-019-1755-7. [38] W. Huang L. Li J.R. Myers G.T. Marth ART: a next-generation sequencing read simulator Bioinformatics 28 4 2011 593 594 10.1093/bioinformatics/btr708 W. Huang, L. Li, J. R. Myers, G. T. Marth, ART: a next-generation sequencing read simulator, Bioinformatics 28 (4) (2011) 593-594. doi:10.1093/bioinformatics/btr708. [39] Z. Lin A.B. Owen R.B. Altman Genomic research and human subject privacy Science 305 2004 10.1126/science.1095019 (5681) 183–183 Z. Lin, A. B. Owen, R. B. Altman, Genomic Research and Human Subject Privacy, Science 305 (5681) (2004) 183-183. doi:10.1126/science.1095019. [40] D. Pratas J.M. Silva Persistent minimal sequences of SARS-CoV-2 Bioinformatics 07 2020 10.1093/bioinformatics/btaa686 D. Pratas, J. M. Silva, Persistent minimal sequences of SARS-CoV-2, Bioinformatics (07 2020). doi:10.1093/bioinformatics/btaa686. [41] E. Vayena U. Gasser Between openness and privacy in genomics PLoS Med. 13 1 2016 e1001937 10.1371/journal.pmed.1001937 E. Vayena, U. Gasser, Between openness and privacy in genomics, PLoS medicine 13 (1) (2016) e1001937. doi:10.1371/journal.pmed.1001937. [42] G. Hripcsak J.D. Duke N.H. Shah C.G. Reich V. Huser M.J. Schuemie M.A. Suchard R.W. Park I.C.K. Wong P.R. Rijnbeek Observational health data sciences and Informatics (OHDSI): opportunities for observational researchers Stud. Health Technol. Inf. 216 2015 574 G. Hripcsak, J. D. Duke, N. H. Shah, C. G. Reich, V. Huser, M. J. Schuemie, M. A. Suchard, R. W. Park, I. C. K. Wong, P. R. Rijnbeek, et al., Observational Health Data Sciences and Informatics (OHDSI): opportunities for observational researchers, Studies in health technology and informatics 216 (2015) 574. [43] I. Bos S. Vos R. Vandenberghe P. Scheltens S. Engelborghs G. Frisoni J.L. Molinuevo A. Wallin A. Lleó J. Popp The EMIF-AD Multimodal Biomarker Discovery study: design, methods and cohort characteristics Alzheimer's Res. Ther. 10 1 2018 64 10.1186/s13195-018-0396-5 I. Bos, S. Vos, R. Vandenberghe, P. Scheltens, S. Engelborghs, G. Frisoni, J. L. Molinuevo, A. Wallin, A. Lleo, J. Popp, et al., The EMIF-AD Multimodal Biomarker Discovery study: design, methods and cohort characteristics, Alzheimer’s research & therapy 10 (1) (2018) 64. doi:10.1186/s13195-018-0396-5. [44] O. Tkachenko C. Weinert T. Schneider K. Hamacher Large-scale privacy-preserving statistical computations for distributed genome-wide association studies Proceedings of the 2018 on Asia Conference on Computer and Communications Security 2018 ASIACCS ’18, Association for Computing Machinery New York, NY, USA 221 235 10.1145/3196494.3196541 O. Tkachenko, C. Weinert, T. Schneider, K. Hamacher, Large-Scale Privacy-Preserving Statistical Computations for Distributed Genome-Wide Association Studies, in: Proceedings of the 2018 on Asia Conference on Computer and Communications Security, ASIACCS ’18, Association for Computing Machinery, New York, NY, USA, 2018, p. 221-235. doi:10.1145/3196494.3196541. [45] O. Goldreich Secure multi-party computation, Manuscript Preliminary Version 78 1998 O. Goldreich, Secure multi-party computation, Manuscript. Preliminary version 78 (1998). [46] L. Kannan M. Ramos A. Re N. El-Hachem Z. Safikhani D.M. Gendoo S. Davis D. Gomez-Cabrero R. Castelo K.D. Hansen Public data and open source tools for multi-assay genomic investigation of disease Briefings Bioinf. 17 4 2016 603 615 10.1093/bib/bbv080 L. Kannan, M. Ramos, A. Re, N. El-Hachem, Z. Safikhani, D. M. Gendoo, S. Davis, D. Gomez-Cabrero, R. Castelo, K. D. Hansen, et al., Public data and open source tools for multi-assay genomic investigation of disease, Briefings in bioinformatics 17 (4) (2016) 603-615. doi:10.1093/bib/bbv080. [47] F. Hufsky K. Lamkiewicz A. Almeida A. Aouacheria C. Arighi A. Bateman J. Baumbach N. Beerenwinkel C. Brandt M. Cacciabue Computational strategies to combat COVID-19: useful tools to accelerate SARS-CoV-2 and coronavirus research Briefings Bioinf. 11 2020 10.1093/bib/bbaa232 F. Hufsky, K. Lamkiewicz, A. Almeida, A. Aouacheria, C. Arighi, A. Bateman, J. Baumbach, N. Beerenwinkel, C. Brandt, M. Cacciabue, et al., Computational strategies to combat COVID-19: useful tools to accelerate SARS-CoV-2 and coronavirus research, Briefings in Bioinformatics (11 2020). doi:10.1093/bib/bbaa232. [48] M. Hoffmann M.T. Monaghan K. Reinert PriSeT: efficient de novo primer discovery BioRxiv 2020 10.1101/2020.04.06.027961 M. Hoffmann, M. T. Monaghan, K. Reinert, PriSeT: Efficient De Novo Primer Discovery, bioRxiv (2020). doi:10.1101/2020.04.06.027961. [49] A.A. Schäffer E.L. Hatcher L. Yankie L. Shonkwiler J.R. Brister I. Karsch-Mizrachi E.P. Nawrocki VADR: validation and annotation of virus sequence submissions to GenBank BMC Bioinf. 21 2020 1 23 10.1186/s12859-020-3537-3 A. A. Schaffer, E. L. Hatcher, L. Yankie, L. Shonkwiler, J. R. Brister, I. Karsch-Mizrachi, E. P. Nawrocki, VADR: validation and annotation of virus sequence submissions to GenBank, BMC Bioinformatics 21 (2020) 1-23. doi:10.1186/s12859-020-3537-3.", "scopus-id": "85098456035", "pubmed-id": "33360272", "coredata": {"eid": "1-s2.0-S0010482520305114", "dc:description": "Privacy issues limit the analysis and cross-exploration of most distributed and private biobanks, often raised by the multiple dimensionality and sensitivity of the data associated with access restrictions and policies. These characteristics prevent collaboration between entities, constituting a barrier to emergent personalized and public health challenges, namely the discovery of new druggable targets, identification of disease-causing genetic variants, or the study of rare diseases. In this paper, we propose a semi-automatic methodology for the analysis of distributed and private biobanks. The strategies involved in the proposed methodology efficiently enable the creation and execution of unified genomic studies using distributed repositories, without compromising the information present in the datasets. We apply the methodology to a case study in the current Covid-19, ensuring the combination of the diagnostics from multiple entities while maintaining privacy through a completely identical procedure. Moreover, we show that the methodology follows a simple, intuitive, and practical scheme.", "openArchiveArticle": "false", "prism:coverDate": "2021-03-31", "openaccessUserLicense": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0010482520305114", "dc:creator": [{"@_fa": "true", "$": "Almeida, João Rafael"}, {"@_fa": "true", "$": "Pratas, Diogo"}, {"@_fa": "true", "$": "Oliveira, José Luís"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0010482520305114"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0010482520305114"}], "dc:format": "application/json", "openaccessType": "Full", "pii": "S0010-4825(20)30511-4", "prism:volume": "130", "articleNumber": "104180", "prism:publisher": "The Authors. Published by Elsevier Ltd.", "dc:title": "A semi-automatic methodology for analysing distributed and private biobanks", "prism:copyright": "© 2020 The Authors. Published by Elsevier Ltd.", "openaccess": "1", "prism:issn": "00104825", "dcterms:subject": [{"@_fa": "true", "$": "Genomics studies"}, {"@_fa": "true", "$": "Distributed biobanks"}, {"@_fa": "true", "$": "Genomics cross-exploration"}, {"@_fa": "true", "$": "Coronavirus 2"}, {"@_fa": "true", "$": "SARS-CoV-2"}, {"@_fa": "true", "$": "Secondary use"}], "openaccessArticle": "true", "prism:publicationName": "Computers in Biology and Medicine", "openaccessSponsorType": "FundingBody", "prism:pageRange": "104180", "pubType": "fla", "prism:coverDisplayDate": "March 2021", "prism:doi": "10.1016/j.compbiomed.2020.104180", "prism:startingPage": "104180", "dc:identifier": "doi:10.1016/j.compbiomed.2020.104180", "openaccessSponsorName": "Portugal Institutes"}, "objects": {"object": [{"@category": "standard", "@height": "240", "@width": "388", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "102992", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "263", "@width": "535", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "91558", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "352", "@width": "535", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "115255", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "254", "@width": "535", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "115141", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "135", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "76156", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "107", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "70900", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "144", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "76244", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "104", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "75175", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "high", "@height": "1064", "@width": "1721", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "251665", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1163", "@width": "2370", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "265461", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1559", "@width": "2369", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "434092", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1125", "@width": "2370", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "373059", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0010482520305114-am.pdf?httpAccept=%2A%2F%2A", "@multimediatype": "Acrobat PDF file", "@type": "AAM-PDF", "@size": "1762750", "@ref": "am", "@mimetype": "application/pdf"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85098456035"}}