{"scopus-eid": "2-s2.0-85086630979", "originalText": "serial JL 312019 291210 291690 291735 291791 291848 31 90 SoftwareX SOFTWAREX 2020-06-20 2020-06-20 2020-06-20 2020-06-20 2021-06-24T16:39:01 1-s2.0-S2352711020301473 S2352-7110(20)30147-3 S2352711020301473 10.1016/j.softx.2020.100535 S300 S300.3 FULL-TEXT 1-s2.0-S2352711020X00021 2021-06-24T16:23:59.139745Z 0 0 20200701 20201231 2020 2020-06-20T23:10:09.350353Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid fundingbodyid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight oauserlicense openaccess openarchive pg pgfirst pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder sponsoredaccesstype srctitle srctitlenorm srctype ssids alllist content oa subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor grantsponsorid primabst pubtype ref 2352-7110 23527110 UNLIMITED NONE true 12 12 C Volume 12 21 100535 100535 100535 202007 202012 July–December 2020 2020-07-01 2020-12-31 2020 simple-article osp © 2020 The Authors. Published by Elsevier B.V. GTOATOOLKITUNIFYPIPELINESINGENOMICPROTEOMICRESEARCH ALMEIDA J 1 Motivation and significance 2 Software description 2.1 Software architecture 2.2 Software functionalities 2.2.1 Genomics 2.2.2 Proteomics 2.2.3 General purpose 2.2.4 External tools 3 Illustrative examples 3.1 Bi-directional complexity profiles 3.2 Rearrangements map generation 3.3 Viral metagenomic identification 4 Impact 5 Conclusions Acknowledgements References MARDIS 2017 213 E VANDERAUWERA 2013 G KESSNER 2008 2534 2536 D CHEN 2018 i884 i890 S LIU 2019 4560 4567 Y GRABOWSKI 2019 677 678 S MALYSA 2015 3122 3129 G LIU 2019 2066 2074 Y CHANDAK 2019 2674 2676 S PINHO 2013 e79922 A PINHO 2011 2024 2028 A 201119THEUROPEANSIGNALPROCESSINGCONFERENCE SYMBOLICNUMERICALCONVERSIONDNASEQUENCESUSINGFINITECONTEXTMODELS PRATAS 2019 137 145 D INTERNATIONALCONFERENCEPRACTICALAPPLICATIONSCOMPUTATIONALBIOLOGYBIOINFORMATICS GECO2OPTIMIZEDTOOLFORLOSSLESSCOMPRESSIONANALYSISDNASEQUENCES HOSSEINI 2019 68 76 M CARVALHO 2018 49 55 J HOSSEINI 2016 56 M AGUEROCHAPIN 2006 723 730 G PRATAS 2015 10203 D ZIELEZINSKI 2019 A BENCHMARKINGALIGNMENTFREESEQUENCECOMPARISONMETHODS FORSLUND 2019 469 504 S EVOLUTIONARYGENOMICS EVOLUTIONPROTEINDOMAINARCHITECTURES ROST 1999 85 94 B PRATAS 2018 D FALCONAMETHODINFERMETAGENOMICCOMPOSITIONANCIENTDNA PRATAS 2018 1177 1181 D 201826THEUROPEANSIGNALPROCESSINGCONFERENCEEUSIPCO METAGENOMICCOMPOSITIONANALYSISSEDIMENTARYANCIENTDNAISLEWIGHT HUANG 2011 593 594 W DROOP 2016 1883 1884 A AFGAN 2018 W537 W544 E SHEN 2016 e0163962 W DEPRISTO 2011 491 M GOECKS 2010 R86 J BLANKENBERG 2010 1783 1785 D LIU 2017 3364 3372 Y OCHOA 2014 626 633 I DEOROWICZ 2015 11565 S PRATAS 2018 105 113 D INTERNATIONALCONFERENCEPRACTICALAPPLICATIONSCOMPUTATIONALBIOLOGYBIOINFORMATICS COMPRESSIONAMINOACIDSEQUENCES PRATAS 2014 40 D ESCALONA 2016 459 M ALMEIDAX2020X100535 ALMEIDAX2020X100535XJ Full 2020-06-03T16:10:38Z Author http://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license. © 2020 The Authors. Published by Elsevier B.V. 2021-06-03T16:43:35.966Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/aggregated-refined Foundation for Science and Technology SFRH/BD/147837/2019 UIDB/00127/2020 FCT Fundação para a Ciência e a Tecnologia http://data.elsevier.com/vocabulary/SciValFunders/501100001871 http://sws.geonames.org/2264397/ Centro 2020 program NETDIAMOND POCI-01-0145-FEDER-016385 This work has received support from the NETDIAMOND, Portugal project ( POCI-01-0145-FEDER-016385 ), co-funded by Centro 2020 program, Portugal 2020, European Union , and from the FCT - Foundation for Science and Technology, Portugal , in the context of the project UIDB/00127/2020. João Almeida is supported by FCT - Foundation for Science and Technology, Portugal (national funds), grant SFRH/BD/147837/2019 . item S2352-7110(20)30147-3 S2352711020301473 1-s2.0-S2352711020301473 10.1016/j.softx.2020.100535 312019 2021-06-24T16:23:59.139745Z 2020-07-01 2020-12-31 UNLIMITED NONE 1-s2.0-S2352711020301473-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/MAIN/application/pdf/965023f63523483f6552937b9ed1d295/main.pdf main.pdf pdf true 1061501 MAIN 6 1-s2.0-S2352711020301473-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/PREVIEW/image/png/11240ee7f96eb65ef9ed0fd05e627429/main_1.png main_1.png png 51343 849 656 IMAGE-WEB-PDF 1 1-s2.0-S2352711020301473-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr3/DOWNSAMPLED/image/jpeg/799612e494897eef03d097e5c73e2e3d/gr3.jpg gr3 gr3.jpg jpg 21082 116 376 IMAGE-DOWNSAMPLED 1-s2.0-S2352711020301473-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr1/DOWNSAMPLED/image/jpeg/6e4d71c430ea465b9792ac35fc6b2fad/gr1.jpg gr1 gr1.jpg jpg 51221 263 470 IMAGE-DOWNSAMPLED 1-s2.0-S2352711020301473-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr4/DOWNSAMPLED/image/jpeg/f353994c70569c3cf36633c848654f01/gr4.jpg gr4 gr4.jpg jpg 24493 141 376 IMAGE-DOWNSAMPLED 1-s2.0-S2352711020301473-fx1001.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/fx1001/DOWNSAMPLED/image/jpeg/36e362322f6f5a751fcf77a2667fecbf/fx1001.jpg fx1001 fx1001.jpg jpg 4519 27 817 IMAGE-DOWNSAMPLED 1-s2.0-S2352711020301473-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr2/DOWNSAMPLED/image/jpeg/29e1e37ce7ea955a609bb4415891bd1e/gr2.jpg gr2 gr2.jpg jpg 16382 83 470 IMAGE-DOWNSAMPLED 1-s2.0-S2352711020301473-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr3/THUMBNAIL/image/gif/864950a72cff0b5bd3d88caf40f19aa9/gr3.sml gr3 gr3.sml sml 6347 68 219 IMAGE-THUMBNAIL 1-s2.0-S2352711020301473-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr1/THUMBNAIL/image/gif/0616254614e3b7d5323d28114ad6f6b2/gr1.sml gr1 gr1.sml sml 10351 123 219 IMAGE-THUMBNAIL 1-s2.0-S2352711020301473-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr4/THUMBNAIL/image/gif/dbd78daea549a258fa68a095f130da5c/gr4.sml gr4 gr4.sml sml 7605 82 219 IMAGE-THUMBNAIL 1-s2.0-S2352711020301473-fx1001.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/fx1001/THUMBNAIL/image/gif/12bea7ed52b3531aadab49a272c67fa9/fx1001.sml fx1001 fx1001.sml sml 777 7 219 IMAGE-THUMBNAIL 1-s2.0-S2352711020301473-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr2/THUMBNAIL/image/gif/18ebc69475e746fc709c64db22234d06/gr2.sml gr2 gr2.sml sml 3191 39 219 IMAGE-THUMBNAIL 1-s2.0-S2352711020301473-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr3/HIGHRES/image/jpeg/d6958a208935fb4a1dd5e8585b6bdb1e/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 155334 516 1668 IMAGE-HIGH-RES 1-s2.0-S2352711020301473-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr1/HIGHRES/image/jpeg/a70b90057afb64a5cb199460facec9ac/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 436164 1166 2083 IMAGE-HIGH-RES 1-s2.0-S2352711020301473-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr4/HIGHRES/image/jpeg/55b497b0bea915b30866bab3a6c06f46/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 160054 624 1667 IMAGE-HIGH-RES 1-s2.0-S2352711020301473-fx1001_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/fx1001/HIGHRES/image/jpeg/28bf0189b498ee57e0fa19a4bbcc9570/fx1001_lrg.jpg fx1001 fx1001_lrg.jpg jpg 16238 73 2171 IMAGE-HIGH-RES 1-s2.0-S2352711020301473-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/gr2/HIGHRES/image/jpeg/c09a158e2a381841c821d73f1258f673/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 128419 370 2083 IMAGE-HIGH-RES 1-s2.0-S2352711020301473-si1.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S2352711020301473/STRIPIN/image/svg+xml/49e2d1fd928ab9a51e3f9991fff94a11/si1.svg si1 si1.svg svg 667 ALTIMG SOFTX 100535 100535 S2352-7110(20)30147-3 10.1016/j.softx.2020.100535 The Authors Fig. 1 Bi-directional complexity profiles of four types of human Herpesvirus (HHV2, HHV3, HHV4 and HHV7) generated with GTO using the pipeline: gto_complexity_profile_regions.sh. Complexity values below one are highlighted with blue colour while the others with green. Bps stands for bits per symbol where lower values represent redundancy. The length is in Kb (Kilobases) and all profiles use the same scale. (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) Fig. 2 Bi-directional complexity profiles of human titin protein generated with GTO using the pipeline: gto_proteins_complexity_profile_regions.sh. Complexity values below three are highlighted with a red colour while the others with blue. Bps stands for bits per symbol where lower values represent redundancy. The length is in Ks (Kilosymbols). (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) Fig. 3 Rearrangements map generated with GTO using the pipeline: gto_map_rearrangements.sh. The length of both sequences (A and B) is 5 MB. Wave pattern stands for inverted repeated regions. Fig. 4 Rearrangements map generated with GTO using the pipeline: gto_map_rearrangements_proteins.sh. Table 1 The eight most representative reference sequences according to the RS (Relative Similarity). ID stands for the order of the top output, length for the size of the reference genome, and GID for the sequence global identifier. ID Length RS (%) Reference GID Virus name 1 124884 97.767 X04370.1 HHV3 2 5596 96.603 AY386330.1 B19V 3 172764 94.143 DQ279927.1 HHV4 4 154675 81.400 JN561323.2 HHV2 5 154746 80.153 Z86099.2 HHV2 6 2785 78.300 AB041963.1 TTV 7 7372 71.445 MG921180.1 HPV 8 549 47.591 AY034056.1 PHV3-BALF1-gene Original software publication GTO: A toolkit to unify pipelines in genomic and proteomic research João R. Almeida a b ⁎ Armando J. Pinho a José L. Oliveira a Olga Fajarda a Diogo Pratas a c a Department of Electronics, Telecommunications and Informatics (DETI/IEETA), University of Aveiro, Aveiro, Portugal Department of Electronics, Telecommunications and Informatics (DETI/IEETA), University of Aveiro Aveiro Portugal Department of Electronics, Telecommunications and Informatics (DETI/IEETA), University of Aveiro, Aveiro, Portugal b Department of Information and Communications Technologies, University of A Coruña, A Coruña, Spain Department of Information and Communications Technologies, University of A Coruña, A Coruña Spain Department of Information and Communications Technologies, University of A Coruña, A Coruña, Spain c Department of Virology, University of Helsinki, Helsinki, Finland Department of Virology, University of Helsinki Helsinki Finland Department of Virology, University of Helsinki, Helsinki, Finland ⁎ Corresponding author at: Department of Electronics, Telecommunications and Informatics (DETI/IEETA), University of Aveiro, Aveiro, Portugal. Department of Electronics, Telecommunications and Informatics (DETI/IEETA), University of Aveiro Aveiro Portugal Next-generation sequencing triggered the production of a massive volume of publicly available data and the development of new specialised tools. These tools are dispersed over different frameworks, making the management and analyses of the data a challenging task. Additionally, new targeted tools are needed, given the dynamics and specificities of the field. We present GTO, a comprehensive toolkit designed to unify pipelines in genomic and proteomic research, which combines specialised tools for analysis, simulation, compression, development, visualisation, and transformation of the data. This toolkit combines novel tools with a modular architecture, being an excellent platform for experimental scientists, as well as a useful resource for teaching bioinformatics enquiry to students in life sciences. GTO is implemented in C language and is available, under the MIT license, at https://bioinformatics.ua.pt/gto. Keywords Genomic Toolkit Proteomic Toolkit Next-generation sequencing Code metadata Current code version v1.5 Permanent link to code/repository used for this code version https://github.com/ElsevierSoftwareX/SOFTX_2020_147 Legal Code License MIT Code versioning system used GIT Software code languages, tools, and services used C Compilation requirements, operating environments & dependencies GCC and Make If available Link to developer documentation/manual https://github.com/cobilab/gto/blob/v1.5/manual/manual.pdf Support email for questions pratas@ua.pt Software metadata Current software version v1.5 Permanent link to executables of this version https://anaconda.org/Cobilab/gto Legal Software License MIT Computing platforms/Operating Systems Linux and Unix-like Installation requirements & dependencies GCC and Make If available, link to user manual - if formally published include a reference to the publication in the reference list https://github.com/cobilab/gto/blob/v1.5/manual/manual.pdf Support email for questions pratas@ua.pt 1 Motivation and significance Next-generation sequencing (NGS) has become an essential tool in genetic and genomic analysis with a substantial impact in the fields of biomedicine and anthropology. The advantages of NGS over traditional methods include its multiplex capability and analytical resolution, making it a time and cost-efficient approach for fast clinical and forensic screening [1]. The development of efficient bioinformatics tools is essential to assess and analyse the large volumes of sequencing data produced by next-generation sequencers. However, more important than that are the computational methods that unify the existing tools, given the notable pace at which these tools become available. Toolkits are sets of tools that combine multiple features in a custom-based manner as some examples show, both in genomics [2] and proteomics [3]. Developing a toolkit requires a specific architecture, namely, taking into account the purpose and technologies, accessibility, compatibility, portability, interoperability, and usability. Moreover, implementation needs to consider efficiency, while maintaining affordable computational resources and the absence of dependencies (standalone use). We contribute with GTO (Genomic Toolkit), a set of tools to unify pipelines operating both at genomic and proteomic levels, with an open licence and free of any dependency. This toolkit includes information theory-based tools for reference-free and reference-based data compression applied to data analysis. Among many applications, this toolkit supports the creation of workflows for identification of metagenomic composition in FASTQ reads, detection and visualisation of genomic rearrangements, mapping and visualisation of variation, localisation of low complexity regions, or simulation of sequences with specific SNP and structural variant rates. The toolkit was designed for Unix/Linux-based systems, built for ultra-fast computations. It supports pipes for easy integration with the sub-programmes as well as external tools. GTO works as LEGOsTM , since it allows the construction of multiple pipelines with many combinations. We support the toolkit with a detailed manual and a website with several examples, including an online manual for fast learning. Due to the variety and distribution of the given tools and their tight interconnection using the command line with pipes, the toolkit is an excellent platform for scientists as well as for empowering students to progress to the scientific aspects of bioinformatics analysis efficiently. Therefore, without the need to install multiple programmes, dependencies, and read different manuals or licences, it is possible to maintain an easy-to-follow connection with all the phases of each pipeline application. 2 Software description GTO is a powerful toolkit composed of more than 75 tools with particular focus on genomics and proteomics, following an integrative and flexible design between the tools. GTO includes tools for information display, randomisation, edition, conversion, extraction, search, calculation, compression, simulation and visualisation. The toolkit can be used in common Linux distributions. We have been using GTO in common personal computers (e.g. a laptop with 8 GB RAM, 128 GB of SSD and an intel-i3 CPU from the 5th generation), but these characteristics can vary according to the data size and the execution requirements. 2.1 Software architecture The tools composing this toolkit aim for key features such as being easy to use, compile and improve and specially designed for work in Unix/Linux command line. These tools can be used in isolation, or combined as one, forming execution workflows. This is technically possible due to the two streams used for the computation, namely the standard input and output. Furthermore, the tools’ aggregation is possible with mechanisms for inter-process communication using message passing, provided by the Unix operating system. This creates a chain of processes in which the output of each process is passed directly as input to the subsequent one, as shown in the following example: In addition to the input/output standard streams, some of the tools accept parameterisation through the definition of arguments when executed. There is also a small set of tools in which the input or output does not make sense to be the standard streams and for those the argument definition is considered. 2.2 Software functionalities The toolkit contains three main groups of tools according to its characteristic: Genomics, Proteomics, and General purpose. The genomics group is subdivided in: FASTQ, FASTA, SEQ (genomic sequences); while the proteomics contains AA (amino acid); the general-purpose tools can be applied to any format sequence. 2.2.1 Genomics The toolkit allows data conversion between different formats namely FASTQ, FASTA and SEQ. It also provides features for filtering and randomising DNA sequences, as well as for analytic purposes followed by simulations of a generation and alteration nature. The SEQ cluster works directly with the DNA sequences without any standard format. These tools allow data extraction, summary, classification and mathematical operations in the field of information theory. Among many examples, which are better described in the supporting website and manual, the toolkit allows preparations of the reads, namely filtering and trimming, the automatic construction of nucleotide reference databases, and comparative genomics. 2.2.2 Proteomics The toolkit has a specific cluster of tools designed to group, compress, and analyse amino acid sequences. These tools allow proteomic analysis based on the amino acids properties, such as electric charge (positive and negative), uncharged side chains, hydrophobic side chains and special cases. The toolkit allows translation of codons into amino acids, permits finding approximate amino acid sequences and performing comparative proteomics analysis. 2.2.3 General purpose This set of tools is complementary to the genomics and proteomics tools, not being designed to work in a specific field, but to assist the pipelines composed of the previously described subsets. These tools provide operations in the symbolical domain, including reversion, segmentation, and permutation; while in the numerical domain they contain tools with low-pass filters (with multiple window types), sum, min and max operations over streams. 2.2.4 External tools External top-performing tools have been integrated in order to increase the variety of functionalities available. The tools integrated are the following: • fastp [4]: enables ultra-fast preprocessing and quality control of FASTQ files. • bfMEM [5]: detects maximal exact matches between a pair of genomes based on bloom filters and rolling hashs. • copMEM [6]: another tool for computing maximal exact matches in a pair of genomes. • qvz [7]: implements a lossy compression algorithm for storing quality scores associated with DNA sequencing. • minicom [8]: a compressor for short reads in FASTQ files that uses large k-minimisers to index the reads. • SPRING [9]: which is reference-free compression tool for FASTQ files. 3 Illustrative examples All the tools in the toolkit were tested with synthetic sequences aiming for individual validation. Therefore, the documented examples are easily replicable with the written tests. Besides applying these tools in controlled environments, the toolkit was also used in several research workflows both as a primary and auxiliary tool. Several complete workflows are available in the repository, under the pipelines folder while an extensive description of the tool can be found in the manual. Next, we include some pipeline examples. 3.1 Bi-directional complexity profiles A workflow example is the computation of bi-directional complexity profiles in any genomic or proteomic sequence [10]. These profiles can localise specific features in the sequences, namely low and high complexity sequences, inverted repeats regions, tandem duplications, among others. The construction of these profiles follows a pipeline formed of many transformations (e.g. reversing, segmenting, inverting) as well as the use of specific low-pass filters after data compression applications [11]. Fig. 1 depicts the complexity profiles of four human Herpesvirus whole genomes using the same scale, where redundant regions are highlighted in blue (below a Bps of one). GTO uses GeCo2 [12] and AC [13] compressors to estimate the local complexity of DNA and amino acid sequences, respectively. However, GTO is not limited to using these data compressors. For example, new models can be tested under this framework, namely with extended alphabets [14]. In general, any data compressor able to output local estimations can be used in the pipeline as an alternative [15]. Analogous to the complexity profiles for DNA sequences, an example using amino acid sequences is given in Fig. 2. This example depicts a bi-directional complexity profile for the largest human protein sequence, titin. Several regions with low complexity are usually associated with specific characteristics, namely loops [16]. 3.2 Rearrangements map generation Another example workflow is in the domain of comparative genomics, namely to map and visualise rearrangements. This workflow is completely automatic from the input of the sequences to the generation of an SVG image, with the associated and transformed regions corresponding to the rearrangements. The pipeline applies smash technology [17,18] for mapping the rearrangements using an alignment-free methodology [19]. To prove the efficiency of the mapping pipeline, we use another pipeline to generate two identical FASTA files with simulated rearrangements between them (gto_simulate_rearragements.sh). After, loading the two FASTA files into the mapping pipeline (gto_map_rearrangements.sh), the output is two files, one with the mapping positions and the other is an SVG image depicting the mapped positions as can be seen in Fig. 3. All the rearrangements have been efficiently mapped with GTO according to the ground truth ( < 1 s of computational time). Analogous to the rearrangements map pipeline, for mapping at proteomic level, we consider the NAV2 HUMAN Neuron navigator 2 and the neuron navigator 2 isoform X15 of Macaca mulatta proteins. Although there are many examples under the proteome evolution [20], these are protein sequences considering identical scale [21]. Additionally, we shuffled the Macaca mulatta proteins using a block size of 300 amino acids. Fig. 4 depicts the proteins map after running the pipeline (gto_map_rearrangements_proteins.sh). Despite a low level of dissimilarity of the sequences with an additional pseudo-random permutation of blocks of 300 symbols, all the regions have been efficiently mapped with GTO ( < 1 s of computational time). 3.3 Viral metagenomic identification A final workflow example is the full automatic metagenomic identification of viral (or any other) content in FASTQ reads. This includes the filtering and trimming of the reads, mapping, and sensitive identification of the most representative genomes, under a ranking of abundance. In this particular example, we generate a semi-synthetic viral dataset containing several real viruses with applied degrees of substitutions and block permutations shuffled with synthetic noisy DNA. This dataset is generated using the gto_create_viral_dataset.sh pipeline. The intention is to perform a metagenomic analysis on this dataset without informing the programme what organisms are contained in the sample since the programme needs to infer the results. Then, we compare the results with the ground truth. If the results are similar to the ground truth, then the methodology is validated. For the purpose, GTO uses falcon-meta technology [22,23] that relies on assembly-free and alignment-free comparison of each reference according to the whole reads. The dataset contains synthetic reads (uniform distribution) merged with the following viruses with the respective modifications: • B19V: two Parvovirus, one with 1% of editions and the other with permuted blocks of 500 bases (GID: AY386330.1); • HHV2: one human Herpesvirus 2 with permuted blocks of size 100 bases (GID: JN561323.2); • HHV3: one human Herpesvirus 3 (GID: X04370.1); • HHV4: two human Herpesvirus 4, one with permuted blocks of 300 bases (GID: DQ279927.1); • TTV: one human Torque teno virus with 5% of editions (GID: AB041963.1); • HPV: one human Papillomavirus with 5% of editions and permuted blocks of 300 bases (GID: MG921180.1). After merging all FASTA sequences, ART [24] was used to generate the paired end FASTQ reads. Meanwhile, another workflow example was used to create the viral database (gto_build_dbs.sh). Then, the pipeline (gto_metagenomics.sh) ran, obtaining the top output presented in Table 1. We can conclude that despite the noise, editions, and permutations applied to real data, all the viruses have been efficiently identified with GTO, including the exact genotype ( < 1.5 min of computational time). 4 Impact Many software application exist to analyse and manipulate sequencing data, namely fqtools [25], GALAXY [26], FASTX-Toolkit [27], SeqKit [28], GATK [29], among others. The fqtools is a suite of tools to view, manipulate and summarise FASTQ data [25]. This software was designed to work specifically with FASTQ files and can be easily integrated into our toolkit. However, the features existent in this software are similar to some of the ones that GTO has in the gto_fastq_* section. Both were written in C which in terms of performance could be similar. GALAXY, is an open and web-based scientific platform for analysing genomic data [30]. This platform integrates several specialised sets of tools, e.g. for manipulating FASTQ files [31]. In this web application, the FASTX-Toolkit was integrated, which is a collection of command-line tools to process FASTA and FASTQ files [27]. The available features in the FASTX-Toolkit are also similar to some of the GTO tools designed to preprocess the FASTA/FASTQ files, which are available in the gto_fastq_* and gto_fasta_* sections. As our goal always was to have an easy to use toolkit written in low-level programming languages and not a web interface, we cannot compare it with GALAXY. However, regarding the FASTX-Toolkit which was also written in C, it is possible to compare and combine it with some of the GTO’s features. The SeqKit is another toolkit used to process FASTA and FASTQ files and it is available for all major operating systems [28]. Comparing the performance and limitations of this toolkit with the fqtools and FASTX-Toolkit is easier than comparing them with GTO, mainly because these three toolkits were designed specifically to manipulate FASTA/FASTQ files. On the other hand, these functionalities are only a fraction of the features that we provide in GTO. The idea never was to create more tools to compete with the ones existing, but instead, aggregate them in order to obtain a more complete toolkit for genomics analysis. This idea of simplifying the development and aggregation of analysis tools for genomic manipulation and analysis is not new. Initially designed as a structured programming framework, the Genome Analysis Toolkit (GATK) is a set of bioinformatics tools for analysing high-throughput sequencing focused on variant discovering and genotyping [2]. The high performance of this toolkit is due to the required infrastructures that a personal computer cannot offer. This is an excellent toolkit that integrates Apache Spark for optimisation, but it is only possible to take advantage of this potential in cloud computing. The efficient performance from some of the presented tools as well as GTO’s tools is due to the use of low-level programming languages (e.g. C language). However, one limitation of this strategy, in which the performance is prioritised, is the lack of a graphical user interface. Moreover, to take full advantage from those tools, the end-users need to have basic shell script knowledge. Nevertheless, GTO combines specialised tools for analysis, simulation, compression, development, visualisation, and transformation of data. Therefore, we would like to highlight some important details that characterise this toolkit: • The toolkit aggregates different tools in order to build research pipelines to deal with very large data sets without losing performance due to its modular architecture. Adoption of standard streams to interconnect the tools improved data processing. Throughout this procedure, the disk read/write operations between tools have been removed by sending the output directly to the input of the next tool. • The toolkit can integrate external tools, besides the ones already available. As such, some specific tools that have already been evaluated and used outside this context were aggregated: – For compression purposes, the toolkit integrates GeCo2 [12], which along with HiRGC [32], iDoComp [33] and GDC2 [34] are considered to have some of the best performance for reference-free DNA compression [35]. Regarding the amino acid sequences, the toolkit uses the AC tool for lossless sequence compression. The performance of AC was compared in [36] to several general-purpose lossless compressors and several protein compressors using different proteomes and AC provides on average the best bit-rates. – Concernings simulation, GTO integrates XS [37] which is a FASTQ read simulation tool. Escalona et al. [38] reviewed 23 NGS simulation tools and XS stands out in relation to the others because it is the only one that does not need a reference sequence. – Additionally, we added a section in the toolkit specially designed for tools from other authors. This way, we simplify their integration and installation using GTO. Those were described in Section 2.2.4. • Finally, as briefly presented in Section 3, the toolkit can answer new genomics questions without the need to create new software. 5 Conclusions We contribute with GTO, a toolkit to unify research pipelines, composed of distinct tools aiming at efficient combinations of them towards specific workflows. GTO’s efficient performance is due to the use of low-level programming languages, which increases the processing speed and decreases the RAM of addressing genomics and proteomics data. The flexibility of this toolkit allows the end-user to quickly create new processing pipelines in the genomic and proteomic field as it was described in the examples provided in this manuscript. Declaration of Competing Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Acknowledgements This work has received support from the NETDIAMOND, Portugal project (POCI-01-0145-FEDER-016385), co-funded by Centro 2020 program, Portugal 2020, European Union, and from the FCT - Foundation for Science and Technology, Portugal, in the context of the project UIDB/00127/2020. João Almeida is supported by FCT - Foundation for Science and Technology, Portugal (national funds), grant SFRH/BD/147837/2019. References [1] Mardis E.R. DNA sequencing technologies: 2006–2016 Nat Protoc 12 2 2017 213 E. R. Mardis, DNA sequencing technologies: 2006–2016, Nature Protocols 12 (2) (2017) 213. [2] Van der Auwera G.A. Carneiro M.O. Hartl C. Poplin R. Del Angel G. Levy-Moonshine A. From FASTQ data to high-confidence variant calls: the genome analysis toolkit best practices pipeline Curr Protoc Bioinform 43 1 2013 11.10.1-11.10.33 G. A. Van der Auwera, M. O. Carneiro, C. Hartl, R. Poplin, G. Del Angel, A. Levy-Moonshine, T. Jordan, K. Shakir, D. Roazen, J. Thibault, others,From FASTQ data to high-confidence variant calls: the genome analysis toolkit best practices pipeline, Current Protocols in Bioinformatics 43 (1) (2013) 11–10. [3] Kessner D. Chambers M. Burke R. Agus D. Mallick P. ProteoWizard: open source software for rapid proteomics tools development Bioinformatics 24 21 2008 2534 2536 D. Kessner, M. Chambers, R. Burke, D. Agus, P. Mallick, ProteoWizard: open source software for rapid proteomics tools development, Bioinformatics 24 (21) (2008) 2534–2536. [4] Chen S. Zhou Y. Chen Y. Gu J. Fastp: an ultra-fast all-in-one FASTQ preprocessor Bioinformatics 34 17 2018 i884 i890 S. Chen, Y. Zhou, Y. Chen, J. Gu, fastp: an ultra-fast all-in-one FASTQ preprocessor, Bioinformatics 34 (17) (2018) i884–i890. [5] Liu Y. Zhang L.Y. Li J. Fast detection of maximal exact matches via fixed sampling of query K-mers and Bloom filtering of index K-mers Bioinformatics 35 22 2019 4560 4567 Y. Liu, L. Y. Zhang, J. Li, Fast detection of maximal exact matches via fixed sampling of query K-mers and Bloom filtering of index K-mers, Bioinformatics 35 (22) (2019) 4560–4567. [6] Grabowski S. Bieniecki W. CopMEM: finding maximal exact matches via sampling both genomes Bioinformatics 35 4 2019 677 678 S. Grabowski, W. Bieniecki, copMEM: finding maximal exact matches via sampling both genomes, Bioinformatics 35 (4) (2019) 677–678. [7] Malysa G. Hernaez M. Ochoa I. Rao M. Ganesan K. Weissman T. QVZ: lossy compression of quality values Bioinformatics 31 19 2015 3122 3129 G. Malysa, M. Hernaez, I. Ochoa, M. Rao, K. Ganesan, T. Weissman, QVZ: lossy compression of quality values, Bioinformatics 31 (19) (2015) 3122–3129. [8] Liu Y. Yu Z. Dinger M.E. Li J. Index suffix–prefix overlaps by (w, k)-minimizer to generate long contigs for reads compression Bioinformatics 35 12 2019 2066 2074 Y. Liu, Z. Yu, M. E. Dinger, J. Li, Index suffix–prefix overlaps by (w, k)-minimizer to generate long contigs for reads compression, Bioinformatics 35 (12) (2019) 2066–2074. [9] Chandak S. Tatwawadi K. Ochoa I. Hernaez M. Weissman T. SPRING: a next-generation compressor for FASTQ data Bioinformatics 35 15 2019 2674 2676 S. Chandak, K. Tatwawadi, I. Ochoa, M. Hernaez, T. Weissman, SPRING: a next-generation compressor for FASTQ data, Bioinformatics 35 (15) (2019) 2674–2676. [10] Pinho A.J. Garcia S.P. Pratas D. Ferreira P.J. DNA sequences at a glance PLoS One 8 11 2013 e79922 A. J. Pinho, S. P. Garcia, D. Pratas, P. J. Ferreira, DNA sequences at a glance, PloS one 8 (11) (2013) e79922. [11] Pinho A.J. Pratas D. Ferreira P.J. Garcia S.P. Symbolic to numerical conversion of DNA sequences using finite-context models 2011 19th European signal processing conference 2011 IEEE 2024 2028 A. J. Pinho, D. Pratas, P. J. Ferreira, S. P. Garcia, Symbolic to numerical conversion of DNA sequences using finite-context models, in: 2011 19th European Signal Processing Conference, IEEE, 2011, 2024–2028. [12] Pratas D. Hosseini M. Pinho A.J. GeCo2: an optimized tool for lossless compression and analysis of DNA sequences International conference on practical applications of computational biology & bioinformatics 2019 Springer 137 145 D. Pratas, M. Hosseini, A. J. Pinho, GeCo2: an optimized tool for lossless compression and analysis of DNA sequences, in: International Conference on Practical Applications of Computational Biology & Bioinformatics, Springer, 2019, 137–145. [13] Hosseini M. Pratas D. Pinho A.J. AC: a compression tool for amino acid sequences Interdiscip Sci: Comput Life Sci 11 1 2019 68 76 M. Hosseini, D. Pratas, A. J. Pinho, AC: a compression tool for amino acid sequences, Interdisciplinary Sciences: Computational Life Sciences 11 (1) (2019) 68–76. [14] Carvalho J.M. Brás S. Pratas D. Ferreira J. Soares S.C. Pinho A.J. Extended-alphabet finite-context models Pattern Recognit Lett 112 2018 49 55 J. M. Carvalho, S. Brás, D. Pratas, J. Ferreira, S. C. Soares, A. J. Pinho, Extended-alphabet finite-context models, Pattern Recognition Letters 112 (2018) 49–55. [15] Hosseini M. Pratas D. Pinho A. A survey on data compression methods for biological sequences Information 7 4 2016 56 M. Hosseini, D. Pratas, A. Pinho, A survey on data compression methods for biological sequences, Information 7 (4) (2016) 56. [16] Agüero-Chapin G. González-Díaz H. Molina R. Varona-Santos J. Uriarte E. González-Díaz Y. Novel 2D maps and coupling numbers for protein sequences. The first QSAR study of polygalacturonases; isolation and prediction of a novel sequence from Psidium guajava L. FEBS Lett 580 3 2006 723 730 G. Agüero-Chapin, H. González-Díaz, R. Molina, J. Varona-Santos, E. Uriarte, Y. González-Díaz, Novel 2D maps and coupling numbers for protein sequences. The first QSAR study of polygalacturonases isolation and prediction of a novel sequence from Psidium guajava L., FEBS Letters 580 (3) (2006) 723–730. [17] Pratas D. Silva R.M. Pinho A.J. Ferreira P.J. An alignment-free method to find and visualise rearrangements between pairs of DNA sequences Sci Rep 5 2015 10203 D. Pratas, R. M. Silva, A. J. Pinho, P. J. Ferreira, An alignment-free method to find and visualise rearrangements between pairs of DNA sequences, Scientific Reports 5 (2015) 10203. [18] Hosseini M, Pratas D, Morgenstern B, Pinho AJ. Smash++: an alignment-free and memory-efficient tool to find genomic rearrangements. GigaScience 9(5). [19] Zielezinski A. Girgis H.Z. Bernard G. Leimeister C.-A. Tang K. Dencker T. Benchmarking of alignment-free sequence comparison methods 2019 BioRxiv A. Zielezinski, H. Z. Girgis, G. Bernard, C.-A. Leimeister, K. Tang, T. Dencker, A. K. Lau, S. Röhling, J. Choi, M. S. Waterman, others,Benchmarking of alignment-free sequence comparison methods, BioRxiv (2019) 611137. [20] Forslund S.K. Kaduk M. Sonnhammer E.L. Evolution of protein domain architectures Evolutionary genomics 2019 Springer 469 504 S. K. Forslund, M. Kaduk, E. L. Sonnhammer, Evolution of protein domain architectures, in: Evolutionary Genomics, Springer, 2019, 469–504. [21] Rost B. Twilight zone of protein sequence alignments Protein Eng 12 2 1999 85 94 B. Rost, Twilight zone of protein sequence alignments, Protein engineering 12 (2) (1999) 85–94. [22] Pratas D. Pinho A.J. Silva R.M. Rodrigues J.M. Hosseini M. Caetano T. FALCON: a method to infer metagenomic composition of ancient DNA 2018 BioRxiv D. Pratas, A. J. Pinho, R. M. Silva, J. M. Rodrigues, M. Hosseini, T. Caetano, P. J. Ferreira, FALCON: a method to infer metagenomic composition of ancient DNA, BioRxiv (2018) 267179. [23] Pratas D. Pinho A.J. Metagenomic composition analysis of sedimentary ancient DNA from the isle of wight 2018 26th european signal processing conference (EUSIPCO) 2018 IEEE 1177 1181 D. Pratas, A. J. Pinho, Metagenomic composition analysis of sedimentary ancient DNA from the Isle of Wight, in: 2018 26th European Signal Processing Conference (EUSIPCO), IEEE, 2018, 1177–1181. [24] Huang W. Li L. Myers J.R. Marth G.T. ART: a next-generation sequencing read simulator Bioinformatics 28 4 2011 593 594 W. Huang, L. Li, J. R. Myers, G. T. Marth, ART: a next-generation sequencing read simulator, Bioinformatics 28 (4) (2011) 593–594. [25] Droop A.P. Fqtools: an efficient software suite for modern FASTQ file manipulation Bioinformatics 32 12 2016 1883 1884 A. P. Droop, fqtools: an efficient software suite for modern FASTQ file manipulation, Bioinformatics 32 (12) (2016) 1883–1884. [26] Afgan E. Baker D. Batut B. Van Den Beek M. Bouvier D. Čech M. The galaxy platform for accessible, reproducible and collaborative biomedical analyses: 2018 update Nucleic Acids Res 46 W1 2018 W537 W544 E. Afgan, D. Baker, B. Batut, M. Van Den Beek, D. Bouvier, M. Čech, J. Chilton, D. Clements, N. Coraor, B. A. Grüning, others,The Galaxy platform for accessible, reproducible and collaborative biomedical analyses: 2018 update, Nucleic acids research 46 (W1) (2018) W537–W544. [27] Gordon A, Hannon G et al. Fastx-toolkit, FASTQ/A short-reads preprocessing tools http://hannonlab.cshl.edu/fastx_toolkit Accessed: 2020-06-17. [28] Shen W. Le S. Li Y. Hu F. SeqKit: a cross-platform and ultrafast toolkit for FASTA/Q file manipulation PLoS One 11 10 2016 e0163962 W. Shen, S. Le, Y. Li, F. Hu, SeqKit: a cross-platform and ultrafast toolkit for FASTA/Q file manipulation, PLoS One 11 (10) (2016) e0163962. [29] DePristo M.A. Banks E. Poplin R. Garimella K.V. Maguire J.R. Hartl C. A framework for variation discovery and genotyping using next-generation DNA sequencing data Nature Genet 43 5 2011 491 M. A. DePristo, E. Banks, R. Poplin, K. V. Garimella, J. R. Maguire, C. Hartl, A. A. Philippakis, G. Del Angel, M. A. Rivas, M. Hanna, others,A framework for variation discovery and genotyping using next-generation DNA sequencing data, Nature Genetics 43 (5) (2011) 491. [30] Goecks J. Nekrutenko A. Taylor J. Galaxy: a comprehensive approach for supporting accessible, reproducible, and transparent computational research in the life sciences Genome Biol 11 8 2010 R86 J. Goecks, A. Nekrutenko, J. Taylor, Galaxy: a comprehensive approach for supporting accessible, reproducible, and transparent computational research in the life sciences, Genome Biology 11 (8) (2010) R86. [31] Blankenberg D. Gordon A. Von Kuster G. Coraor N. Taylor J. Nekrutenko A. Manipulation of FASTQ data with galaxy Bioinformatics 26 14 2010 1783 1785 D. Blankenberg, A. Gordon, G. Von Kuster, N. Coraor, J. Taylor, A. Nekrutenko, G. Team, Manipulation of FASTQ data with Galaxy, Bioinformatics 26 (14) (2010) 1783–1785. [32] Liu Y. Peng H. Wong L. Li J. High-speed and high-ratio referential genome compression Bioinformatics 33 21 2017 3364 3372 Y. Liu, H. Peng, L. Wong, J. Li, High-speed and high-ratio referential genome compression, Bioinformatics 33 (21) (2017) 3364–3372. [33] Ochoa I. Hernaez M. Weissman T. iDoComp: a compression scheme for assembled genomes Bioinformatics 31 5 2014 626 633 I. Ochoa, M. Hernaez, T. Weissman, iDoComp: a compression scheme for assembled genomes, Bioinformatics 31 (5) (2014) 626–633. [34] Deorowicz S. Danek A. Niemiec M. GDC 2: Compression of large collections of genomes Sci Rep 5 2015 11565 S. Deorowicz, A. Danek, M. Niemiec, GDC 2: Compression of large collections of genomes, Scientific Reports 5 (2015) 11565. [35] Hernaez M, Pavlichin D, Weissman T, Ochoa I. Genomic data compression. Annu Rev Biomed Data Sci 2. [36] Pratas D. Hosseini M. Pinho A.J. Compression of amino acid sequences International conference on practical applications of computational biology & bioinformatics 2018 Springer 105 113 D. Pratas, M. Hosseini, A. J. Pinho, Compression of amino acid sequences, in: International Conference on Practical Applications of Computational Biology & Bioinformatics, Springer, 2018, 105–113. [37] Pratas D. Pinho A.J. Rodrigues J.M. XS: a FASTQ read simulator BMC Res Notes 7 1 2014 40 D. Pratas, A. J. Pinho, J. M. Rodrigues, XS: a FASTQ read simulator, BMC Research Notes 7 (1) (2014) 40. [38] Escalona M. Rocha S. Posada D. A comparison of tools for the simulation of genomic next-generation sequencing data Nature Rev Genet 17 8 2016 459 M. Escalona, S. Rocha, D. Posada, A comparison of tools for the simulation of genomic next-generation sequencing data, Nature Reviews Genetics 17 (8) (2016) 459.", "scopus-id": "85086630979", "coredata": {"eid": "1-s2.0-S2352711020301473", "dc:description": "Next-generation sequencing triggered the production of a massive volume of publicly available data and the development of new specialised tools. These tools are dispersed over different frameworks, making the management and analyses of the data a challenging task. Additionally, new targeted tools are needed, given the dynamics and specificities of the field. We present GTO, a comprehensive toolkit designed to unify pipelines in genomic and proteomic research, which combines specialised tools for analysis, simulation, compression, development, visualisation, and transformation of the data. This toolkit combines novel tools with a modular architecture, being an excellent platform for experimental scientists, as well as a useful resource for teaching bioinformatics enquiry to students in life sciences. GTO is implemented in C language and is available, under the MIT license, at https://bioinformatics.ua.pt/gto.", "openArchiveArticle": "false", "prism:coverDate": "2020-12-31", "openaccessUserLicense": "http://creativecommons.org/licenses/by/4.0/", "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S2352711020301473", "dc:creator": [{"@_fa": "true", "$": "Almeida, João R."}, {"@_fa": "true", "$": "Pinho, Armando J."}, {"@_fa": "true", "$": "Oliveira, José L."}, {"@_fa": "true", "$": "Fajarda, Olga"}, {"@_fa": "true", "$": "Pratas, Diogo"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S2352711020301473"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S2352711020301473"}], "dc:format": "application/json", "openaccessType": "Full", "pii": "S2352-7110(20)30147-3", "prism:volume": "12", "articleNumber": "100535", "prism:publisher": "The Authors. Published by Elsevier B.V.", "dc:title": "GTO: A toolkit to unify pipelines in genomic and proteomic research", "prism:copyright": "© 2020 The Authors. Published by Elsevier B.V.", "openaccess": "1", "prism:issn": "23527110", "dcterms:subject": [{"@_fa": "true", "$": "Genomic Toolkit"}, {"@_fa": "true", "$": "Proteomic Toolkit"}, {"@_fa": "true", "$": "Next-generation sequencing"}], "openaccessArticle": "true", "prism:publicationName": "SoftwareX", "openaccessSponsorType": "Author", "prism:pageRange": "100535", "pubType": "osp", "prism:coverDisplayDate": "July–December 2020", "prism:doi": "10.1016/j.softx.2020.100535", "prism:startingPage": "100535", "dc:identifier": "doi:10.1016/j.softx.2020.100535", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "116", "@width": "376", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "21082", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "263", "@width": "470", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "51221", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "141", "@width": "376", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "24493", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "27", "@width": "817", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-fx1001.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "4519", "@ref": "fx1001", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "83", "@width": "470", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "16382", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "68", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6347", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "123", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "10351", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "82", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "7605", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "7", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-fx1001.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "777", "@ref": "fx1001", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "39", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3191", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "high", "@height": "516", "@width": "1668", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "155334", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1166", "@width": "2083", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "436164", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "624", "@width": "1667", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "160054", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "73", "@width": "2171", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-fx1001_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "16238", "@ref": "fx1001", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "370", "@width": "2083", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "128419", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S2352711020301473-si1.svg?httpAccept=%2A%2F%2A", "@multimediatype": "Scalable Vector Graphics file", "@type": "ALTIMG", "@size": "667", "@ref": "si1", "@mimetype": "image/svg+xml"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85086630979"}}